Repository: thepetk/python-docs-gr
Catalog: tutorial/controlflow.po
Languages: el

source: More Control Flow Tools
el: Περισσότερα εργαλεία Ελέγχου Ροής

source: As well as the :keyword:`while` statement just introduced, Python uses a few more that we will encounter in this chapter.
el: Εκτός από τη πρόταση :keyword:`while` που μόλις εισήχθη, η Python χρησιμοποιεί μερικές ακόμη που θα συναντήσουμε σε αυτό το κεφάλαιο.

source: :keyword:`!if` Statements
el: Προτάσεις :keyword:`!if`

source: Perhaps the most well-known statement type is the :keyword:`if` statement. For example::
el: Ίσως ο πιο γνωστός τύπος statement είναι η πρόταση :keyword:`if`. Για παράδειγμα::

source: There can be zero or more :keyword:`elif` parts, and the :keyword:`else` part is optional. The keyword ':keyword:`!elif`' is short for 'else if', and is useful to avoid excessive indentation. An :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... sequence is a substitute for the ``switch`` or ``case`` statements found in other languages.
el: Μπορεί να υπάρχουν μηδέν ή περισσότερα μέρη :keyword:`elif` και το τμήμα :keyword:`else` είναι προαιρετικό. To keyword ':keyword:`!elif`' είναι συντομογραφία του 'else if', και είναι χρήσιμη για να αποφύγετε την υπερβολική εσοχή. Μια ακολουθία keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... είναι υποκατάστατο των δηλώσεων ``switch`` ή ``case`` που υπάρχουν σε άλλες γλώσσες.

source: If you're comparing the same value to several constants, or checking for specific types or attributes, you may also find the :keyword:`!match` statement useful. For more details see :ref:`tut-match`.
el: Εάν συγκρίνετε την ίδια τιμή με πολλές σταθερές ή ελέγχετε για συγκεκριμένους τύπους ή χαρακτηριστικά, μπορεί επίσης να βρείτε χρήσιμη τη δήλωση :keyword:`!match` Για περισσότερες λεπτομέρειες, ανατρέξτε στο :ref:`tut-match`.

source: :keyword:`!for` Statements
el: Προτάσεις :keyword:`!for`

source: The :keyword:`for` statement in Python differs a bit from what you may be used to in C or Pascal. Rather than always iterating over an arithmetic progression of numbers (like in Pascal), or giving the user the ability to define both the iteration step and halting condition (as C), Python's :keyword:`!for` statement iterates over the items of any sequence (a list or a string), in the order that they appear in the sequence. For example (no pun intended):
el: Η δήλωση :keyword:`for` στην Python διαφέρει λίγο από αυτό που μπορεί να έχετε συνηθίσει στη C ή στην Pascal. Αντί να επαναλαμβάνετε πάντα μια αριθμητική πρόοδο αριθμών (όπως στη Pascal) ή να δίνετε στον χρήστη τη δυνατότητα να ορίσει τόσο το βήμα επανάληψης όσο και τη συνθήκη διακοπής (όπως C),η δήλωση της Python :keyword:`!for` επαναλαμβάνεται πάνω από τα στοιχεία οποιασδήποτε ακολουθίας (λίστας ή συμβολοσειράς), με τη σειρά που εμφανίζονται στην ακολουθία. Για παράδειγμα (χωρίς λογοπαίγνιο)::

source: Code that modifies a collection while iterating over that same collection can be tricky to get right. Instead, it is usually more straight-forward to loop over a copy of the collection or to create a new collection::
el: Ο κώδικας που τροποποιεί μια συλλογή ενώ επαναλαμβάνεται πάνω από την ίδια συλλογή μπορεί να είναι δύσκολος για να γίνει σωστός. Αντίθετα, είναι συνήθως πιο απλό να κάνετε loop πάνω από ένα αντίγραφο συλλογής ή να δημιουργήσετε μια νέα συλλογή::

source: The :func:`range` Function
el: Η συνάρτηση :func:`range`

source: If you do need to iterate over a sequence of numbers, the built-in function :func:`range` comes in handy. It generates arithmetic progressions::
el: Εάν χρειάζεται να κάνετε επανάληψη σε μια ακολουθία αριθμών, η ενσωματωμένη (built-in) συνάρτηση :func:`range` είναι χρήσιμη. Δημιουργεί αριθμητικές προόδους::

source: The given end point is never part of the generated sequence; ``range(10)`` generates 10 values, the legal indices for items of a sequence of length 10. It is possible to let the range start at another number, or to specify a different increment (even negative; sometimes this is called the 'step')::
el: Το δεδομένο τελικό σημείο δεν αποτελεί ποτέ μέρος της παραγόμενης ακολουθίας· το ``range(10)`` δημιουργεί 10 τιμές, τους δείκτες για στοιχεία μιας ακολουθίας μήκους 10. Είναι δυνατόν να αφήσουμε το εύρος να ξεκινά από άλλο αριθμό ή για να καθορίσετε μια διαφορετική προσαύξηση (ακόμη και αρνητική, μερικές φορές αυτό ονομάζεται 'βήμα')::

source: To iterate over the indices of a sequence, you can combine :func:`range` and :func:`len` as follows::
el: Για να γίνουν iterate οι δείκτες μια ακολουθίας, μπορείτε να συνδυάσετε τις :func:`range` και :func:`len` ως εξής::

source: In most such cases, however, it is convenient to use the :func:`enumerate` function, see :ref:`tut-loopidioms`.
el: Στις περισσότερες τέτοιες περιπτώσεις, ωστόσο, είναι βολικό να χρησιμοποιήσετε τη συνάρτηση :func:`enumerate`, δείτε :ref:`tut-loopidioms`.

source: A strange thing happens if you just print a range::
el: Ένα περίεργο πράγμα συμβαίνει αν απλώς εκτυπώσετε ένα range::

source: In many ways the object returned by :func:`range` behaves as if it is a list, but in fact it isn't. It is an object which returns the successive items of the desired sequence when you iterate over it, but it doesn't really make the list, thus saving space.
el: Με πολλούς τρόπους το αντικείμενο που επιστρέφεται από το :func:`range` συμπεριφέρεται σαν να είναι μια λίστα, αλλά στην πραγματικότητα δεν είναι. Είναι ένα αντικείμενο που επιστρέφει τα διαδοχικά στοιχεία της επιθυμητής ακολουθίας όταν κάνετε επανάληψη πάνω του, αλλά δεν μπαίνει πραγματικά στη λίστα, εξοικονομώντας έτσι χώρο.

source: We say such an object is :term:`iterable`, that is, suitable as a target for functions and constructs that expect something from which they can obtain successive items until the supply is exhausted. We have seen that the :keyword:`for` statement is such a construct, while an example of a function that takes an iterable is :func:`sum`::
el: Λέμε ότι ένα τέτοιο αντικείμενο είναι :term:`iterable`, δηλαδή, κατάλληλο ως στόχος για συναρτήσεις και κατασκευές που περιμένουν κάτι από το οποίο μπορούν να λάβουν διαδοχικά στοιχεία μέχρι να εξαντληθεί η προσφορά. Είδαμε ότι η δήλωση :keyword:`for` είναι μια τέτοια κατασκευή, ενώ ένα παράδειγμα συνάρτησης που παίρνει ένα iterable είναι η :func:`sum`::

source: Later we will see more functions that return iterables and take iterables as arguments. In chapter :ref:`tut-structures`, we will discuss in more detail about :func:`list`.
el: Αργότερα θα δούμε περισσότερες συναρτήσεις που επιστρέφουν iterables και λαμβάνουν τους iterables ως ορίσματα. Στο κεφάλαιο :ref:`tut-structures`, θα συζητήσουμε λεπτομερέστερα για το :func:`list`.

source: :keyword:`!break` and :keyword:`!continue` Statements
el: :keyword:`!break` και :keyword:`!continue` Προτάσεις

source: The :keyword:`break` statement breaks out of the innermost enclosing :keyword:`for` or :keyword:`while` loop::
el: Η δήλωση :keyword:`break` ξεφεύγει από τον πιο εσωτερικό βρόχο :keyword:`for` ή :keyword:`while`::

source: The :keyword:`continue` statement continues with the next iteration of the loop::
el: Η δήλωση :keyword:`continue` συνεχίζεται με την επόμενη επανάληψη του βρόχου::

source: :keyword:`!else` Clauses on Loops
el: :keyword:`!else` Ρήτρες στους βρόχους

source: In a :keyword:`!for` or :keyword:`!while` loop the :keyword:`!break` statement may be paired with an :keyword:`!else` clause. If the loop finishes without executing the :keyword:`!break`, the :keyword:`!else` clause executes.
el: Σε έναν βρόχο :keyword:`!for` ή :keyword:`!while` η πρόταση :keyword:`!break` μπορεί να συνδυαστεί με μια πρόταση :keyword:`!else`. Εάν ο βρόχος τελειώσει χωρίς να εκτελεστεί η :keyword:`!break`, εκτελείται ο όρος :keyword:`!else`.

source: In a :keyword:`for` loop, the :keyword:`!else` clause is executed after the loop finishes its final iteration, that is, if no break occurred.
el: Σε έναν βρόχο :keyword:`for`, η πρόταση :keyword:`!else` εκτελείται αφού ο βρόχος ολοκληρώσει στην τελική του επανάληψη, δηλαδή αν δεν σημειωθεί διάλειμμα.

source: In a :keyword:`while` loop, it's executed after the loop's condition becomes false.
el: Σε έναν βρόχο :keyword:`while`, εκτελείται αφού η συνθήκη του βρόχου είναι ψευδής.

source: In either kind of loop, the :keyword:`!else` clause is **not** executed if the loop was terminated by a :keyword:`break`. Of course, other ways of ending the loop early, such as a :keyword:`return` or a raised exception, will also skip execution of the :keyword:`else` clause.
el: Σε οποιοδήποτε είδος βρόχου, η πρόταση :keyword:`!else` **δεν** εκτελείται εάν ο βρόχος τερματίστηκε με μια λέξη :keyword:`break`. Φυσικά, άλλοι τρόποι για να τερματίσετε νωρίς τον βρόχο, όπως ένα :keyword:`return` ή μια αυξημένη εξαίρεση, θα παρακάμψουν επίσης την εκτέλεση της πρότασης :keyword:`else`.

source: This is exemplified in the following :keyword:`!for` loop, which searches for prime numbers::
el: Αυτό αποδεικνύεται στον ακόλουθο βρόχο :keyword:`!for`, που αναζητά πρώτους αριθμούς::

source: (Yes, this is the correct code. Look closely: the ``else`` clause belongs to the ``for`` loop, **not** the ``if`` statement.)
el: (Ναι, αυτός είναι ο σωστός κώδικας. Κοιτάξτε προσεκτικά: η πρόταση ``else`` ανήκει στον βρόχο ``for``, **όχι** στη δήλωση `if`.)

source: One way to think of the else clause is to imagine it paired with the ``if`` inside the loop. As the loop executes, it will run a sequence like if/if/if/else. The ``if`` is inside the loop, encountered a number of times. If the condition is ever true, a ``break`` will happen. If the condition is never true, the ``else`` clause outside the loop will execute.
el: Ένας τρόπος για να σκεφτούμε την ρήτρα else είναι να τη φανταστούμε σε σύζευξη με το ``if`` μέσα στον βρόχο. Καθώς εκτελείται ο βρόχος, θα εκτελέσει μια ακολουθία όπως if/if/if/else. Το ``if`` βρίσκεται μέσα στον βρόχο, συναντάται πολλές φορές. Εάν η συνθήκη είναι ποτέ αληθής, θα συμβεί ``break``. Εάν η συνθήκη δεν είναι ποτέ αληθής, θα εκτελεστεί ο όρος ``else`` εκτός του βρόχου.

source: When used with a loop, the ``else`` clause has more in common with the ``else`` clause of a :keyword:`try` statement than it does with that of ``if`` statements: a ``try`` statement's ``else`` clause runs when no exception occurs, and a loop's ``else`` clause runs when no ``break`` occurs. For more on the ``try`` statement and exceptions, see :ref:`tut-handling`.
el: Όταν χρησιμοποιείται με έναν βρόχο, η πρόταση ``else`` έχει περισσότερα κοινά με την πρόταση ``else`` μιας πρότασης :keyword:`try` παρά με αυτήν των statements ``if`` η πρόταση ``else`` μιας ``try`` εκτελείται όταν δεν υπάρχει εξαίρεση, και η πρόταση ``else`` ενός βρόχου εκτελείται όταν δεν υπάρχει ``break``. Για περισσότερα με τη δήλωση ``try`` και τις εξαιρέσεις, δείτε :ref:`tut-handling`.

source: :keyword:`!pass` Statements
el: Προτάσεις :keyword:`!pass`

source: The :keyword:`pass` statement does nothing. It can be used when a statement is required syntactically but the program requires no action. For example::
el: Η δήλωση :keyword:`pass` δεν κάνει τίποτα. Μπορεί να χρησιμοποιηθεί όταν απαιτείται συντακτικά μια πρόταση, αλλά το πρόγραμμα δεν απαιτεί καμία ενέργεια. Για παράδειγμα::

source: This is commonly used for creating minimal classes::
el: Αυτό χρησιμοποιείται συνήθως για τη δημιουργία ελάχιστων κλάσεων::

source: Another place :keyword:`pass` can be used is as a place-holder for a function or conditional body when you are working on new code, allowing you to keep thinking at a more abstract level. The :keyword:`!pass` is silently ignored::
el: Ένα άλλο μέρος :keyword:`pass` που μπορεί να χρησιμοποιηθεί είναι ως place-holder για μια συνάρτηση ή το σώμα υπό όρους όταν εργάζεστε σε νέο κώδικα, επιτρέποντας σας να συνεχίσετε να σκέφτεστε σε ένα πιο αφηρημένο επίπεδο. Το :keyword:`!pass` αγνοείται σιωπηλά::

source: :keyword:`!match` Statements
el: Προτάσεις :keyword:`!match`

source: A :keyword:`match` statement takes an expression and compares its value to successive patterns given as one or more case blocks. This is superficially similar to a switch statement in C, Java or JavaScript (and many other languages), but it's more similar to pattern matching in languages like Rust or Haskell. Only the first pattern that matches gets executed and it can also extract components (sequence elements or object attributes) from the value into variables.
el: Μια δήλωση :keyword:`match` παίρνει μια έκφραση και συγκρίνει την τιμή της με διαδοχικά μοτίβα που δίνονται ως ένα ή περισσότερα μπλοκ πεζών-κεφαλαίων. Αυτή είναι επιφανειακά παρόμοια με μια πρόταση switch στην C, Java ή JavaScript (και πολλές άλλες γλώσσες), αλλά είναι πιο παρόμοια με την αντιστοίχιση προτύπων σε γλώσσες όπως η Rust ή η Haskell. Εκτελείται μόνο το πρώτο μοτίβο που ταιριάζει και μπορεί επίσης να εξαγάγει στοιχεία (στοιχεία ακολουθίας ή ιδιότητες αντικειμένου) από την τιμή σε μεταβλητές.

source: The simplest form compares a subject value against one or more literals::
el: Η απλούστερη φόρμα συγκρίνει μια τιμή θέματος με ένα ή περισσότερα literals::

source: Note the last block: the "variable name" ``_`` acts as a *wildcard* and never fails to match. If no case matches, none of the branches is executed.
el: Σημειώστε το τελευταίο μπλοκ: το "variable name" ``_`` λειτουργεί ως *μπαλαντέρ* και δεν αποτυγχάνει ποτέ να ταιριάζει. Εάν δεν ταιριάζει κανένα case, κανένας από τους κλάδους δεν εκτελείται.

source: You can combine several literals in a single pattern using ``|`` ("or")::
el: Μπορείτε να συνδυάσετε πολλά γράμματα σε ένα μόνο μοτίβο χρησιμοποιώντας το ``|`` ("ή")::

source: Patterns can look like unpacking assignments, and can be used to bind variables::
el: Τα μοτίβα μπορεί να μοιάζουν με αναθέσεις unpacking, και μπορούν να χρησιμοποιηθούν για τη σύνδεση μεταβλητών::

source: Study that one carefully! The first pattern has two literals, and can be thought of as an extension of the literal pattern shown above. But the next two patterns combine a literal and a variable, and the variable *binds* a value from the subject (``point``). The fourth pattern captures two values, which makes it conceptually similar to the unpacking assignment ``(x, y) = point``.
el: Μελετήστε το ένα προσεκτικά! Το πρώτο μοτίβο έχει δύο literals, και μπορεί να θεωρηθεί ως επέκταση του literal μοτίβου που φαίνεται παραπάνω. Αλλά τα επόμενα δύο μοτίβα συνδυάζουν ένα literal σε μια μεταβλητή, και η μεταβλητή *δεσμεύει* μια τιμή από το θέμα (``point``). Το τέταρτο μοτίβο συλλαμβάνει δύο τιμές, γεγονός που το κάνει εννοιολογικά παρόμοιο με την ανάθεση unpacking ``(x, y) = point``.

source: If you are using classes to structure your data you can use the class name followed by an argument list resembling a constructor, but with the ability to capture attributes into variables::
el: Εάν χρησιμοποιείτε κλάσεις για τη δομή των δεδομένων σας, μπορείτε να χρησιμοποιήσετε το όνομα της κλάσης ακολουθούμενο από μια λίστα ορισμάτων που μοιάζει με έναν κατασκευαστή, αλλά με τη δυνατότητα να συλλαμβάνει χαρακτηριστικά σε μεταβλητές::

source: You can use positional parameters with some builtin classes that provide an ordering for their attributes (e.g. dataclasses). You can also define a specific position for attributes in patterns by setting the ``__match_args__`` special attribute in your classes. If it's set to ("x", "y"), the following patterns are all equivalent (and all bind the ``y`` attribute to the ``var`` variable)::
el: Μπορείτε να χρησιμοποιήσετε παραμέτρους θέσης με ορισμένες ενσωματωμένες κλάσεις που παρέχουν μια σειρά για τα χαρακτηριστικά τους (π.χ. κλάσεις δεδομένων). Μπορείτε επίσης να ορίσετε μια συγκεκριμένη θέση για χαρακτηριστικά σε μοτίβα, ορίζοντας το ειδικό χαρακτηριστικό ``__match_args__`` στις κλάσεις σας. Εάν έχει οριστεί σε ("x", "y"), τα ακόλουθα μοτίβα είναι όλα ισοδύναμα (και όλα δεσμεύουν το χαρακτηριστικό ``y`` στη μεταβλητή ``var``)::

source: A recommended way to read patterns is to look at them as an extended form of what you would put on the left of an assignment, to understand which variables would be set to what. Only the standalone names (like ``var`` above) are assigned to by a match statement. Dotted names (like ``foo.bar``), attribute names (the ``x=`` and ``y=`` above) or class names (recognized by the "(...)" next to them like ``Point`` above) are never assigned to.
el: Ένας συνιστώμενος τρόπος για να διαβάσετε τα μοτίβα είναι να τα δείτε ως μια εκτεταμένη μορφή αυτού που θα βάλετε στα αριστερά μιας ανάθεσης, για να κατανοήσετε ποιες μεταβλητές θα οριστούν σε τι. Μόνο τα ανεξάρτητα ονόματα (όπως ``var`` παραπάνω) εκχωρούνται από μια δήλωση αντιστοίχισης. Ονόματα με κουκκίδες (όπως ``foo.bar``), ονόματα χαρακτηριστικών (τα ``x=`` και ``y=`` παραπάνω) ή ονόματα κλάσεων (αναγνωρίζονται από το "(...)" που βρίσκεται δίπλα όπως το ``Point`` παραπάνω) δεν ανατίθενται ποτέ.

source: Patterns can be arbitrarily nested. For example, if we have a short list of Points, with ``__match_args__`` added, we could match it like this::
el: Τα μοτίβα μπορούν να είναι αυθαίρετα ένθετα. Για παράδειγμα, εάν έχουμε μια σύντομη λίστα με πόντους, με προσθήκη ``__match_args__``, θα μπορούσαμε να την αντιστοιχίσουμε ως εξής::

source: We can add an ``if`` clause to a pattern, known as a "guard". If the guard is false, ``match`` goes on to try the next case block. Note that value capture happens before the guard is evaluated::
el: Μπορούμε να προσθέσουμε μια πρόταση ``if`` σε ένα μοτίβο, γνωστό ως "guard". Εάν το guard είναι false, το ``match`` συνεχίζει για να δοκιμάσει το επόμενο μπλοκ πεζών-κεφαλαίων. Λάβετε υπόψη ότι η σύλληψη της τιμής γίνεται πριν ο guard αξιολογηθεί::

source: Several other key features of this statement:
el: Πολλά άλλα βασικά χαρακτηριστικά αυτής της δήλωσης:

source: Like unpacking assignments, tuple and list patterns have exactly the same meaning and actually match arbitrary sequences. An important exception is that they don't match iterators or strings.
el: Όπως το unpacking αναθέσεων, τα μοτίβα πλειάδας (tuple) και λίστας έχουν ακριβώς την ίδια σημασία και ταιριάζουν πραγματικά με αυθαίρετες ακολουθίες. Μια σημαντική εξαίρεση είναι ότι δεν ταιριάζουν με iterators ή συμβολοσειρές.

source: Sequence patterns support extended unpacking: ``[x, y, *rest]`` and ``(x, y, *rest)`` work similar to unpacking assignments. The name after ``*`` may also be ``_``, so ``(x, y, *_)`` matches a sequence of at least two items without binding the remaining items.
el: Τα μοτίβα ακολουθίας υποστηρίζουν εκτεταμένο unpacking: ``[x, y, *rest]`` και ``(x, y, *rest)`` λειτουργεί παρόμοια με το unpacking αναθέσεων. Το όνομα μετά το ``*`` μπορεί επίσης να είναι ``_``, οπότε το ``(x, y, *_)`` αντιστοιχεί σε μια ακολουθία τουλάχιστον δύο στοιχείων χωρίς να δεσμεύει τα υπόλοιπα στοιχεία.

source: Mapping patterns: ``{"bandwidth": b, "latency": l}`` captures the ``"bandwidth"`` and ``"latency"`` values from a dictionary. Unlike sequence patterns, extra keys are ignored. An unpacking like ``**rest`` is also supported. (But ``**_`` would be redundant, so it is not allowed.)
el: Μοτίβα αντιστοίχισης: ``{"bandwidth": b, "latency": l}`` καταγράφει τις τιμές ``"bandwidth"`` και ``"latency"`` από ένα λεξικό. Σε αντίθεση με τα μοτίβα ακολουθίας, επιπλέον κλειδιά αγνοούνται. Υποστηρίζεται επίσης το unpacking όπως το ``**rest``. (Αλλά το ``**_`` θα ήταν περιττό, επομένως δεν επιτρέπεται.)

source: Subpatterns may be captured using the ``as`` keyword::
el: Τα δευτερεύοντα μοτίβα μπορούν να αποτυπωθούν χρησιμοποιώντας το keyword ``as``::

source: will capture the second element of the input as ``p2`` (as long as the input is a sequence of two points)
el: θα καταγράψει το δεύτερο στοιχείο της εισόδου ως ``p2`` (εφόσον η είσοδος είναι μια ακολουθία δύο σημείων)

source: Most literals are compared by equality, however the singletons ``True``, ``False`` and ``None`` are compared by identity.
el: Τα περισσότερα literals συγκρίνονται με ισότητα, ωστόσο τα singletons ``True``, ``False`` και ``None`` συγκρίνονται με ταυτότητα.

source: Patterns may use named constants. These must be dotted names to prevent them from being interpreted as capture variable::
el: Τα μοτίβα μπορούν να χρησιμοποιούν ονομασμένες σταθερές. Αυτά πρέπει να είναι ονόματα με κουκκίδες για να μην ερμηνεύονται ως capture μεταβλητή::

source: For a more detailed explanation and additional examples, you can look into :pep:`636` which is written in a tutorial format.
el: Για πιο λεπτομερή επεξήγηση και πρόσθετα παραδείγματα, μπορείτε να δείτε το :pep:`636` το οποίο είναι γραμμένο σε μορφή εκμάθησης.

source: Defining Functions
el: Καθορισμός Συναρτήσεων

source: We can create a function that writes the Fibonacci series to an arbitrary boundary::
el: Μπορούμε να δημιουργήσουμε μια συνάρτηση που γράφει τη σειρά Fibonacci σε ένα αυθαίρετο όριο::

source: The keyword :keyword:`def` introduces a function *definition*. It must be followed by the function name and the parenthesized list of formal parameters. The statements that form the body of the function start at the next line, and must be indented.
el: Το keyword :keyword:`def` εισάγει μια συνάρτηση *ορισμός*. Πρέπει να ακολουθείται από το όνομα της συνάρτησης και τη λίστα των τυπικών παραμέτρων σε παρένθεση. Οι δηλώσεις που σχηματίζουν το σώμα της συνάρτησης ξεκινούν από την επόμενη γραμμή και πρέπει να είναι εσοχές.

source: The first statement of the function body can optionally be a string literal; this string literal is the function's documentation string, or :dfn:`docstring`. (More about docstrings can be found in the section :ref:`tut-docstrings`.) There are tools which use docstrings to automatically produce online or printed documentation, or to let the user interactively browse through code; it's good practice to include docstrings in code that you write, so make a habit of it.
el: Η πρώτη δήλωση του σώματος της συνάρτησης μπορεί προαιρετικά να είναι ένα literal συμβολοσειράς· αυτό το literal συμβολοσειράς είναι η συμβολοσειρά τεκμηρίωσης της συνάρτησης ή :dfn:`docstring`. (Περισσότερα για τα docstring μπορείτε να βρείτε στην ενότητα :ref:`tut-docstrings`.) Υπάρχουν εργαλεία που χρησιμοποιούν docstrings για την αυτόματη παραγωγή διαδικτυακής ή έντυπης τεκμηρίωσης ή για να αφήσουν τον χρήστη να περιηγηθεί διαδραστικά στον κώδικα· είναι καλή πρακτική να συμπεριλαμβάνονται docstrings στον κώδικα που γράφετε, για αυτό κάντε το συνήθεια.
