Repository: thepetk/python-docs-gr
Catalog: tutorial/controlflow.po
Languages: el

source: Small anonymous functions can be created with the :keyword:`lambda` keyword. This function returns the sum of its two arguments: ``lambda a, b: a+b``. Lambda functions can be used wherever function objects are required. They are syntactically restricted to a single expression. Semantically, they are just syntactic sugar for a normal function definition. Like nested function definitions, lambda functions can reference variables from the containing scope::
el: Μπορούν αν δημιουργηθούν μικρές ανώνυμες συναρτήσεις με το keyword :keyword:`lambda`. Αυτή η συνάρτηση επιστρέφει το άθροισμα των δύο ορισμάτων της: ``lambda a, b: a+b``. Οι συναρτήσεις Lambda μπορούν να χρησιμοποιηθούν όπου απαιτούνται αντικείμενα συνάρτησης. Περιορίζονται συντακτικά σε μία μόνο έκφραση. Σημασιολογικά, είναι απλώς syntactic sugar για έναν ορισμό κανονικής συνάρτησης. Όπως οι ορισμοί ένθετων συναρτήσεων, οι συναρτήσεις lambda μπορούν να παραπέμπουν σε μεταβλητές από το πεδίο που περιέχει::

source: The above example uses a lambda expression to return a function. Another use is to pass a small function as an argument::
el: Το παραπάνω παράδειγμα χρησιμοποιεί μια έκφραση lambda για να επιστρέψει μια συνάρτηση. Μια άλλη χρήση είναι η μετάδοση μιας μικρής συνάρτησης ως όρισμα::

source: Documentation Strings
el: Συμβολοσειρές Τεκμηρίωσης

source: Here are some conventions about the content and formatting of documentation strings.
el: Ακολουθούν ορισμένες συμβάσεις σχετικά με το περιεχόμενο και τη μορφοποίηση των συμβολοσειρών τεκμηρίωσης.

source: The first line should always be a short, concise summary of the object's purpose. For brevity, it should not explicitly state the object's name or type, since these are available by other means (except if the name happens to be a verb describing a function's operation). This line should begin with a capital letter and end with a period.
el: Η πρώτη γραμμή πρέπει να είναι πάντα μια σύντομη, συνοπτική περίληψη του σκοπού του αντικειμένου. Για συντομία, δεν πρέπει να αναφέρει ρητά το όνομα ή τον τύπο του αντικειμένου , καθώς αυτά είναι διαθέσιμα με άλλα μέσα (εκτός εάν το όνομα είναι ρήμα που περιγράφει τη λειτουργία της συνάρτησης). Αυτή η γραμμή πρέπει να ξεκινά με κεφαλαίο γράμμα και να τελειώνει με τελεία.

source: If there are more lines in the documentation string, the second line should be blank, visually separating the summary from the rest of the description. The following lines should be one or more paragraphs describing the object's calling conventions, its side effects, etc.
el: Εάν υπάρχουν περισσότερες γραμμές στη συμβολοσειρά τεκμηρίωσης, η δεύτερη γραμμή θα πρέπει να είναι κενή, διαχωρίζοντας οπτικά τη σύνοψη από την υπόλοιπη περιγραφή. Οι ακόλουθες γραμμές πρέπει να είναι μία ή περισσότερες παράγραφοι που περιγράφουν τις συμβάσεις κλήσης του αντικειμένου, τις παρενέργειές του κ.λπ..

source: The Python parser does not strip indentation from multi-line string literals in Python, so tools that process documentation have to strip indentation if desired. This is done using the following convention. The first non-blank line *after* the first line of the string determines the amount of indentation for the entire documentation string. (We can't use the first line since it is generally adjacent to the string's opening quotes so its indentation is not apparent in the string literal.) Whitespace "equivalent" to this indentation is then stripped from the start of all lines of the string. Lines that are indented less should not occur, but if they occur all their leading whitespace should be stripped. Equivalence of whitespace should be tested after expansion of tabs (to 8 spaces, normally).
el: Ο parser της Python δεν αφαιρεί την εσοχή από τα literals της συμβολοσειράς πολλών γραμμών στην Python, επομένως τα εργαλεία που επεξεργάζονται την τεκμηρίωση πρέπει να αφαιρέσουν την εσοχή εάν είναι επιθυμητό. Αυτό γίνεται χρησιμοποιώντας την ακόλουθη σύμβαση. Η πρώτη μη κενή γραμμή *μετά* την πρώτη γραμμή της συμβολοσειράς καθορίζει το μέγεθος της εσοχής για ολόκληρη τη συμβολοσειρά τεκμηρίωσης. (Δεν μπορούμε να χρησιμοποιήσουμε την πρώτη γραμμή αφού είναι γενικά δίπλα στα εισαγωγικά της συμβολοσειράς, επομένως η εσοχή της δεν είναι εμφανής στο literal της συμβολοσειράς.) Το κενό διάστημα "ισοδύναμο" σε αυτήν την εσοχή αφαιρείται στη συνέχεια από την αρχή όλων των γραμμών της συμβολοσειράς. Οι γραμμές που έχουν μικρότερη εσοχή δεν θα πρέπει να εμφανίζονται, αλλά αν εμφανιστούν θα πρέπει να αφαιρεθεί όλο το αρχικό κενό τους. Η ισοδυναμία των κενών διαστημάτων θα πρέπει να ελέγχεται μετά την επέκταση των καρτελών (σε 8 κενά, κανονικά).

source: Here is an example of a multi-line docstring::
el: Ακολουθεί ένα παράδειγμα ενός πολλαπλών γραμμών docstring::

source: Function Annotations
el: Annotations Συναρτήσεων

source: :ref:`Function annotations <function>` are completely optional metadata information about the types used by user-defined functions (see :pep:`3107` and :pep:`484` for more information).
el: Το :ref:`Function annotations <function>` είναι εντελώς προαιρετικές πληροφορίες μεταδεδομένων σχετικά με τους τύπους χρησιμοποιούνται από συναρτήσεις που καθορίζονται από το χρήστη (δείτε :pep:`3107` και :pep:`484` για περισσότερες πληροφορίες).

source: :term:`Annotations <function annotation>` are stored in the :attr:`!__annotations__` attribute of the function as a dictionary and have no effect on any other part of the function. Parameter annotations are defined by a colon after the parameter name, followed by an expression evaluating to the value of the annotation. Return annotations are defined by a literal ``->``, followed by an expression, between the parameter list and the colon denoting the end of the :keyword:`def` statement. The following example has a required argument, an optional argument, and the return value annotated::
el: Το :term:`Annotations <function annotation>` αποθηκεύονται στο χαρακτηριστικό :attr:`!__annotations__` της συνάρτησης ως λεξικό και δεν έχουνε καμία επίδραση σε κανένα άλλο μέρος της συνάρτησης. Τα annotations των παραμέτρων ορίζονται με άνω και κάτω τελεία μετά το όνομα παραμέτρου, ακολουθούμενη από μια έκφραση που αξιολογεί την τιμή του annotation. Τα annotations επιστροφής ορίζονται από ένα literal ``->``, ακολουθούμενο από μια έκφραση, μεταξύ της λίστας παραμέτρων και της άνω και κάτω τελείας που υποδηλώνει το τέλος της δήλωσης :keyword:`def`. Το ακόλουθο παράδειγμα έχει ένα απαιτούμενο όρισμα, ένα προαιρετικό όρισμα και την επιστρεφόμενη τιμή σε annotations::

source: Intermezzo: Coding Style
el: Intermezzo: Στυλ Κώδικα

source: Now that you are about to write longer, more complex pieces of Python, it is a good time to talk about *coding style*. Most languages can be written (or more concise, *formatted*) in different styles; some are more readable than others. Making it easy for others to read your code is always a good idea, and adopting a nice coding style helps tremendously for that.
el: Τώρα που πρόκειται να γράψετε μεγαλύτερα, και πιο σύνθετα κομμάτια της Python, είναι η κατάλληλη στιγμή να μιλήσετε για *στυλ κώδικα*. Οι περισσότερες γλώσσες μπορούν να γραφτούν (ή πιο συνοπτικές, *μοροφοποιημένες*) σε διαφορετικά στυλ· μερικές είναι πιο ευανάγνωστες από άλλες. Το να διευκολύνετε τους άλλους να διαβάσουν τον κώδικα σας είναι πάντα μια καλή ιδέα και η υιοθέτηση ενός ωραίου στυλ κώδικα βοηθάει πάρα πολύ σε αυτό.

source: For Python, :pep:`8` has emerged as the style guide that most projects adhere to; it promotes a very readable and eye-pleasing coding style. Every Python developer should read it at some point; here are the most important points extracted for you:
el: Για την Python, το :pep:`8` έχει αναδειχθεί ως οδηγός στυλ στον οποίο τηρούν τα περισσότερα έργα· προωθεί ένα πολύ ευανάγνωστο και ευχάριστο στυλ κώδικα. Κάθε προγραμματιστής Python θα πρέπει να το διαβάσει κάποια στιγμή· εδώ είναι τα πιο σημαντικό σημεία που εξάγονται για εσάς:

source: Use 4-space indentation, and no tabs.
el: Χρησιμοποιήστε εσοχή 4 διαστημάτων και όχι tabs.

source: 4 spaces are a good compromise between small indentation (allows greater nesting depth) and large indentation (easier to read). Tabs introduce confusion, and are best left out.
el: Τα 4 κενά είναι ένας καλός συμβιβασμός μεταξύ της μικρής εσοχής (επιτρέπει μεγαλύτερο βάθος εμφώλευσης) και της μεγάλης εσοχής (ευκολότερη στην ανάγνωση). Τα tabs δημιουργούν σύγχυση, και είναι καλύτερο να παραμείνουν απέξω.

source: Wrap lines so that they don't exceed 79 characters.
el: Τυλίξτε τις γραμμές έτσι ώστε να μην υπερβαίνουν τους 79 χαρακτήρες.

source: This helps users with small displays and makes it possible to have several code files side-by-side on larger displays.
el: Αυτό βοηθά του χρήστες με μικρές οθόνες και καθιστά δυνατή την ύπαρξη πολλών αρχείων κώδικα δίπλα-δίπλα σε μεγαλύτερες οθόνες.

source: Use blank lines to separate functions and classes, and larger blocks of code inside functions.
el: Χρησιμοποιείστε κενές γραμμές για να διαχωρίσετε συναρτήσεις και κλάσεις και μεγαλύτερα μπλοκ κώδικα μέσα συναρτήσεις.

source: When possible, put comments on a line of their own.
el: Όταν είναι δυνατόν, βάλτε σχόλια σε μια δική τους γραμμή.

source: Use docstrings.
el: Χρησιμοποιήστε docstrings.

source: Use spaces around operators and after commas, but not directly inside bracketing constructs: ``a = f(1, 2) + g(3, 4)``.
el: Χρησιμοποιήστε κενά γύρω από τελεστές και μετά από κόμματα, αλλά όχι απευθείας μέσα δε δομές αγκύλων: ``a = f(1, 2) + g(3, 4)``.

source: Name your classes and functions consistently; the convention is to use ``UpperCamelCase`` for classes and ``lowercase_with_underscores`` for functions and methods. Always use ``self`` as the name for the first method argument (see :ref:`tut-firstclasses` for more on classes and methods).
el: Ονομάστε τις κλάσεις και τις συναρτήσεις σας με συνέπεια· η σύμβαση είναι να χρησιμοποιείτε ``UpperCamelCase`` για τις κλάσεις και ``lowercase_with_underscores`` για τις συναρτήσεις και τις μεθόδους. Χρησιμοποιείτε πάντα το ``self`` ως όνομα για το πρώτο όρισμα μεθόδου (δείτε :ref:`tut-firstclasses` για περισσότερα σχετικά με τις κλάσεις και τις μεθόδους).

source: Don't use fancy encodings if your code is meant to be used in international environments. Python's default, UTF-8, or even plain ASCII work best in any case.
el: Μην χρησιμοποιείτε φανταχτερές κωδικοποιήσεις εάν ο κώδικας σας προορίζεται να χρησιμοποιηθεί σε διεθνή περιβάλλοντα. Η προεπιλογή της Python, UTF-8, ή ακόμα και το απλό ASCII λειτουργούν καλύτερα σε κάθε περίπτωση.

source: Likewise, don't use non-ASCII characters in identifiers if there is only the slightest chance people speaking a different language will read or maintain the code.
el: Ομοίως, μη χρησιμοποιείτε χαρακτήρες που δεν είναι ASCII σε αναγνωριστικά εάν υπάρχει μόνο η παραμικρή πιθανότητα οι άνθρωποι που μιλούν διαφορετική γλώσσα να διαβάσουν ή να διατηρήσουν τον κώδικα.

source: Footnotes
el: Υποσημειώσεις

source: Actually, *call by object reference* would be a better description, since if a mutable object is passed, the caller will see any changes the callee makes to it (items inserted into a list).
el: Στην πραγματικότητα, η *κλήση με αναφορά αντικειμένου* θα ήταν μια καλύτερη περιγραφή, καθώς εάν μεταβιβαστεί ένα μεταβλητό αντικείμενο, ο καλών θα δει τυχόν αλλαγές που κάνει ο καλών σε αυτό (στοιχεία που εισάγονται σε μια λίστα).

source: * (asterisk)
el: * (αστερίσκος)
