Repository: thepetk/python-docs-gr
Catalog: tutorial/controlflow.po
Languages: el

source: The *execution* of a function introduces a new symbol table used for the local variables of the function. More precisely, all variable assignments in a function store the value in the local symbol table; whereas variable references first look in the local symbol table, then in the local symbol tables of enclosing functions, then in the global symbol table, and finally in the table of built-in names. Thus, global variables and variables of enclosing functions cannot be directly assigned a value within a function (unless, for global variables, named in a :keyword:`global` statement, or, for variables of enclosing functions, named in a :keyword:`nonlocal` statement), although they may be referenced.
el: Η *εκτέλεση* μιας συνάρτησης εισάγει έναν νέο πίνακα συμβόλων που χρησιμοποιείται για τις τοπικές μεταβλητές της συνάρτησης. Πιο συγκεκριμένα, όλες οι εκχωρήσεις μεταβλητών σε μια συνάρτηση αποθηκεύουν την τιμή στον πίνακα τοπικών συμβόλων∙ ενώ οι αναφορές μεταβλητών κοιτάζονται πρώτα στον πίνακα τοπικών συμβόλων, στη συνέχεια στους πίνακες τοπικών συμβόλων των συναρτήσεων που περικλείουν, μετά στον πίνακα καθολικών συμβόλων και, τέλος, στον πίνακα ενσωματωμένων ονομάτων. Έτσι, οι καθολικές μεταβλητές και οι μεταβλητές των συναρτήσεων που περικλείουν δεν μπορούν να εκχωρηθούν ως μια τιμή μέσα σε μια συνάρτηση (εκτός εάν, για καθολικές μεταβλητές, που ονομάζονται σε μια δήλωση :keyword:`global` ή, για μεταβλητές συναρτήσεων που περικλείουν, ονομάζονται ως μια δήλωση :keyword:`nonlocal`), αν και μπορεί να αναφέρονται.

source: The actual parameters (arguments) to a function call are introduced in the local symbol table of the called function when it is called; thus, arguments are passed using *call by value* (where the *value* is always an object *reference*, not the value of the object). [#]_ When a function calls another function, or calls itself recursively, a new local symbol table is created for that call.
el: Οι πραγματικές παράμετροι (ορίσματα) σε μια κλήση συνάρτησης εισάγονται στον τοπικό πίνακα συμβόλων της καλούμενης συνάρτησης όταν αυτή καλείται· έτσι, τα ορίσματα μεταβιβάζονται χρησιμοποιώντας *call by value* (όπου η *value* είναι πάντα ένα αντικείμενο *reference*, όχι την τιμή του αντικειμένου). [#]_ Όταν μια συνάρτηση καλεί μια άλλη συνάρτηση ή καλεί τον εαυτό της αναδρομικά, δημιουργείται ένας νέος πίνακας τοπικών συμβόλων για αυτήν την κλήση.

source: A function definition associates the function name with the function object in the current symbol table. The interpreter recognizes the object pointed to by that name as a user-defined function. Other names can also point to that same function object and can also be used to access the function::
el: Ένας ορισμός συνάρτησης συσχετίζει το όνομα της συνάρτησης με το αντικείμενο συνάρτησης στον τρέχοντα πίνακα συμβόλων. Ο διερμηνέας αναγνωρίζει το αντικείμενο στο οποίο επισημαίνεται αυτό το όνομα ως συνάρτηση που ορίζεται από τον χρήστη. Άλλα ονόματα μπορούν επίσης να δείχνουν το ίδιο αντικείμενο συνάρτησης και μπορούν επίσης να χρησιμοποιηθούν για πρόσβαση στη συνάρτηση::

source: Coming from other languages, you might object that ``fib`` is not a function but a procedure since it doesn't return a value. In fact, even functions without a :keyword:`return` statement do return a value, albeit a rather boring one. This value is called ``None`` (it's a built-in name). Writing the value ``None`` is normally suppressed by the interpreter if it would be the only value written. You can see it if you really want to using :func:`print`::
el: Προερχόμενοι από άλλες γλώσσες, μπορεί να αντιταχθείτε ότι το ``fib`` δεν είναι μια συνάρτηση αλλά μια διαδικασία, καθώς δεν επιστρέφει μια τιμή. Στην πραγματικότητα, ακόμη και συναρτήσεις χωρίς δήλωση :keyword:`return` επιστρέφουν μια τιμή, αν και μάλλον βαρετή. Αυτή η τιμή ονομάζεται ``None``. Η εγγραφή της τιμής ``None`` από τον διερμηνέα, εάν θα ήταν η μόνη τιμή που γράφεται. Μπορείτε να το δείτε αν το θέλετε πραγματικά χρησιμοποιώντας τη :func:`print`::

source: It is simple to write a function that returns a list of the numbers of the Fibonacci series, instead of printing it::
el: Είναι απλό να γράψετε μια συνάρτηση που επιστρέφει μια λίστα με τους αριθμούς της σειράς Fibonacci, αντί να την εκτυπώσετε::

source: This example, as usual, demonstrates some new Python features:
el: Αυτό το παράδειγμα, ως συνήθως, δείχνει μερικά νέα χαρακτηριστικά Python:

source: The :keyword:`return` statement returns with a value from a function. :keyword:`!return` without an expression argument returns ``None``. Falling off the end of a function also returns ``None``.
el: Η δήλωση :keyword:`return` επιστρέφει με μια τιμή από μια συνάρτηση. Το :keyword:`!return` χωρίς όρισμα έκφρασης, επιστρέφει το ``None``. Η πτώση του τέλους μιας συνάρτησης επιστρέφει επίσης ``None``.

source: The statement ``result.append(a)`` calls a *method* of the list object ``result``. A method is a function that 'belongs' to an object and is named ``obj.methodname``, where ``obj`` is some object (this may be an expression), and ``methodname`` is the name of a method that is defined by the object's type. Different types define different methods. Methods of different types may have the same name without causing ambiguity. (It is possible to define your own object types and methods, using *classes*, see :ref:`tut-classes`) The method :meth:`!append` shown in the example is defined for list objects; it adds a new element at the end of the list. In this example it is equivalent to ``result = result + [a]``, but more efficient.
el: Η δήλωση ``result.append(a)`` καλεί μια *μέθοδο* του αντικειμένου της λίστας ``result``. Μια μέθοδος είναι μια συνάρτηση που 'ανήκει' σε ένα αντικείμενο και ονομάζεται ``obj.methodname``, όπου ``obj`` είναι κάποιο αντικείμενο (αυτό μπορεί να είναι μια έκφραση), και το ``methodname`` είναι το όνομα μιας μεθόδου που ορίζεται από τον τύπο του αντικειμένου. Διαφορετικοί τύποι ορίζουν διαφορετικές μεθόδους. Μέθοδοι διαφορετικών τύπων μπορεί να έχουν το ίδιο όνομα χωρίς να προκαλούν ασάφεια. (Είναι δυνατό να ορίσετε τους δικούς σας τύπους αντικειμένων και μεθόδους, χρησιμοποιώντας *classes*, δείτε :ref:`tut-classes`) Η μέθοδος :meth:`!append` που εμφανίζεται στο παράδειγμα ορίζεται για αντικείμενα λίστας· προσθέτει ένα νέο στοιχείο στο τέλος της λίστας. Σε αυτό το παράδειγμα είναι ισοδύναμο με ``result = result + [a]``, αλλά πιο αποτελεσματικό.

source: More on Defining Functions
el: Περισσότερο για τον Καθορισμό Συναρτήσεων

source: It is also possible to define functions with a variable number of arguments. There are three forms, which can be combined.
el: Είναι επίσης δυνατός ο ορισμός συναρτήσεων με μεταβλητό αριθμό ορισμάτων. Υπάρχουν τρεις μορφές, που μπορούν να συνδυαστούν.

source: Default Argument Values
el: Προεπιλεγμένες Τιμές Ορίσματος

source: The most useful form is to specify a default value for one or more arguments. This creates a function that can be called with fewer arguments than it is defined to allow. For example::
el: Η πιο χρήσιμη φόρμα είναι να καθορίσετε μια προεπιλεγμένη τιμή για ένα ή περισσότερα ορίσματα. Αυτό δημιουργεί μια συνάρτηση που μπορεί να κληθεί με λιγότερα ορίσματα από αυτά που έχει ορίσει ότι επιτρέπει. Για παράδειγμα::

source: This function can be called in several ways:
el: Αυτή η συνάρτηση μπορεί να κληθεί με διάφορους τρόπους:

source: giving only the mandatory argument: ``ask_ok('Do you really want to quit?')``
el: δίνοντας μόνο το υποχρεωτικό όρισμα: ``ask_ok('Do you really want to quit?')``

source: giving one of the optional arguments: ``ask_ok('OK to overwrite the file?', 2)``
el: δίνοντας ένα από τα προαιρετικά ορίσματα: ``ask_ok('OK to overwrite the file?', 2)``

source: or even giving all arguments: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``
el: ή δίνοντας όλα τα ορίσματα: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``

source: This example also introduces the :keyword:`in` keyword. This tests whether or not a sequence contains a certain value.
el: Αυτό το παράδειγμα εισάγει επίσης το keyword :keyword:`in`. Αυτό ελέγχει εάν μια ακολουθία περιέχει ή όχι μια συγκεκριμένη τιμή.

source: The default values are evaluated at the point of function definition in the *defining* scope, so that ::
el: Οι προεπιλεγμένες τιμές αξιολογούνται στο σημείο του ορισμού της συνάρτησης στο πεδίο που *ορίζεται*, έτσι ώστε ::

source: will print ``5``.
el: θα εκτυπώσει ``5``.

source: **Important warning:** The default value is evaluated only once. This makes a difference when the default is a mutable object such as a list, dictionary, or instances of most classes. For example, the following function accumulates the arguments passed to it on subsequent calls::
el: **Σημαντική προειδοποίηση:** Η προεπιλεγμένη τιμή αξιολογείται μόνο μία φορά. Αυτό κάνει τη διαφορά όταν η προεπιλογή είναι ένα μεταβλητό αντικείμενο, όπως μια λίστα, λεξικό ή στιγμιότυπα των περισσότερων κλάσεων. Για παράδειγμα, η ακόλουθη συνάρτηση συσσωρεύει τα ορίσματα που διαβάζονται σε αυτό σε επόμενες κλήσεις::

source: This will print ::
el: Αυτό θα εκτυπώσει ::

source: If you don't want the default to be shared between subsequent calls, you can write the function like this instead::
el: Εάν δεν θέλετε να γίνεται κοινή χρήση της προεπιλογής μεταξύ των επόμενων κλήσεων, μπορείτε να γράψετε τη συνάρτηση ως εξής::

source: Keyword Arguments
el: Ορίσματα Keyword

source: Functions can also be called using :term:`keyword arguments <keyword argument>` of the form ``kwarg=value``. For instance, the following function::
el: Οι συναρτήσεις μπορούν επίσης να κληθούν χρησιμοποιώντας το :term:`keyword arguments <keyword argument>` της μορφής ``kwarg=value``. Για παράδειγμα, την ακόλουθη συνάρτηση::

source: accepts one required argument (``voltage``) and three optional arguments (``state``, ``action``, and ``type``). This function can be called in any of the following ways::
el: δέχεται ένα απαιτούμενο όρισμα (``voltage``) και τρία προαιρετικά ορίσματα (``state``, ``action``, και ``type``). Αυτή η συνάρτηση μπορεί να κληθεί με οποιονδήποτε από τους ακόλουθους τρόπους::

source: but all the following calls would be invalid::
el: αλλά όλες οι ακόλουθες κλήσεις θα ήταν άκυρες::

source: In a function call, keyword arguments must follow positional arguments. All the keyword arguments passed must match one of the arguments accepted by the function (e.g. ``actor`` is not a valid argument for the ``parrot`` function), and their order is not important. This also includes non-optional arguments (e.g. ``parrot(voltage=1000)`` is valid too). No argument may receive a value more than once. Here's an example that fails due to this restriction::
el: Σε μια κλήση συνάρτησης, τα keyword ορίσματα πρέπει να ακολουθούν ορίσματα θέσης. Όλα τα keyword ορίσματα που διαβάζονται πρέπει να ταιριάζουν με ένα από τα ορίσματα που γίνονται δεκτά από τη συνάρτηση (π.χ. το ``actor`` δεν είναι έγκυρο όρισμα για τη συνάρτηση ``parrot``), και η διάταξη τους δεν είναι σημαντική. Αυτό περιλαμβάνει επίσης μη προαιρετικά ορίσματα (π.χ. ``parrot(voltage=1000)`` είναι επίσης έγκυρο). Κανένα όρισμα δεν μπορεί να λάβει μια τιμή περισσότερες από μία φορές. Ακολουθεί ένα παράδειγμα που αποτυγχάνει λόγω αυτού του περιορισμού::

source: When a final formal parameter of the form ``**name`` is present, it receives a dictionary (see :ref:`typesmapping`) containing all keyword arguments except for those corresponding to a formal parameter. This may be combined with a formal parameter of the form ``*name`` (described in the next subsection) which receives a :ref:`tuple <tut-tuples>` containing the positional arguments beyond the formal parameter list. (``*name`` must occur before ``**name``.) For example, if we define a function like this::
el: Όταν υπάρχει μια τελική επίσημη παράμετρος της μορφής ``**name``, λαμβάνει ένα λεξικό (δείτε :ref:`typesmapping`) που περιέχει όλα τα keyword ορίσματα εκτός από αυτά που αντιστοιχούν σε μια επίσημη παράμετρο. Αυτό μπορεί να συνδυαστεί με μια επίσημη παράμετρος της μορφής ``*name`` (που περιγράφεται στην επόμενη υποενότητα) η οποία λαμβάνει ένα :ref:`tuple <tut-tuples>` που περιέχει τα ορίσματα θέσης πέρα από την επίσημη λίστα παραμέτρων. (Το ``*name`` πρέπει να εμφανίζεται πριν από το ``**name``.) Για παράδειγμα, αν ορίσουμε μια συνάρτηση όπως αυτή::

source: It could be called like this::
el: Μπορεί να καλεστεί κάπως έτσι::

source: and of course it would print:
el: και φυσικά θα εκτυπώσει:

source: Note that the order in which the keyword arguments are printed is guaranteed to match the order in which they were provided in the function call.
el: Λάβετε υπόψη ότι η σειρά με την οποία εκτυπώνονται τα keyword ορίσματα είναι εγγυημένη ότι ταιριάζει με τη σειρά με την οποία δόθηκαν στην κλήση της συνάρτησης.

source: Special parameters
el: Ειδικές παράμετροι

source: By default, arguments may be passed to a Python function either by position or explicitly by keyword. For readability and performance, it makes sense to restrict the way arguments can be passed so that a developer need only look at the function definition to determine if items are passed by position, by position or keyword, or by keyword.
el: Από προεπιλογή, τα ορίσματα μπορούν να μεταβιβαστούν σε μια συνάρτηση Python είτε με βάση τη θέση είτε ρητά με το keyword. Για αναγνωσιμότητα και απόδοση, είναι λογικό να περιοριστεί ο τρόπος με τον οποίο μπορούν να περάσουν τα ορίσματα, έτσι ώστε ένας προγραμματιστής να μην χρειάζεται να κοιτάξει τον ορισμό της συνάρτησης για να προσδιορίσει εάν τα στοιχεία μεταβιβάζονται κατά θέση, κατά θέση ή keyword, ή κατά keyword.

source: A function definition may look like:
el: Ένας ορισμός συνάρτησης μπορεί να μοιάζει με αυτό:

source: where ``/`` and ``*`` are optional. If used, these symbols indicate the kind of parameter by how the arguments may be passed to the function: positional-only, positional-or-keyword, and keyword-only. Keyword parameters are also referred to as named parameters.
el: όπου τα ``/`` και ``*`` είναι προαιρετικά. Εάν χρησιμοποιούνται, αυτά τα σύμβολα υποδεικνύουν το είδος της παραμέτρους με τον τρόπο που τα ορίσματα μπορούν να μεταβιβαστούν στη συνάρτηση: μόνο θέσης (positional-only), θέσης ή keyword (positional-or-keyword), και μόνο keyword (keyword-only). Οι keyword παράμετροι αναφέρονται επίσης ως ονομασμένες παράμετροι.

source: Positional-or-Keyword Arguments
el: Παράμετροι Θέσης ή Keyword

source: If ``/`` and ``*`` are not present in the function definition, arguments may be passed to a function by position or by keyword.
el: Εάν τα ``/`` και ``*`` δεν υπάρχουν στον ορισμό της συνάρτησης, τα ορίσματα μπορούν να μεταβιβαστούν σε μια συνάρτηση ανά θέση ή κατά keyword.

source: Positional-Only Parameters
el: Παράμετροι Μόνο-Θέσης

source: Looking at this in a bit more detail, it is possible to mark certain parameters as *positional-only*. If *positional-only*, the parameters' order matters, and the parameters cannot be passed by keyword. Positional-only parameters are placed before a ``/`` (forward-slash). The ``/`` is used to logically separate the positional-only parameters from the rest of the parameters. If there is no ``/`` in the function definition, there are no positional-only parameters.
el: Επανεξετάζοντας αυτό το θέμα λίγο πιο λεπτομερώς, είναι δυνατό να επισημάνετε ορισμένες παραμέτρους ως *μόνο θέσης*.Εάν *μόνο θέσης*, η σειρά των παραμέτρων έχει σημασία και οι παράμετροι δεν μπορούν να μεταβιβαστούν με keyword. Οι παράμετροι μόνο θέσης τοποθετούνται πριν από ένα ``/`` (προς τα εμπρός-κάθετος). Το ``/``χρησιμοποιείται για να διαχωρίσει λογικά τις παραμέτρους μόνο θέσης από τις υπόλοιπες παραμέτρους. Εάν δεν υπάερχει το ``/`` στον ορισμό της συνάρτησης, δεν υπάρχουν παράμετροι μόνο θέσης.

source: Parameters following the ``/`` may be *positional-or-keyword* or *keyword-only*.
el: Οι παράμετροι που ακολουθούν το ``/`` μπορεί να είναι *θέσης ή keyword* ή *μόνο keyword*.

source: Keyword-Only Arguments
el: Ορίσματα μόνο Keyword

source: To mark parameters as *keyword-only*, indicating the parameters must be passed by keyword argument, place an ``*`` in the arguments list just before the first *keyword-only* parameter.
el: Για να επισημάνετε τις παραμέτρους ως *μόνο keyword*, υποδεικνύοντας ότι οι παράμετροι πρέπει να περάσουν από το keyword όρισμα, τοποθετήσετε ένα ``*`` στη λίστα ορισμάτων ακριβώς πριν από την πρώτη παράμετρο *μόνο keyword*.

source: Function Examples
el: Παραδείγματα Συναρτήσεων

source: Consider the following example function definitions paying close attention to the markers ``/`` and ``*``::
el: Σκεφτείτε τα ακόλουθα παραδείγματα ορισμών συναρτήσεων δίνοντας ιδιαίτερη προσοχή στους δείκτες ``/`` και ``*``::

source: The first function definition, ``standard_arg``, the most familiar form, places no restrictions on the calling convention and arguments may be passed by position or keyword::
el: Ο πρώτος ορισμός συνάρτησης, ``standard_arg``, η πιο οικεία μορφή, δεν θέτει περιορισμούς στη σύμβαση κλήσης και τα ορίσματα μπορούν να περάσουν από θέση ή από keyword::

source: The second function ``pos_only_arg`` is restricted to only use positional parameters as there is a ``/`` in the function definition::
el: Η δεύτερη συνάρτηση ``pos_only_arg`` περιορίζεται στη χρήση μόνο παραμέτρων θέσης καθώς υπάρχει ένα ``/`` στον ορισμός της συνάρτησης::

source: The third function ``kwd_only_arg`` only allows keyword arguments as indicated by a ``*`` in the function definition::
el: Η τρίτη συνάρτηση ``kwd_only_arg`` επιτρέπει μόνο keyword ορίσματα όπως υποδεικνύεται από ένα ``*`` στον ορισμός της συνάρτησης::

source: And the last uses all three calling conventions in the same function definition::
el: Και το τελευταίο χρησιμοποιεί και τις τρεις συμβάσεις κλήσης στον ίδιο ορισμό συνάρτησης::

source: Finally, consider this function definition which has a potential collision between the positional argument ``name`` and ``**kwds`` which has ``name`` as a key::
el: Τέλος, εξετάστε αυτόν τον ορισμό συνάρτησης που έχει μια πιθανή σύγκρουση μεταξύ του ορίσματος θέσης ``name`` και ``**kwds`` που έχει ως κλειδί το ``name``::

source: There is no possible call that will make it return ``True`` as the keyword ``'name'`` will always bind to the first parameter. For example::
el: Δεν υπάρχει καμία πιθανή κλήση που θα την κάνει να επιστρέψει ``True`` καθώς το keyword ``'name'`` θα συνδέεται πάντα με την πρώτη παράμετρο. Για παράδειγμα::

source: But using ``/`` (positional only arguments), it is possible since it allows ``name`` as a positional argument and ``'name'`` as a key in the keyword arguments::
el: Αλλά χρησιμοποιώντας ``/`` (ορίσματα μόνο θέσης), είναι δυνατό καθώς επιτρέπει το ``name`` ως όρισμα θέσης και το ``'name'`` ως κλειδί στα keyword ορίσματα::

source: In other words, the names of positional-only parameters can be used in ``**kwds`` without ambiguity.
el: Με άλλα λόγια, τα ονόματα των παραμέτρων μόνο θέσης μπορούν να χρησιμοποιηθούν σε ``**kwds`` χωρίς ασάφεια.

source: Recap
el: Ανακεφαλαίωση

source: The use case will determine which parameters to use in the function definition::
el: Η περίπτωση χρήσης θα καθορίσει ποιες παραμέτρους θα χρησιμοποιηθούν στον ορισμό της συνάρτησης::

source: As guidance:
el: Ως καθοδήγηση:

source: Use positional-only if you want the name of the parameters to not be available to the user. This is useful when parameter names have no real meaning, if you want to enforce the order of the arguments when the function is called or if you need to take some positional parameters and arbitrary keywords.
el: Χρησιμοποιήστε τη θέση μόνο εάν θέλετε το όνομα των παραμέτρων να μην είναι διαθέσιμο στο χρήστη. Αυτό είναι χρήσιμο όταν τα ονόματα παραμέτρων δεν έχουν πραγματικό νόημα, εάν δεν θέλετε να επιβάλετε τη σειρά των ορισμάτων όταν καλείται η συνάρτηση ή εάν πρέπει να ληφθούν ορισμένες παράμετροι θέσης και αυθαίρετα keywords.

source: Use keyword-only when names have meaning and the function definition is more understandable by being explicit with names or you want to prevent users relying on the position of the argument being passed.
el: Χρησιμοποιήστε keyword μόνο όταν τα ονόματα έχουν νόημα και ο ορισμός της συνάρτησης είναι πιο κατανοητός όταν είναι ρητός με ονόματα ή θέλετε να αποτρέψετε τους χρήστες να βασίζονται στη θέση του επιχειρήματος που μεταβιβάζεται.

source: For an API, use positional-only to prevent breaking API changes if the parameter's name is modified in the future.
el: Για ένα API, χρησιμοποιήστε το μόνο θέσης για να αποτρέψετε τη διακοπή των αλλαγών τους API, εάν το όνομα της παραμέτρου τροποποιηθεί στο μέλλον.

source: Arbitrary Argument Lists
el: Λίστες Αυθαίρετων Ορισμάτων

source: Finally, the least frequently used option is to specify that a function can be called with an arbitrary number of arguments. These arguments will be wrapped up in a tuple (see :ref:`tut-tuples`). Before the variable number of arguments, zero or more normal arguments may occur. ::
el: Τέλος, η λιγότερο συχνά χρησιμοποιούμενη επιλογή είναι να ορίσετε ότι μια συνάρτηση μπορεί να κληθεί με έναν αυθαίρετο αριθμός ορισμάτων. Αυτά τα ορίσματα θα τυλιχθούν σε μια πλειάδα (tuple) (βλ. :ref:`tut-tuples`). Πριν από τον μεταβλητό αριθμό ορισμάτων ενδέχεται να προκύψουν μηδέν ή περισσότερα κανονικά ορίσματα. ::

source: Normally, these *variadic* arguments will be last in the list of formal parameters, because they scoop up all remaining input arguments that are passed to the function. Any formal parameters which occur after the ``*args`` parameter are 'keyword-only' arguments, meaning that they can only be used as keywords rather than positional arguments. ::
el: Κανονικά, αυτά τα *variadic* ορίσματα θα είναι τελευταία στη λίστα των επίσημων παραμέτρων, επειδή συλλέγουν όλα τα υπόλοιπα ορίσματα εισόδου που μεταβιβάζονται στη συνάρτηση. Οποιεσδήποτε τυπικές παράμετροι που εμφανίζονται μετά την παράμετρο ``*args`` είναι 'μόνο keyword' ορίσματα, που σημαίνει ότι μπορούν να χρησιμοποιηθούν μόνο ως λέξεις-κλειδιά και όχι ως ορίσματα θέσης. ::

source: Unpacking Argument Lists
el: Unpacking Λίστες Ορισμάτων

source: The reverse situation occurs when the arguments are already in a list or tuple but need to be unpacked for a function call requiring separate positional arguments. For instance, the built-in :func:`range` function expects separate *start* and *stop* arguments. If they are not available separately, write the function call with the ``*``\ -operator to unpack the arguments out of a list or tuple::
el: Η αντίστροφη κατάσταση συμβαίνει όταν τα ορίσματα βρίσκονται ήδη σε μια λίστα ή πλειάδα (tuple), αλλά πρέπει να αποσυμπιεστούν για μια κλήση συνάρτησης που απαιτεί ξεχωριστά ορίσματα θέσης. Για παράδειγμα, η ενσωματωμένη (built-in) συνάρτηση :func:`range` αναμένει ξεχωριστά *start* και *stop* ορίσματα. Εάν δεν είναι διαθέσιμα ξεχωριστά, γράψτε την κλήση συνάρτησης με τον ``*``\ -τελεστή για να αποσυμπιέσετε τα ορίσματα από μια λίστα ή πλειάδα (tuple)::

source: In the same fashion, dictionaries can deliver keyword arguments with the ``**``\ -operator::
el: Με τον ίδιο τρόπο, τα λεξικά μπορούν να παραδίδουν keyword ορίσματα με τον ``**``\ -τελεστή::

source: Lambda Expressions
el: Εκφράσεις Lambda
