Repository: thepetk/python-docs-gr
Catalog: tutorial/introduction.po
Languages: el

source: An Informal Introduction to Python
el: Μία Άτυπη Εισαγωγή στην Python

source: In the following examples, input and output are distinguished by the presence or absence of prompts (:term:`>>>` and :term:`...`): to repeat the example, you must type everything after the prompt, when the prompt appears; lines that do not begin with a prompt are output from the interpreter. Note that a secondary prompt on a line by itself in an example means you must type a blank line; this is used to end a multi-line command.
el: Στα ακόλουθα παραδείγματα, η είσοδος και η έξοδος διακρίνονται από την παρουσία ή την απουσία prompts (:term:`>>>` και :term:`...`): για να επαναλάβετε το παράδειγμα, πρέπει να πληκτρολογήσετε τα πάντα μετά το prompt, όταν αυτό υπάρχει∙ οι γραμμές που δεν αρχίζουν με prompt είναι έξοδος από τον διερμηνέα. Σημείωση ότι ένα δευτερεύον prompt μόνο του σε μια γραμμή σε ένα παράδειγμα σημαίνει ότι πρέπει να πληκτρολογήσετε μια κενή γραμμή∙ αυτό χρησιμοποιείται για να τερματίσετε μια εντολή πολλών γραμμών.

source: You can toggle the display of prompts and output by clicking on ``>>>`` in the upper-right corner of an example box. If you hide the prompts and output for an example, then you can easily copy and paste the input lines into your interpreter.
el: Μπορείτε να αλλάξετε την εμφάνιση των prompts και της εξόδου κάνοντας κλικ στο ``>>>>`` στην επάνω δεξιά γωνία ενός πλαισίου παραδείγματος. Εάν αποκρύψετε τα prompts και την έξοδο για ένα παράδειγμα, τότε μπορείτε εύκολα να αντιγράψετε και να επικολλήσετε τις γραμμές εισαγωγής στον διερμηνέα σας.

source: Many of the examples in this manual, even those entered at the interactive prompt, include comments. Comments in Python start with the hash character, ``#``, and extend to the end of the physical line. A comment may appear at the start of a line or following whitespace or code, but not within a string literal. A hash character within a string literal is just a hash character. Since comments are to clarify code and are not interpreted by Python, they may be omitted when typing in examples.
el: Πολλά από τα παραδείγματα σε αυτόν τον οδηγό, ακόμη και αυτά που εισάγονται στο διαδραστικό prompt, περιέχουν σχόλια. Τα σχόλια στην Python ξεκινούν με τον χαρακτήρα hashtag, ``#``, και εκτείνονται μέχρι το τέλος της γραμμής. Ένα σχόλιο μπορεί να εμφανιστεί στην αρχή μιας σειράς ή μετά από κενά διαστήματα ή κώδικα, αλλά όχι μέσα σε μία συμβολοσειρά. Ένας χαρακτήρας hashtag μέσα σε μία συμβολοσειρά είναι απλώς ένας χαρακτήρας hashtag. Δεδομένου ότι τα σχόλια αποσκοπούν στην αποσαφήνιση του κώδικα και δεν ερμηνεύονται από την Python, μπορούν να παραλείπονται κατά την πληκτρολόγηση παραδειγμάτων.

source: Some examples::
el: Μερικά παραδείγματα::

source: Using Python as a Calculator
el: Χρησιμοποιώντας την Python ως Αριθμομηχανή

source: Let's try some simple Python commands. Start the interpreter and wait for the primary prompt, ``>>>``. (It shouldn't take long.)
el: Ας δοκιμάσουμε μερικές απλές εντολές της Python. Ξεκινήστε τον διερμηνέα και περιμένετε το πρώτο prompt, ```>>>```. (Δεν θα πάρει πολύ χρόνο.)

source: Numbers
el: Αριθμοί

source: The interpreter acts as a simple calculator: you can type an expression at it and it will write the value. Expression syntax is straightforward: the operators ``+``, ``-``, ``*`` and ``/`` can be used to perform arithmetic; parentheses (``()``) can be used for grouping. For example::
el: Ο διερμηνέας λειτουργεί ως μία απλή αριθμομηχανή: μπορείτε να πληκτρολογήσετε μία έκφραση και εκείνος θα γράψει την τιμή. Το συντακτικό μίας έκφρασης είναι απλό: οι τελεστές ``+``, ``-``, ``*`` και ``/`` μπορούν να χρησιμοποιηθούν για την εκτέλεση αριθμητικών πράξεων∙ οι παρενθέσεις (``()``) μπορούν να χρησιμοποιηθούν για ομαδοποίηση. Για παράδειγμα::

source: The integer numbers (e.g. ``2``, ``4``, ``20``) have type :class:`int`, the ones with a fractional part (e.g. ``5.0``, ``1.6``) have type :class:`float`. We will see more about numeric types later in the tutorial.
el: Οι ακέραιοι αριθμοί (π.χ. ``2``, ``4``, ``20``) έχουν τον τύπο :class:`int`, οι αριθμοί με δεκαδικά ψηφία (π.χ. ``5.0``, ``1.6``) έχουν τον τύπο :class:`float`. Θα δούμε περισσότερα για τους αριθμητικούς τύπους αργότερα σε αυτόν τον οδηγό.

source: Division (``/``) always returns a float. To do :term:`floor division` and get an integer result you can use the ``//`` operator; to calculate the remainder you can use ``%``::
el: Η διαίρεση (``/``) πάντα επιστρέφει ένα float. Για να κάνετε :term:`floor division` (ακέραια διαίρεση) και να πάρετε ένα ακέραιο αποτέλεσμα, μπορείτε να χρησιμοποιήσετε τον τελεστή ``//``∙ για να υπολογίσετε το το υπόλοιπο μίας διαίρεσης, χρησιμοποιήστε τον τελεστή ``%``::

source: With Python, it is possible to use the ``**`` operator to calculate powers [#]_::
el: Στην Python, είναι εφικτό να χρησιμοποιήσετε τον τελεστή ``**`` για να υπολογίσετε δυνάμεις [#]_::

source: The equal sign (``=``) is used to assign a value to a variable. Afterwards, no result is displayed before the next interactive prompt::
el: Το σύμβολο της ισότητας (``=``) χρησιμοποιείται για την ανάθεση μιας τιμής σε μια μεταβλητή. Στη συνέχεια, δεν εμφανίζεται αποτέλεσμα πριν από το επόμενο διαδραστικό prompt::

source: If a variable is not "defined" (assigned a value), trying to use it will give you an error::
el: Αν μία μεταβλητή δεν έχει «οριστεί» (δεν της έχει αποδοθεί κάποια τιμή), η προσπάθεια χρήσης της θα σας δώσει ένα σφάλμα::

source: There is full support for floating point; operators with mixed type operands convert the integer operand to floating point::
el: Υπάρχει πλήρης υποστήριξη για δεκαδικά ψηφία∙ τελεστές με τελεστέους μικτού τύπου μετατρέπουν τον ακέραιο τελεστέο σε δεκαδικό::

source: In interactive mode, the last printed expression is assigned to the variable ``_``. This means that when you are using Python as a desk calculator, it is somewhat easier to continue calculations, for example::
el: Στη διαδραστική λειτουργία, η τελευταία εκτυπωμένη έκφραση εκχωρείται στη μεταβλητή ``_``. Αυτό σημαίνει ότι όταν χρησιμοποιείτε την Python ως αριθμομηχανή γραφείου, είναι κάπως πιο εύκολο να συνεχίσετε προηγούμενους υπολογισμούς, για παράδειγμα:

source: This variable should be treated as read-only by the user. Don't explicitly assign a value to it --- you would create an independent local variable with the same name masking the built-in variable with its magic behavior.
el: Αυτή η μεταβλητή θα πρέπει να αντιμετωπίζεται από τον χρήστη ως μόνο για ανάγνωση. Μην της αναθέτετε ρητά μια τιμή --- θα δημιουργούσατε μια ανεξάρτητη τοπική μεταβλητή με το ίδιο όνομα αποκρύπτοντας την ενσωματωμένη μεταβλητή με τη μαγική της συμπεριφορά.

source: In addition to :class:`int` and :class:`float`, Python supports other types of numbers, such as :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Python also has built-in support for :ref:`complex numbers <typesnumeric>`, and uses the ``j`` or ``J`` suffix to indicate the imaginary part (e.g. ``3+5j``).
el: Εκτός από :class:`int` και :class:`float`, η Python υποστηρίζει και άλλους τύπους αριθμών, όπως :class:`~decimal.Decimal` και :class:`~fractions.Fraction`. Η Python έχει επίσης ενσωματωμένη υποστήριξη για :ref:`complex numbers <typesnumeric>` (μιγαδικούς αριθμούς), και χρησιμοποιεί την κατάληξη ``j`` ή ``J`` για να δηλώσει το φανταστικό μέρος (π.χ. ``3+5j``).

source: Text
el: Κείμενο

source: Python can manipulate text (represented by type :class:`str`, so-called "strings") as well as numbers. This includes characters "``!``", words "``rabbit``", names "``Paris``", sentences "``Got your back.``", etc. "``Yay! :)``". They can be enclosed in single quotes (``'...'``) or double quotes (``"..."``) with the same result [#]_.
el: Η Python μπορεί να χειριστεί κείμενο (που αντιπροσωπεύεται από τον τύπο :class:`str`, τις λεγόμενες «συμβολοσειρές») καθώς και αριθμούς. Αυτό περιλαμβάνει χαρακτήρες «``!``», λέξεις «``κουνέλι``», ονόματα «``Παρίσι``», προτάσεις «``Καλύπτω τα νώτα σου.``», κ.λπ. «``Ναι! :)``». Μπορούν να περικλείονται σε μονά εισαγωγικά (``'...'``) ή διπλά εισαγωγικά (``"..."``) με το ίδιο αποτέλεσμα [#]_.

source: To quote a quote, we need to "escape" it, by preceding it with ``\``. Alternatively, we can use the other type of quotation marks::
el: Για να προσθέσουμε ένα εισαγωγικό, πρέπει να το «κάνουμε escape», προτάσσοντάς του μία ``\``. Εναλλακτικά, μπορούμε να χρησιμοποιήσουμε τον άλλο τύπο εισαγωγικών::

source: In the Python shell, the string definition and output string can look different. The :func:`print` function produces a more readable output, by omitting the enclosing quotes and by printing escaped and special characters::
el: Στο shell της Python, ο ορισμός συμβολοσειράς και η συμβολοσειρά εξόδου μπορεί να μοιάζουν διαφορετικά. Η συνάρτηση :func:`print` παράγει μια πιο ευανάγνωστη έξοδο, παραλείποντας τα εισαγωγικά που περικλείουν την συμβολοσειρά και εκτυπώνοντας escaped και ειδικούς χαρακτήρες::

source: If you don't want characters prefaced by ``\`` to be interpreted as special characters, you can use *raw strings* by adding an ``r`` before the first quote::
el: Εάν δεν θέλετε οι χαρακτήρες που προηγούνται από μία ``\`` να ερμηνεύονται ως ειδικοί χαρακτήρες, μπορείτε να χρησιμοποιήσετε *ακατέργαστες συμβολοσειρές* προσθέτοντας ένα ``r`` πριν από το πρώτο εισαγωγικό::

source: There is one subtle aspect to raw strings: a raw string may not end in an odd number of ``\`` characters; see :ref:`the FAQ entry <faq-programming-raw-string-backslash>` for more information and workarounds.
el: Υπάρχει μια δυσδιάκριτη πτυχή στις ακατέργαστες συμβολοσειρές: μια ακατέργαστη συμβολοσειρά δεν μπορεί να τελειώνει σε περιττό αριθμό χαρακτήρων ``\``' δείτε :ref:`το λήμμα των Συχνών Ερωτήσεων <faq-programming-raw-string-backslash>` για περισσότερες πληροφορίες και λύσεις.

source: String literals can span multiple lines. One way is using triple-quotes: ``"""..."""`` or ``'''...'''``. End-of-line characters are automatically included in the string, but it's possible to prevent this by adding a ``\`` at the end of the line. In the following example, the initial newline is not included::
el: Οι συμβολοσειρές κυριολεξίας μπορούν να καλύπτουν πολλές γραμμές. Ένας τρόπος είναι χρησιμοποιώντας τριπλά εισαγωγικά: ``"""..."""`` ή ``'''...'''``. Οι χαρακτήρες στο τέλος των γραμμών συμπεριλαμβάνονται αυτόματα στην συμβολοσειρά, αλλά είναι εφικτό να το αποτρέψετε αυτό προσθέτοντας μία ``\`` στο τέλος της γραμμής. Στο ακόλουθο παράδειγμα, η αρχική νέα γραμμή δεν περιλαμβάνεται::

source: Strings can be concatenated (glued together) with the ``+`` operator, and repeated with ``*``::
el: Οι συμβολοσειρές μπορούν να συνδεθούν (κολληθούν η μία στην άλλη) με τον τελεστή ``+``, και να επαναληφθούν με τον τελεστή ``*``::

source: Two or more *string literals* (i.e. the ones enclosed between quotes) next to each other are automatically concatenated. ::
el: Δύο ή παραπάνω *συμβολοσειρές* (που περικλείονται σε εισαγωγικά) η μία δίπλα στην άλλη συνδέονται αυτόματα. ::

source: This feature is particularly useful when you want to break long strings::
el: Αυτή η λειτουργία είναι ιδιαίτερα χρήσιμη όταν θέλετε να σπάσετε μεγάλες συμβολοσειρές::

source: This only works with two literals though, not with variables or expressions::
el: Ωστόσο, αυτό λειτουργεί μόνο με κυριολεκτικές συμβολοσειρές, όχι με μεταβλητές ή εκφράσεις::

source: If you want to concatenate variables or a variable and a literal, use ``+``::
el: Αν θέλετε να συνδέσετε μεταβλητές ή μία μεταβλητή και μία κυριολεκτική συμβολοσειρά, χρησιμοποιήστε το ``+``::

source: Strings can be *indexed* (subscripted), with the first character having index 0. There is no separate character type; a character is simply a string of size one::
el: Οι συμβολοσειρές μπορούν να είναι *προσπελάσιμες* (μέσω ευρετηρίου), με τον πρώτο χαρακτήρα να έχει τον δείκτη 0. Δεν υπάρχει ξεχωριστός τύπος για χαρακτήρες∙ ένας χαρακτήρας είναι απλώς μία συμβολοσειρά με μέγεθος ένα::

source: Indices may also be negative numbers, to start counting from the right::
el: Οι δείκτες μπορούν να είναι και αρνητικοί αριθμοί, για να ξεκινήσετε την αρίθμηση από τα δεξιά::

source: Note that since -0 is the same as 0, negative indices start from -1.
el: Σημειώστε ότι αφού το -0 είναι το ίδιο με το 0, οι αρνητικοί δείκτες ξεκινούν από το -1.

source: In addition to indexing, *slicing* is also supported. While indexing is used to obtain individual characters, *slicing* allows you to obtain a substring::
el: Εκτός από την ευρετηρίαση, υποστηρίζεται επίσης ο *τεμαχισμός*. Ενώ η ευρετηρίαση χρησιμοποιείται για την απόκτηση μεμονομένων χαρακτήρων, ο *τεμαχισμός* σας επιτρέπει να αποκτήσετε ένας μέρος της συμβολοσειράς::

source: Slice indices have useful defaults; an omitted first index defaults to zero, an omitted second index defaults to the size of the string being sliced. ::
el: Οι δείκτες ενός τεμαχισμού έχουν χρήσιμες προεπιλογές∙ η παράλειψη του πρώτου δείκτη έχει ως προεπιλογή το μηδέν, η παράλειψη του δεύτερου δείκτη έχει ως προεπιλογή το μέγεθος της συμβολοσειράς που τεμαχίζεται. ::

source: Note how the start is always included, and the end always excluded. This makes sure that ``s[:i] + s[i:]`` is always equal to ``s``::
el: Προσέξτε πώς η αρχή περιλαμβάνεται πάντα, ενώ το τέλος πάντα εξαιρείται. Αυτό εξασφαλίζει ότι το ``s[:i] + s[i:]`` είναι πάντα ίσο με ``s``::

source: One way to remember how slices work is to think of the indices as pointing *between* characters, with the left edge of the first character numbered 0. Then the right edge of the last character of a string of *n* characters has index *n*, for example::
el: Ένας τρόπος να θυμάστε πώς λειτουργούν οι τεμαχισμοί είναι να σκεφτείτε ότι οι δείκτες δείχνουν *μεταξύ* χαρακτήρων, με το αριστερό άκρο του πρώτου χαρακτήρα να αριθμείται με 0. Τότε το δεξιό άκρο του τελευταίου χαρακτήρα μιας συμβολοσειράς *ν* χαρακτήρων έχει δείκτη *ν*, για παράδειγμα::

source: The first row of numbers gives the position of the indices 0...6 in the string; the second row gives the corresponding negative indices. The slice from *i* to *j* consists of all characters between the edges labeled *i* and *j*, respectively.
el: Η πρώτη σειρά αριθμών δίνει τη θέση των δεικτών 0...6 στην συμβολοσειρά∙ η δεύτερη σειρά δίνει τους αντίστοιχους αρνητικούς δείκτες. Ο τεμαχισμός από *i* έως *j* αποτελείται από όλους τους χαρακτήρες μεταξύ των άκρων με ετικέτες *i* και *j*, αντίστοιχα.

source: For non-negative indices, the length of a slice is the difference of the indices, if both are within bounds. For example, the length of ``word[1:3]`` is 2.
el: Για μη αρνητικούς δείκτες, το μήκος ενός τεμαχισμού είναι η διαφορά των δεικτών, εάν και οι δύο είναι εντός των ορίων. Για παράδειγμα, το μήκος του ``word[1:3]`` είναι 2.

source: Attempting to use an index that is too large will result in an error::
el: Η απόπειρα χρήσης ενός πολύ μεγάλου δείκτη θα οδηγήσει σε σφάλμα::

source: However, out of range slice indexes are handled gracefully when used for slicing::
el: Ωστόσο, οι δείκτες εκτός εύρους αντιμετωπίζονται χωρίς σφάλμα όταν χρησιμοποιούνται για τεμαχισμούς::

source: Python strings cannot be changed --- they are :term:`immutable`. Therefore, assigning to an indexed position in the string results in an error::
el: Οι συμβολοσειρές της Python δεν μπορούν να αλλάξουν --- είναι :term:`immutable`. Επομένως, η ανάθεση σε μια συγκεκριμένη θέση στη συμβολοσειρά οδηγεί σε σφάλμα::

source: If you need a different string, you should create a new one::
el: Εάν χρειάζεστε μια διαφορετική συμβολοσειρά, θα πρέπει να δημιουργήσετε μια νέα::

source: The built-in function :func:`len` returns the length of a string::
el: Η ενσωματωμένη συνάρτηση :func:`len` επιστρέφει το μήκος μιας συμβολοσειράς::

source: Strings are examples of *sequence types*, and support the common operations supported by such types.
el: Οι συμβολοσειρές είναι παραδείγματα *τύπων ακολουθίας* και υποστηρίζουν τις κοινές πράξεις που υποστηρίζονται από τέτοιους τύπους.

source: Strings support a large number of methods for basic transformations and searching.
el: Οι συμβολοσειρές υποστηρίζουν έναν μεγάλο αριθμό μεθόδων για βασικούς μετασχηματισμούς και αναζήτηση.

source: String literals that have embedded expressions.
el: Κυριολεκτικές συμβολοσειρές που έχουν ενσωματωμένες εκφράσεις.

source: Information about string formatting with :meth:`str.format`.
el: Πληροφορίες σχετικά με τη μορφοποίηση συμβολοσειρών με τη μέθοδο :meth:`str.format`.

source: The old formatting operations invoked when strings are the left operand of the ``%`` operator are described in more detail here.
el: Οι παλιές λειτουργίες μορφοποίησης που καλούνται όταν οι συμβολοσειρές είναι ο αριστερός τελεστέος του τελεστή ``%`` περιγράφονται λεπτομερέστερα εδώ.

source: Lists
el: Λίστες

source: Python knows a number of *compound* data types, used to group together other values. The most versatile is the *list*, which can be written as a list of comma-separated values (items) between square brackets. Lists might contain items of different types, but usually the items all have the same type. ::
el: Η Python γνωρίζει έναν αριθμό *σύνθετων* τύπων δεδομένων, που χρησιμοποιούνται για την ομαδοποίηση άλλων τιμών. Ο πιο ευέλικτος είναι ο τύπος *λίστα*, ο οποίος μπορεί να γραφτεί ως μια λίστα διαχωρισμένων με κόμμα τιμών (στοιχείων) ανάμεσα σε τετράγωνες αγκύλες. Οι λίστες μπορεί να περιέχουν στοιχεία διαφορετικών τύπων, αλλά συνήθως όλα τα στοιχεία έχουν τον ίδιο τύπο. ::

source: Like strings (and all other built-in :term:`sequence` types), lists can be indexed and sliced::
el: Όπως οι συμβολοσειρές (και όλοι οι άλλοι ενσωματωμένοι τύποι :term:`sequence`), οι λίστες μπορούν να δεικτοδοτηθούν και να τεμαχιστούν::

source: Lists also support operations like concatenation::
el: Οι λίστες υποστηρίζουν επίσης λειτουργίες όπως σύνδεση::

source: Unlike strings, which are :term:`immutable`, lists are a :term:`mutable` type, i.e. it is possible to change their content::
el: Σε αντίθεση με τις συμβολοσειρές, οι οποίες είναι :term:`immutable`, οι λίστες είναι :term:`mutable` τύπος, δηλαδή είναι δυνατόν να αλλάξετε το περιεχόμενό τους::

source: You can also add new items at the end of the list, by using the :meth:`!list.append` *method* (we will see more about methods later)::
el: Μπορείτε επίσης να προσθέσετε νέα στοιχεία στο τέλος της λίστας, χρησιμοποιώντας την *μέθοδο* :meth:`!list.append` (θα δούμε περισσότερα για τις μεθόδους αργότερα)::

source: Simple assignment in Python never copies data. When you assign a list to a variable, the variable refers to the *existing list*. Any changes you make to the list through one variable will be seen through all other variables that refer to it.::
el: Η απλή ανάθεση στην Python δεν αντιγράφει ποτέ δεδομένα. Όταν αναθέτετε μια λίστα σε μια μεταβλητή, η μεταβλητή αναφέρεται στην *υπάρχουσα λίστα*. Οποιεσδήποτε αλλαγές κάνετε στη λίστα μέσω μιας μεταβλητής θα γίνουν αντιληπτές από όλες τις άλλες μεταβλητές που αναφέρονται σε αυτήν::

source: All slice operations return a new list containing the requested elements. This means that the following slice returns a :ref:`shallow copy <shallow_vs_deep_copy>` of the list::
el: Όλοι οι τεμαχισμοί επιστρέφουν μια νέα λίστα που περιέχει τα ζητούμενα στοιχεία. Αυτό σημαίνει ότι ο ακόλουθος τεμαχισμός επιστρέφει ένα :ref:`shallow copy <shallow_vs_deep_copy>` (ρηχό αντίγραφο) της λίστας::

source: Assignment to slices is also possible, and this can even change the size of the list or clear it entirely::
el: Η ανάθεση σε τεμαχισμούς είναι επίσης δυνατή, και αυτό μπορεί ακόμη και να αλλάξει το μέγεθος της λίστας ή να τη διαγράψει εντελώς::

source: The built-in function :func:`len` also applies to lists::
el: Η ενσωματωμένη συνάρτηση :func:`len` εφαρμόζεται επίσης στις λίστες::

source: It is possible to nest lists (create lists containing other lists), for example::
el: Είναι δυνατό να εμφωλεύσετε λίστες (να δημιουργήσετε λίστες που περιέχουν άλλες λίστες), για παράδειγμα::

source: First Steps Towards Programming
el: Πρώτα Βήματα Προς Τον Προγραμματισμό

source: Of course, we can use Python for more complicated tasks than adding two and two together. For instance, we can write an initial sub-sequence of the `Fibonacci series <https://en.wikipedia.org/wiki/Fibonacci_sequence>`_ as follows::
el: Φυσικά, μπορούμε να χρησιμοποιήσουμε την Python για πιο περίπλοκες εργασίες από την πρόσθεση δύο και δύο μαζί. Για παράδειγμα, μπορούμε να γράψουμε μια αρχική υπο-σειρά της `Σειράς Fibonacci <https://en.wikipedia.org/wiki/Fibonacci_sequence>`_ ως ακολουθεί::

source: This example introduces several new features.
el: Αυτό το παράδειγμα εισάγει διάφορα νέα χαρακτηριστικά.

source: The first line contains a *multiple assignment*: the variables ``a`` and ``b`` simultaneously get the new values 0 and 1. On the last line this is used again, demonstrating that the expressions on the right-hand side are all evaluated first before any of the assignments take place. The right-hand side expressions are evaluated from the left to the right.
el: Η πρώτη γραμμή περιέχει μια *πολλαπλή ανάθεση*: οι μεταβλητές ``a`` και ``b`` παίρνουν ταυτόχρονα τις νέες τιμές 0 και 1. Στην τελευταία γραμμή αυτό χρησιμοποιείται ξανά, αποδεικνύοντας ότι οι εκφράσεις στη δεξιά πλευρά αξιολογούνται όλες πρώτα πριν γίνει οποιαδήποτε ανάθεση. Οι εκφράσεις στην δεξιά πλευρά αξιολογούνται από αριστερά προς τα δεξιά.

source: The :keyword:`while` loop executes as long as the condition (here: ``a < 10``) remains true. In Python, like in C, any non-zero integer value is true; zero is false. The condition may also be a string or list value, in fact any sequence; anything with a non-zero length is true, empty sequences are false. The test used in the example is a simple comparison. The standard comparison operators are written the same as in C: ``<`` (less than), ``>`` (greater than), ``==`` (equal to), ``<=`` (less than or equal to), ``>=`` (greater than or equal to) and ``!=`` (not equal to).
el: Ο βρόχος :keyword:`while` εκτελείται όσο η συνθήκη (εδώ: ``a < 10``) παραμένει αληθής. Στην Python, όπως και στη C, οποιαδήποτε μη μηδενική ακέραια τιμή είναι αληθής, το μηδέν είναι ψευδές. Η συνθήκη μπορεί επίσης να είναι μια συμβολοσειρά ή μια λίστα, στην πραγματικότητα οποιαδήποτε ακολουθία∙ οτιδήποτε με μη μηδενικό μήκος είναι αληθές, κενές ακολουθίες είναι ψευδείς. Το τεστ που χρησιμοποιείται στο παράδειγμα είναι μια απλή σύγκριση. Οι τυπικοί τελεστές σύγκρισης γράφονται όπως στη C: ``<`` (μικρότερο από), ``>`` (μεγαλύτερο από), ``==`` (ίσο με), ``<=`` (μικρότερο ή ίσο με), ``>=`` (μεγαλύτερο ή ίσο με) και ``!=`` (μη ίσο με).
