Repository: thepetk/python-docs-gr
Catalog: tutorial/introduction.po
Languages: el

source: The *body* of the loop is *indented*: indentation is Python's way of grouping statements. At the interactive prompt, you have to type a tab or space(s) for each indented line. In practice you will prepare more complicated input for Python with a text editor; all decent text editors have an auto-indent facility. When a compound statement is entered interactively, it must be followed by a blank line to indicate completion (since the parser cannot guess when you have typed the last line). Note that each line within a basic block must be indented by the same amount.
el: Στο *σώμα* του βρόχου υπάρχει *εσοχή*: η εσοχή είναι ο τρόπος της Python να ομαδοποιεί εντολές. Στο διαδραστικό prompt, πρέπει να πληκτρολογήσετε ένα tab ή κενό(α) για κάθε γραμμή με εσοχή. Στην πράξη θα προετοιμάσετε πιο περίπλοκες εισαγωγές για την Python με έναν επεξεργαστή κειμένου∙ όλοι οι αξιοπρεπείς επεξεργαστές κειμένου διαθέτουν την δυνατότητα αυτόματης εσοχής. Όταν εισάγεται μια σύνθετη εντολή διαδραστικά, πρέπει να ακολουθείται από μια κενή γραμμή για να υποδηλώνει την ολοκλήρωση (αφού ο συντακτικός αναλυτής δεν μπορεί να μαντέψει πότε πληκτρολογήσατε την τελευταία γραμμή). Σημείωση ότι κάθε γραμμή μέσα σε ένα βασικό μπλοκ πρέπει να έχει την ίδια εσοχή.

source: The :func:`print` function writes the value of the argument(s) it is given. It differs from just writing the expression you want to write (as we did earlier in the calculator examples) in the way it handles multiple arguments, floating-point quantities, and strings. Strings are printed without quotes, and a space is inserted between items, so you can format things nicely, like this::
el: Η συνάρτηση :func:`print` γράφει την τιμή του(των) ορίσματος(ων) που της δίνεται. Διαφέρει από το να γράφετε απλώς την έκφραση που θέλετε να γράψετε (όπως κάναμε νωρίτερα στα παραδείγματα της αριθμομηχανής) στον τρόπο με τον οποίο χειρίζεται πολλαπλά ορίσματα, αριθμούς με δεκαδικά ψηφία και συμβολοσειρές. Οι συμβολοσειρές εκτυπώνονται χωρίς εισαγωγικά, και ένα κενό παρεμβάλλεται μεταξύ των στοιχείων, ώστε να μπορείτε να μορφοποιήσετε τα πράγματα όμορφα, όπως εδώ::

source: The keyword argument *end* can be used to avoid the newline after the output, or end the output with a different string::
el: Το όρισμα-κλειδί *end* μπορεί να χρησιμοποιηθεί για την αποφυγή της νέας γραμμής μετά την έξοδο, ή για να τελειώσετε την έξοδο με μια διαφορετική συμβολοσειρά::

source: Footnotes
el: Υποσημειώσεις

source: Since ``**`` has higher precedence than ``-``, ``-3**2`` will be interpreted as ``-(3**2)`` and thus result in ``-9``. To avoid this and get ``9``, you can use ``(-3)**2``.
el: Δεδομένου ότι το ``**`` έχει μεγαλύτερη προτεραιότητα από το ``-``, το ``-3**2`` θα ερμηνευτεί ως ``-(3**2)`` και έτσι θα προκύψει ``-9``. Για να το αποφύγετε αυτό και να πάρετε ``9``, μπορείτε να χρησιμοποιήσετε ``(-3)**2``.

source: Unlike other languages, special characters such as ``\n`` have the same meaning with both single (``'...'``) and double (``"..."``) quotes. The only difference between the two is that within single quotes you don't need to escape ``"`` (but you have to escape ``\'``) and vice versa.
el: Σε αντίθεση με άλλες γλώσσες, οι ειδικοί χαρακτήρες όπως το ``\n`` έχουν την ίδια σημασία τόσο με απλά (``'...'``) όσο και με διπλά (``"..."``) εισαγωγικά. Η μόνη διαφορά μεταξύ των δύο είναι ότι μέσα σε απλά εισαγωγικά δεν χρειάζεται να αποφύγετε το ``"`` (αλλά πρέπει να αποφύγετε το ``\'``) και το αντίστροφο.

source: comment
el: σχόλιο
