Repository: thepetk/python-docs-gr
Catalog: tutorial/stdlib.po
Languages: el

source: Brief Tour of the Standard Library
el: Σύντομη ξενάγηση στην Standard Βιβλιοθήκη

source: Operating System Interface
el: Διεπαφή Λειτουργικού Συστήματος

source: The :mod:`os` module provides dozens of functions for interacting with the operating system::
el: Το module :mod:`os` παρέχει δεκάδες λειτουργίες για αλληλεπίδραση με το λειτουργικό σύστημα::

source: Be sure to use the ``import os`` style instead of ``from os import *``. This will keep :func:`os.open` from shadowing the built-in :func:`open` function which operates much differently.
el: Βεβαιωθείτε ότι χρησιμοποιείτε το στυλ ``import os`` αντί για το ``from os import *``. Αυτό θα κρατήσει το :func:`os.open` υπό τη σκίαση της ενσωματωμένης συνάρτησης :func:`open` που λειτουργεί πολύ διαφορετικά.

source: The built-in :func:`dir` and :func:`help` functions are useful as interactive aids for working with large modules like :mod:`os`::
el: Οι ενσωματωμένες συναρτήσεις :func:`dir` και :func:`help` είναι χρήσιμες ως διαδραστικά βοηθήματα για εργασία με μεγάλα modules όπως :mod:`os`::

source: >>> import os >>> dir(os) <returns a list of all module functions> >>> help(os) <returns an extensive manual page created from the module's docstrings>
el: >>> import os >>> dir(os) <επιστρέφει μια λίστα από όλες τις συναρτήσεις module> >>> help(os) <επιστρέφει μια εκτενή σελίδα εγχειριδίου που δημιουργήθηκε από τα docstrings του module>

source: For daily file and directory management tasks, the :mod:`shutil` module provides a higher level interface that is easier to use::
el: Για καθημερινές διαχειριστικές εργασίες σε αρχεία και καταλόγους, το module :mod:`shutil` παρέχει μια διεπαφή υψηλότερου επιπέδου που είναι πιο εύκολη στην χρήση::

source: File Wildcards
el: Wildcard Αρχεία

source: The :mod:`glob` module provides a function for making file lists from directory wildcard searches::
el: Το module :mod:`glob` παρέχει μια λειτουργία για τη δημιουργία λιστών αρχείων από αναζητήσεις με χαρακτήρες μπαλαντέρ καταλόγου::

source: Command Line Arguments
el: Ορίσματα γραμμής εντολών

source: Common utility scripts often need to process command line arguments. These arguments are stored in the :mod:`sys` module's *argv* attribute as a list. For instance, let's take the following :file:`demo.py` file::
el: Τα κοινά scripts βοηθητικών προγραμμάτων συχνά χρειάζονται να επεξεργάζονται ορίσματα γραμμής εντολών. Αυτά τα ορίσματα αποθηκεύονται στο χαρακτηριστικό *argv* του module :mod:`sys` ως λίστα. Για παράδειγμα, ας πάρουμε το ακόλουθο αρχείο :file:`demo.py`::

source: Here is the output from running ``python demo.py one two three`` at the command line::
el: Εδώ είναι το αποτέλεσμα από την εκτέλεση του ``python demo.py one two three`` στη γραμμή εντολών::

source: The :mod:`argparse` module provides a more sophisticated mechanism to process command line arguments. The following script extracts one or more filenames and an optional number of lines to be displayed::
el: Το module :mod:`argparse` παρέχει έναν πιο εξελιγμένο μηχανισμό για την επεξεργασία ορισμάτων γραμμής εντολών. Το ακόλουθο script εξάγει ένα ή περισσότερα ονόματα αρχείων και έναν προαιρετικό αριθμό γραμμών που θα εμφανιστούν::

source: When run at the command line with ``python top.py --lines=5 alpha.txt beta.txt``, the script sets ``args.lines`` to ``5`` and ``args.filenames`` to ``['alpha.txt', 'beta.txt']``.
el: Όταν εκτελείται στη γραμμή εντολών το ``python top.py --lines=5 alpha.txt beta.txt``, το script ορίζει το ``args.lines`` σε ``5`` και το ``args.filenames`` σε ``['alpha.txt', 'beta.txt']``.

source: Error Output Redirection and Program Termination
el: Ανακατεύθυνση εξόδου σφάλματος και τερματισμός προγράμματος

source: The :mod:`sys` module also has attributes for *stdin*, *stdout*, and *stderr*. The latter is useful for emitting warnings and error messages to make them visible even when *stdout* has been redirected::
el: Το module :mod:`sys` έχει επίσης χαρακτηριστικά για *stdin*, *stdout*, και *stderr*. Το τελευταίο είναι χρήσιμο για την εκπομπή προειδοποιήσεων και μηνυμάτων σφαλμάτων ώστε να είναι ορατά ακόμα και όταν το *stdout* έχει ανακατευθυνθεί::

source: The most direct way to terminate a script is to use ``sys.exit()``.
el: Ο πιο άμεσος τρόπος για να τερματίσετε ένα script είναι να χρησιμοποιήσετε το ``sys.exit()``.

source: String Pattern Matching
el: Ταίριασμα μοτίβων συμβολοσειρών

source: The :mod:`re` module provides regular expression tools for advanced string processing. For complex matching and manipulation, regular expressions offer succinct, optimized solutions::
el: Το module :mod:`re` παρέχει εργαλεία κανονική έκφρασης για προηγμένη επεξεργασία συμβολοσειρών. Για πολύπλοκη αντιστοίχιση και χειρισμό, οι τυπικές εκφράσεις προσφέρουν συνοπτικές, βελτιστοποιημένες λύσεις::

source: When only simple capabilities are needed, string methods are preferred because they are easier to read and debug::
el: Όταν χρειάζονται μόνο απλές δυνατότητες, προτιμώνται οι μέθοδοι συμβολοσειρών, επειδή είναι ευκολότερες στην ανάγνωση και τον εντοπισμό σφαλμάτων::

source: Mathematics
el: Μαθηματικά

source: The :mod:`math` module gives access to the underlying C library functions for floating-point math::
el: Το module :mod:`math` δίνει πρόσβαση στις υποκείμενες συναρτήσεις της βιβλιοθήκης C για μαθηματικά κινητής υποδιαστολής::

source: The :mod:`random` module provides tools for making random selections::
el: Το module :mod:`random` παρέχει εργαλεία για να κάνουμε τυχαίες επιλογές::

source: The :mod:`statistics` module calculates basic statistical properties (the mean, median, variance, etc.) of numeric data::
el: Το module :mod:`statistics` υπολογίζει βασικές στατιστικές ιδιότητες (μέσος όρος, διάμεσος, διακύμανση, κ.λπ.) αριθμητικών δεδομένων::

source: The SciPy project <https://scipy.org> has many other modules for numerical computations.
el: Το έργο SciPy <https://scipy.org> έχει πολλές άλλες ενότητες για αριθμητικούς υπολογισμούς.

source: Internet Access
el: Πρόσβαση στο Διαδίκτυο

source: There are a number of modules for accessing the internet and processing internet protocols. Two of the simplest are :mod:`urllib.request` for retrieving data from URLs and :mod:`smtplib` for sending mail::
el: Υπάρχει ένας αριθμός modules για πρόσβαση στο διαδίκτυο και επεξεργασία πρωτοκόλλων διαδικτύου. Δύο από τα πιο απλά είναι το :mod:`urllib.request` για να την ανάκτηση δεδομένων από διευθύνσεις URL και το :mod:`smtplib` για την αποστολή αλληλογραφίας::

source: (Note that the second example needs a mailserver running on localhost.)
el: (Σημειώστε ότι το δεύτερο παράδειγμα χρειάζεται διακομιστή αλληλογραφίας που εκτελείται σε localhost.)

source: Dates and Times
el: Ημερομηνίες και ώρες

source: The :mod:`datetime` module supplies classes for manipulating dates and times in both simple and complex ways. While date and time arithmetic is supported, the focus of the implementation is on efficient member extraction for output formatting and manipulation. The module also supports objects that are timezone aware. ::
el: Το module :mod:`datetime` παρέχει κλάσεις για χειρισμό ημερομηνιών και ωρών με απλούς και σύνθετους τρόπους. Ενώ υποστηρίζεται η αριθμητική ημερομηνία και ώρα, η υλοποίηση εστιάζεται στην αποτελεσματική εξαγωγή μελών για μορφοποίηση και χειρισμό εξόδου. Το module επίσης υποστηρίζει αντικείμενα που έχουν επίγνωση ζώνης ώρας. ::

source: Data Compression
el: Συμπίεση Δεδομένων

source: Common data archiving and compression formats are directly supported by modules including: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` and :mod:`tarfile`. ::
el: Οι συνήθεις μορφές αρχειοθέτησης και συμπίεσης δεδομένων υποστηρίζονται άμεσα από modules όπως: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` και :mod:`tarfile`. ::

source: Performance Measurement
el: Μέτρηση επίδοσης

source: Some Python users develop a deep interest in knowing the relative performance of different approaches to the same problem. Python provides a measurement tool that answers those questions immediately.
el: Ορισμένοι χρήστες Python αναπτύσσουν βαθύ ενδιαφέρον να γνωρίζουν τη σχετική απόδοση διαφορετικών προσεγγίσεων στο ίδιο πρόβλημα. Η Python παρέχει ένα εργαλείο μέτρησης που απαντά σε αυτές τις ερωτήσεις αμέσως.

source: For example, it may be tempting to use the tuple packing and unpacking feature instead of the traditional approach to swapping arguments. The :mod:`timeit` module quickly demonstrates a modest performance advantage::
el: Για παράδειγμα, μπορεί να είναι δελεαστικό να χρησιμοποιήσετε τη δυνατότητα tuple packing και unpacking αντί της παραδοσιακής προσέγγισης για την εναλλαγή ορισμάτων. Το module :mod:`timeit` δείχνει γρήγορα ένα ταπεινό πλεονέκτημα απόδοσης::

source: In contrast to :mod:`timeit`'s fine level of granularity, the :mod:`profile` and :mod:`pstats` modules provide tools for identifying time critical sections in larger blocks of code.
el: Σε αντίθεση με το λεπτό επίπεδο ευκρίνειας του :mod:`timeit`, τα modules :mod:`profile` και :mod:`pstats` παρέχουν εργαλεία για τον εντοπισμό κρίσιμων χρονικών τμημάτων σε μεγαλύτερα μπλοκ κώδικα.

source: Quality Control
el: Έλεγχος ποιότητας

source: One approach for developing high quality software is to write tests for each function as it is developed and to run those tests frequently during the development process.
el: Μια καλή προσέγγιση για την ανάπτυξη λογισμικού υψηλής ποιότητας είναι να γράφονται tests για κάθε λειτουργία καθώς αναπτύσσεται και να εκτελούνται συχνά αυτά τα tests κατά τη διαδικασία ανάπτυξης.

source: The :mod:`doctest` module provides a tool for scanning a module and validating tests embedded in a program's docstrings. Test construction is as simple as cutting-and-pasting a typical call along with its results into the docstring. This improves the documentation by providing the user with an example and it allows the doctest module to make sure the code remains true to the documentation::
el: Το module :mod:`doctest` παρέχει ένα εργαλείο για τη σάρωση ενός module και την επικύρωση tests που είναι ενσωματωμένες στις συμβολοσειρές εγγράφων ενός προγράμματος. Η κατασκευή του test είναι τόσο απλή όσο η αποκοπή και επικόλληση μιας τυπικής κλήσης μαζί με τα αποτελέσματα της στη συμβολοσειρά εγγράφων. Αυτό βελτιώνει την τεκμηρίωση παρέχοντας στον χρήστη ένα παράδειγμα και επιτρέπει στην ενότητα doctest να βεβαιωθεί ότι ο κώδικας παραμένει πιστός στην τεκμηρίωση::

source: def average(values): """Computes the arithmetic mean of a list of numbers. >>> print(average([20, 30, 70])) 40.0 """ return sum(values) / len(values) import doctest doctest.testmod() # automatically validate the embedded tests
el: def average(values): """Υπολογίζει έναν αριθμητικό μέσο για μια λίστα από αριθμούς. >>> print(average([20, 30, 70])) 40.0 """ return sum(values) / len(values) import doctest doctest.testmod() # automatically validate the embedded tests

source: The :mod:`unittest` module is not as effortless as the :mod:`doctest` module, but it allows a more comprehensive set of tests to be maintained in a separate file::
el: Το module :mod:`unittest` δεν είναι τόσο εύκολο όσο το module :mod:`doctest`, αλλά επιτρέπει τη διατήρηση ενός πιο ολοκληρωμένου συνόλου tests σε ξεχωριστό αρχείο::

source: Python has a "batteries included" philosophy. This is best seen through the sophisticated and robust capabilities of its larger packages. For example:
el: Η Python έχει μια φιλοσοφία "συμπεριλαμβάνονται μπαταρίες". Αυτό φαίνεται καλύτερα μέσα από τις εξελιγμένες και ισχυρές δυνατότητες των μεγαλύτερων πακέτων της. Για παράδειγμα:

source: The :mod:`xmlrpc.client` and :mod:`xmlrpc.server` modules make implementing remote procedure calls into an almost trivial task. Despite the modules' names, no direct knowledge or handling of XML is needed.
el: Τα modules :mod:`xmlrpc.client` και :mod:`xmlrpc.server` καθιστούν την υλοποίηση κλήσεων απομακρυσμένων διαδικασιών σε μια σχεδόν ασήμαντη εργασία. Παρά τα ονόματα των modules, δεν απαιτείται άμεση γνώση ή χειρισμός της XML.

source: The :mod:`email` package is a library for managing email messages, including MIME and other :rfc:`2822`-based message documents. Unlike :mod:`smtplib` and :mod:`poplib` which actually send and receive messages, the email package has a complete toolset for building or decoding complex message structures (including attachments) and for implementing internet encoding and header protocols.
el: Το πακέτο :mod:`email` είναι μια βιβλιοθήκη για τη διαχείριση μηνυμάτων ηλεκτρονικού ταχυδρομείου, συμπεριλαμβανομένων MIME και άλλων μηνυμάτων εγγράφων που βασίζονται σε :rfc:`2822`. Σε αντίθεση με τα :mod:`smtplib` και :mod:`poplib` που στην πραγματικότητα στέλνουν και λαμβάνουν μηνύματα, το πακέτο email έχει ένα πλήρες σύνολο εργαλείων για τη δημιουργία ή την αποκωδικοποίηση πολύπλοκων δομών μηνυμάτων (συμπεριλαμβανομένων των συνημμένων) και για την εφαρμογή κωδικοποίηση και πρωτόκολλο κεφαλίδων στο διαδίκτυο.

source: The :mod:`json` package provides robust support for parsing this popular data interchange format. The :mod:`csv` module supports direct reading and writing of files in Comma-Separated Value format, commonly supported by databases and spreadsheets. XML processing is supported by the :mod:`xml.etree.ElementTree`, :mod:`xml.dom` and :mod:`xml.sax` packages. Together, these modules and packages greatly simplify data interchange between Python applications and other tools.
el: Το πακέτο :mod:`json` παρέχει ισχυρή υποστήριξη για την ανάλυση αυτής της δημοφιλούς μορφής ανταλλαγής δεδομένων. Το module :mod:`csv` υποστηρίζει την άμεση ανάγνωση και εγγραφή αρχείων σε μορφή τιμής διαχωρισμένου με κόμματα, που συνήθως υποστηρίζεται από βάσεις δεδομένων και υπολογιστικά φύλλα. Η XML επεξεργασία υποστηρίζεται από τα πακέτα :mod:`xml.etree.ElementTree`, :mod:`xml.dom` και :mod:`xml.sax`. Μαζί, αυτές οι μονάδες και τα πακέτα απλοποιούν σημαντικά την ανταλλαγή δεδομένων μεταξύ εφαρμογών Python και άλλων εργαλείων.

source: The :mod:`sqlite3` module is a wrapper for the SQLite database library, providing a persistent database that can be updated and accessed using slightly nonstandard SQL syntax.
el: Το module :mod:`sqlite3` αποτελεί έναν wrapper για τη βιβλιοθήκη της βάσης δεδομένων SQLite, παρέχοντας μια συνεχής βάση δεδομένων που μπορεί να ενημερωθεί και να προσπελαστεί χρησιμοποιώντας ελαφρώς μη τυπική σύνταξη SQL.

source: Internationalization is supported by a number of modules including :mod:`gettext`, :mod:`locale`, and the :mod:`codecs` package.
el: Η διεθνοποίηση υποστηρίζεται από έναν αριθμό modules, συμπεριλαμβανομένων των :mod:`gettext`, :mod:`locale`, και το πακέτο :mod:`codecs`.

source: built-in function
el: ενσωματωμένες συναρτήσεις

source: help
el: βοήθεια
