Repository: thepetk/python-docs-gr
Catalog: glossary.po
Languages: el

source: :dfn:`positional-or-keyword`: specifies an argument that can be passed either :term:`positionally <argument>` or as a :term:`keyword argument <argument>`. This is the default kind of parameter, for example *foo* and *bar* in the following::
el: :dfn:`λέξη-κλειδί ή θέση`: καθορίζει ένα όρισμα που μπορεί να μεταβιβαστεί είτε :term:`θέσεως <argument>` ή ως :term:`όρισμα λέξης-κλειδιού <argument>`. Αυτό είναι το προεπιλεγμένο είδος παραμέτρου, για παράδειγμα *foo* και *bar* στα ακόλουθα::

source: :dfn:`positional-only`: specifies an argument that can be supplied only by position. Positional-only parameters can be defined by including a ``/`` character in the parameter list of the function definition after them, for example *posonly1* and *posonly2* in the following::
el: :dfn:`θέσεως μόνο`: καθορίζει ένα όρισμα που μπορεί να παρέχεται μόνο από τη θέση. Οι παράμετροι μόνο θέσης μπορούν να οριστούν συμπεριλαμβάνοντας έναν χαρακτήρα ``/`` στη λίστα παραμέτρων του ορισμού συνάρτησης μετά από αυτές, για παράδειγμα *posonly1* και *posonly2* στα εξής::

source: :dfn:`keyword-only`: specifies an argument that can be supplied only by keyword. Keyword-only parameters can be defined by including a single var-positional parameter or bare ``*`` in the parameter list of the function definition before them, for example *kw_only1* and *kw_only2* in the following::
el: :dfn:`λέξης-κλειδί μόνο`: καθορίζει ένα όρισμα που μπορεί να παρέχεται μόνο με λέξη κλειδί. Οι παράμετροι μόνο για λέξη-κλειδί μπορούν να οριστούν συμπεριλαμβάνοντας μια παράμετρο θέσης ή σκέτο ``*`` στη λίστα παραμέτρων του ορισμού συνάρτησης πριν από αυτές, για παράδειγμα *kw_only1* και *kw_only2* στα ακόλουθα::

source: :dfn:`var-positional`: specifies that an arbitrary sequence of positional arguments can be provided (in addition to any positional arguments already accepted by other parameters). Such a parameter can be defined by prepending the parameter name with ``*``, for example *args* in the following::
el: :dfn:`μεταβλητή θέσης`: καθορίζει ότι μπορεί να παρασχεθεί μια αυθαίρετη ακολουθία ορισμάτων θέσης (επιπλέον των ορισμάτων θέσης που είναι ήδη αποδεκτά από άλλες παραμέτρους). Μια τέτοια παράμετρος μπορεί να οριστεί προσαρτώντας το όνομα της παραμέτρου με ``*``, για παράδειγμα *args* στα ακόλουθα::

source: :dfn:`var-keyword`: specifies that arbitrarily many keyword arguments can be provided (in addition to any keyword arguments already accepted by other parameters). Such a parameter can be defined by prepending the parameter name with ``**``, for example *kwargs* in the example above.
el: :dfn:`μεταβλητή λέξη-κλειδί`: καθορίζει ότι μπορούν να παρέχονται αυθαίρετα πολλά ορίσματα λέξης-κλειδιού (επιπλέον των ορισμάτων λέξης κλειδιού που είναι αποδεκτά από άλλες παραμέτρους). Μια τέτοια παράμετρος μπορεί να οριστεί προσαρτώντας το όνομα της παραμέτρου με ``**``, για παράδειγμα *kwargs* όπως παραπάνω.

source: Parameters can specify both optional and required arguments, as well as default values for some optional arguments.
el: Οι παράμετροι μπορούν να καθορίσουν τόσο τα προαιρετικά όσο και τα απαιτούμενα ορίσματα , καθώς και προεπιλεγμένες τιμές για ορισμένα προαιρετικά ορίσματα.

source: See also the :term:`argument` glossary entry, the FAQ question on :ref:`the difference between arguments and parameters <faq-argument-vs-parameter>`, the :class:`inspect.Parameter` class, the :ref:`function` section, and :pep:`362`.
el: Βλ. επίσης την :term:`argument` καταχώριση ευρετηρίου, την ερώτηση FAQ σχετικά με :ref:`η διαφορά μεταξύ ορισμάτων και παραμέτρων <faq-argument-vs-parameter>`, την κλάση :class:`inspect.Parameter`, την ενότητα :ref:`function` και :pep:`362`.

source: A single location on the :term:`import path` which the :term:`path based finder` consults to find modules for importing.
el: Μια μεμονωμένη τοποθεσία στο :term:`import path` την οποία συμβουλεύεται ο :term:`path based finder` για να βρει modules για εισαγωγή.

source: A :term:`finder` returned by a callable on :data:`sys.path_hooks` (i.e. a :term:`path entry hook`) which knows how to locate modules given a :term:`path entry`.
el: Ένας :term:`finder` που επιστρέφεται από έναν καλούμενο στο :data:`sys.path_hooks` (δηλαδή ένα :term:`path entry hook`) που ξέρει πως να εντοπίζει modules με :term:`path entry`.

source: See :class:`importlib.abc.PathEntryFinder` for the methods that path entry finders implement.
el: Βλ. :class:`importlib.abc.PathEntryFinder` για τις μεθόδους που ο entry finder διαδρομής υλοποιεί.

source: A callable on the :data:`sys.path_hooks` list which returns a :term:`path entry finder` if it knows how to find modules on a specific :term:`path entry`.
el: Ένα καλούμενο στη λίστα :data:`sys.path_hooks`, το οποίο επιστρέφει ένα :term:`path entry finder` εάν ξέρει πως να βρίσκει module σε μια συγκεκριμένη :term:`path entry`.

source: One of the default :term:`meta path finders <meta path finder>` which searches an :term:`import path` for modules.
el: Ένα από τα προεπιλεγμένα :term:`meta path finders <meta path finder>` που αναζητά ένα :term:`import path` για modules.

source: path-like object
el: path-like αντικείμενο

source: An object representing a file system path. A path-like object is either a :class:`str` or :class:`bytes` object representing a path, or an object implementing the :class:`os.PathLike` protocol. An object that supports the :class:`os.PathLike` protocol can be converted to a :class:`str` or :class:`bytes` file system path by calling the :func:`os.fspath` function; :func:`os.fsdecode` and :func:`os.fsencode` can be used to guarantee a :class:`str` or :class:`bytes` result instead, respectively. Introduced by :pep:`519`.
el: Ένα αντικείμενο που αντιπροσωπεύει ένα path συστήματος αρχείων. Ένα αντικείμενο path είναι είτε ένα αντικείμενο :class:`str` ή :class:`bytes` που αντιπροσωπεύει ένα path ή ένα αντικείμενο που υλοποιεί το πρωτόκολλο :class:`os.PathLike`. Ένα αντικείμενο που υποστηρίζει το πρωτόκολλο :class:`os.PathLike` μπορεί να μετατραπεί σε path συστήματος αρχείων :class:`str` ή :class:`bytes` καλώντας την συνάρτηση :func:`os.fspath`' τα :func:`os.fsdecode` και :func:`os.fsencode` μπορούν να χρησιμοποιηθούν για την εγγύηση ενός αποτελέσματος :class:`str` ή :class:`bytes`, αντίστοιχα. Εισήχθη από τον :pep:`519`.

source: Python Enhancement Proposal. A PEP is a design document providing information to the Python community, or describing a new feature for Python or its processes or environment. PEPs should provide a concise technical specification and a rationale for proposed features.
el: Πρόταση Βελτίωσης Python. Ένα PEP είναι ένα έγγραφο σχεδιασμού που παρέχει πληροφορίες στην κοινότητα Python ή περιγράφει μια νέα δυνατότητα για την Python ή τις διαδικασίες ή το περιβάλλον της. Τα PEP θα πρέπει να παρέχουν μια συνοπτική τεχνική προδιαγραφή και μια λογική για τα προτεινόμενα χαρακτηριστικά.

source: PEPs are intended to be the primary mechanisms for proposing major new features, for collecting community input on an issue, and for documenting the design decisions that have gone into Python. The PEP author is responsible for building consensus within the community and documenting dissenting opinions.
el: Τα PEP προορίζονται να είναι οι κύριοι μηχανισμοί για την πρόταση σημαντικών νέων χαρακτηριστικών, για τη συλλογή πληροφοριών της κοινότητας για ένα ζήτημα και για την τεκμηρίωση των αποφάσεων σχεδιασμού που έχουν εισαχθεί στην Python. Ο συγγραφέας του PEP είναι υπεύθυνος για την οικοδόμηση συναίνεσης εντός της κοινότητας και την τεκμηρίωση αντίθετων απόψεων.

source: See :pep:`1`.
el: Βλ. :pep:`1`.

source: portion
el: τμήμα

source: A set of files in a single directory (possibly stored in a zip file) that contribute to a namespace package, as defined in :pep:`420`.
el: Ένα σύνολο από αρχεία σε έναν μόνο κατάλογο (ενδεχομένως αποθηκευμένο σε αρχείο *zip*) που συμβάλλουν σε ένα namespace πακέτο, όπως ορίζεται στο :pep:`420`.

source: positional argument
el: όρισμα θέσης

source: A provisional API is one which has been deliberately excluded from the standard library's backwards compatibility guarantees. While major changes to such interfaces are not expected, as long as they are marked provisional, backwards incompatible changes (up to and including removal of the interface) may occur if deemed necessary by core developers. Such changes will not be made gratuitously -- they will occur only if serious fundamental flaws are uncovered that were missed prior to the inclusion of the API.
el: Ένα provisional API είναι αυτό που έχει εσκεμμένα εξαιρεθεί από τις backwards εγγυήσεις συμβατότητας της τυπικής βιβλιοθήκης. Αν και δεν αναμένονται σημαντικές αλλαγές σε τέτοιες διεπαφές, εφόσον επισημαίνονται ως προσωρινές, αλλαγές μη backwards συμβατότητας (μέχρι και κατάργηση της διεπαφής) μπορεί να προκύψουν εάν κριθεί απαραίτητο από τους βασικούς προγραμματιστές. Τέτοιες αλλαγές δεν θα γίνουν άσκοπα -- θα συμβούν μόνο εάν αποκαλυφθούν σοβαρά θεμελιώδη ελαττώματα που παραλείφθηκαν πριν από τη συμπερίληψη του API.

source: Even for provisional APIs, backwards incompatible changes are seen as a "solution of last resort" - every attempt will still be made to find a backwards compatible resolution to any identified problems.
el: Ακόμη και για provisional API, οι μη backwards συμβατές αλλαγές θεωρούνται "λύση έσχατης ανάγκης"- θα εξακολουθεί να γίνεται κάθε προσπάθεια για να βρεθεί μια λύση backwards συμβατή σε τυχόν εντοπισμένα προβλήματα.

source: This process allows the standard library to continue to evolve over time, without locking in problematic design errors for extended periods of time. See :pep:`411` for more details.
el: Αυτή η διαδικασία επιτρέπει στην τυπική βιβλιοθήκη να συνεχίσει να εξελίσσεται με την πάροδο του χρόνου, χωρίς να κλειδώνει προβληματικά σφάλματα σχεδιασμού για εκτεταμένες χρονικές περιόδους. Βλ. :pep:`411` για περισσότερες λεπτομέρειες.

source: provisional package
el: provisional πακέτο

source: See :term:`provisional API`.
el: Βλ. :term:`provisional API`.

source: Nickname for the Python 3.x release line (coined long ago when the release of version 3 was something in the distant future.) This is also abbreviated "Py3k".
el: Ψευδώνυμο για το σύνολο εκδόσεων Python 3.x (επινοήθηκε πριν από πολύ καιρό όταν η κυκλοφορία της έκδοσης 3 ήταν κάτι στο μακρινό μέλλον.) Αυτό ονομάζεται επίσης ως συντομογραφία "Py3k".

source: An idea or piece of code which closely follows the most common idioms of the Python language, rather than implementing code using concepts common to other languages. For example, a common idiom in Python is to loop over all elements of an iterable using a :keyword:`for` statement. Many other languages don't have this type of construct, so people unfamiliar with Python sometimes use a numerical counter instead::
el: Μια ιδέα ή ένα κομμάτι κώδικα που ακολουθεί πιστά τα πιο κοινά ιδιώματα της γλώσσας Python, αντί να υλοποιεί κώδικα χρησιμοποιώντας έννοιες κοινές σε άλλες γλώσσες. Για παράδειγμα, ένα κοινό ιδίωμα στην Python είναι να κάνει μια επανάληψη πάνω από όλα τα στοιχεία ενός iterable χρησιμοποιώντας μια δήλωση :keyword:`for`. Πολλές άλλες γλώσσες που δεν έχουν αυτόν τον τύπο κατασκευής, έτσι οι άνθρωποι που δεν είναι εξοικειωμένοι με την Python χρησιμοποιούν μερικές φορές έναν αριθμητικό μετρητή::

source: As opposed to the cleaner, Pythonic method::
el: Αντίθετα, μια πιο καθαρή μέθοδος Pythonic::

source: qualified name
el: αναγνωρισμένο όνομα

source: A dotted name showing the "path" from a module's global scope to a class, function or method defined in that module, as defined in :pep:`3155`. For top-level functions and classes, the qualified name is the same as the object's name::
el: Ένα όνομα με κουκκίδες που δείχνει τη "διαδρομή" από το καθολικό εύρος ενός module σε μια κλάση, συνάρτηση ή μέθοδο που ορίζεται σε αυτήν την ενότητα, όπως ορίζεται στο :pep:`3155`. Για συναρτήσεις και κλάσεις ανώτατου επιπέδου, το αναγνωρισμένο όνομα είναι ίδιο με το όνομα του αντικειμένου::

source: When used to refer to modules, the *fully qualified name* means the entire dotted path to the module, including any parent packages, e.g. ``email.mime.text``::
el: Όταν χρησιμοποιείται για αναφορά σε modules , το *πλήρως αναγνωρισμένο όνομα* σημαίνει ολόκληρο το διακεκομμένο path προς το module, συμπεριλαμβανομένων τυχόν γονικών πακέτων π.χ. ``email.mime.text``::

source: reference count
el: πλήθος αναφοράς

source: The number of references to an object. When the reference count of an object drops to zero, it is deallocated. Some objects are :term:`immortal` and have reference counts that are never modified, and therefore the objects are never deallocated. Reference counting is generally not visible to Python code, but it is a key element of the :term:`CPython` implementation. Programmers can call the :func:`sys.getrefcount` function to return the reference count for a particular object.
el: Ο αριθμός των αναφορών σε ένα αντικείμενο. Όταν το πλήθος αναφορών ενός αντικειμένου πέσει στο μηδέν, κατανέμεται. Μερικά αντικείμενα είναι :term:`immortal` και έχουν πλήθος αναφορών που δεν τροποποιούνται ποτέ και επομένως τα αντικείμενα δεν κατανέμονται ποτέ. Η καταμέτρηση αναφορών γενικά δεν είναι ορατή στον κώδικα της Python, αλλά είναι βασικό στοιχείο της υλοποίησης :term:`CPython`. Οι προγραμματιστές μπορούν να καλέσουν τη συνάρτηση :func:`sys.getrefcount` για να επιστρέψουν το πλήθος αναφοράς για ένα συγκεκριμένο αντικείμενο.

source: regular package
el: κανονικό πακέτο

source: A traditional :term:`package`, such as a directory containing an ``__init__.py`` file.
el: Ένα παραδοσιακό :term:`package`, όπως ένας κατάλογος που περιέχει ένα ``__init__.py`` αρχείο.

source: See also :term:`namespace package`.
el: Βλ. επίσης :term:`namespace package`.

source: An acronym for the "read–eval–print loop", another name for the :term:`interactive` interpreter shell.
el: Ακρωνύμιο του "read–eval–print loop", άλλη ονομασία για το :term:`interactive` περιβάλλον του διερμηνέα.

source: A declaration inside a class that saves memory by pre-declaring space for instance attributes and eliminating instance dictionaries. Though popular, the technique is somewhat tricky to get right and is best reserved for rare cases where there are large numbers of instances in a memory-critical application.
el: Μια δήλωση μέσα σε μια κλάση που εξοικονομεί μνήμη δηλώνοντας εκ των προτέρων χώρο για παράδειγμα χαρακτηριστικά και εξαλείφοντας λεξικά στιγμιοτύπων. Αν και δημοφιλής, η τεχνική είναι κάπως δύσκολο να γίνει σωστή και προορίζεται καλύτερα για σπάνιες περιπτώσεις όπου υπάρχει μεγάλος αριθμός στιγμιοτύπων σε μια εφαρμογή κρίσιμης-μνήμης.

source: sequence
el: ακολουθία

source: An :term:`iterable` which supports efficient element access using integer indices via the :meth:`~object.__getitem__` special method and defines a :meth:`~object.__len__` method that returns the length of the sequence. Some built-in sequence types are :class:`list`, :class:`str`, :class:`tuple`, and :class:`bytes`. Note that :class:`dict` also supports :meth:`~object.__getitem__` and :meth:`!__len__`, but is considered a mapping rather than a sequence because the lookups use arbitrary :term:`hashable` keys rather than integers.
el: Ένας :term:`iterable` που υποστηρίζει την αποτελεσματική πρόσβαση στο στοιχείο χρησιμοποιώντας ακέραιους δείκτες μέσω της ειδική μεθόδου :meth:`~object.__getitem__` και ορίζει μια μέθοδο :meth:`~object.__len__` που επιστρέφει το μήκος της ακολουθίας. Ορισμένοι ενσωματωμένοι τύποι ακολουθιών είναι :class:`list`, :class:`str`, :class:`tuple`, και :class:`bytes`. Σημειώστε ότι το :class:`dict` υποστηρίζει επίσης :meth:`~object.__getitem__` και :meth:`!__len__`, αλλά θεωρείται αντιστοίχιση και όχι ακολουθία επειδή οι αναζητήσεις χρησιμοποιούν αυθαίρετα :term:`hashable` κλειδιά παρά ακέραιοι.

source: The :class:`collections.abc.Sequence` abstract base class defines a much richer interface that goes beyond just :meth:`~object.__getitem__` and :meth:`~object.__len__`, adding :meth:`!count`, :meth:`!index`, :meth:`~object.__contains__`, and :meth:`~object.__reversed__`. Types that implement this expanded interface can be registered explicitly using :func:`~abc.ABCMeta.register`. For more documentation on sequence methods generally, see :ref:`Common Sequence Operations <typesseq-common>`.
el: Η αφηρημένη βασική κλάση :class:`collections.abc.Sequence` ορίζει μια πολύ πιο πλούσια διεπαφή που ξεπερνά τα απλά :meth:`~object.__getitem__` και :meth:`~object.__len__`, adding :meth:`!count`, :meth:`!index`, :meth:`~object.__contains__`, και :meth:`~object.__reversed__`. Οι τύποι που υλοποιούν αυτήν την διευρυμένη διεπαφή μπορούν να καταχωρηθούν ρητά χρησιμοποιώντας :func:`~abc.ABCMeta.register`. Για περισσότερη τεκμηρίωση σχετικά με τις μεθόδους ακολουθίας γενικά, ανατρέξτε στο :ref:`Common Sequence Operations <typesseq-common>`.

source: A compact way to process all or part of the elements in an iterable and return a set with the results. ``results = {c for c in 'abracadabra' if c not in 'abc'}`` generates the set of strings ``{'r', 'd'}``. See :ref:`comprehensions`.
el: Ένας συμπαγής τρόπος για να επεξεργαστείτε όλα ή μέρος των στοιχείων σε ένα iterable και να επιστραφεί ένα σύνολο με τα αποτελέσματα. ``results = {c for c in 'abracadabra' if c not in 'abc'}`` δημιουργεί το σύνολο συμβολοσειρών ``{'r', 'd'}``. Βλ. :ref:`comprehensions`.

source: single dispatch
el: μοναδικό dispatch

source: A form of :term:`generic function` dispatch where the implementation is chosen based on the type of a single argument.
el: Μια μορφή dispatch :term:`generic function` όπου η υλοποίηση επιλέγεται με βάση τον τύπο ενός μεμονωμένου ορίσματος.

source: An object usually containing a portion of a :term:`sequence`. A slice is created using the subscript notation, ``[]`` with colons between numbers when several are given, such as in ``variable_name[1:3:5]``. The bracket (subscript) notation uses :class:`slice` objects internally.
el: Ένα αντικείμενο που συνήθως περιέχει ένα τμήμα μιας ακολουθίας :term:`sequence`. Δημιουργείται ένα slice χρησιμοποιώντας τη σημείωση subscript, ``[]`` με άνω και κάτω τελείες μεταξύ αριθμών όταν δίνονται πολλοί, όπως στο ``variable_name[1:3:5]``. Η σημείωση αγκύλης (subscript) χρησιμοποιεί εσωτερικά αντικείμενα :class:`slice`.

source: soft deprecated
el: απαρχαιωμένη με ήπιο τρόπο

source: A soft deprecated API should not be used in new code, but it is safe for already existing code to use it. The API remains documented and tested, but will not be enhanced further.
el: Ένα απαρχαιωμένο με ήπιο τρόπο API δεν θα πρέπει να χρησιμοποιείται σε νέο κώδικα, αλλά είναι ασφαλές σε ήδη υπάρχοντα κώδικα να το χρησιμοποιεί. Το API παραμένει τεκμηριωμένο και δοκιμασμένο, αλλά δεν θα ενισχυθεί περαιτέρω.

source: Soft deprecation, unlike normal deprecation, does not plan on removing the API and will not emit warnings.
el: Η κατάργηση με ήπιο τρόπο, σε αντίθεση με την κανονική κατάργηση, δεν σχεδιάζει την κατάργηση του API και δεν θα εκπέμπει ειδοποιήσεις

source: See `PEP 387: Soft Deprecation <https://peps.python.org/pep-0387/#soft-deprecation>`_.
el: Δείτε `PEP 387: Soft Deprecation <https://peps.python.org/pep-0387/#soft-deprecation>`_.

source: special method
el: ειδική μέθοδος

source: A method that is called implicitly by Python to execute a certain operation on a type, such as addition. Such methods have names starting and ending with double underscores. Special methods are documented in :ref:`specialnames`.
el: Μια μέθοδος που καλείται σιωπηρά από την Python για να εκτελέσει μια συγκεκριμένη λειτουργία σε έναν τύπο, όπως η προσθήκη. Τέτοιες μέθοδοι έχουνε ονόματα που ξεκινούν και τελειώνουν με διπλές κάτω παύλες. Οι ειδικές μέθοδοι τεκμηριώνονται στο :ref:`specialnames`.

source: statement
el: δήλωση

source: A statement is part of a suite (a "block" of code). A statement is either an :term:`expression` or one of several constructs with a keyword, such as :keyword:`if`, :keyword:`while` or :keyword:`for`.
el: Μια πρόταση είναι μέρος μιας σουίτας (ένα "μπλοκ" κώδικα). Μια πρόταση είναι είτε ένας :term:`expression` είτε μια από πολλές δομές με μια λέξη-κλειδί όπως :keyword:`if`, :keyword:`while` ή :keyword:`for`.

source: static type checker
el: ελεγκτής στατικού τύπου

source: An external tool that reads Python code and analyzes it, looking for issues such as incorrect types. See also :term:`type hints <type hint>` and the :mod:`typing` module.
el: Ένα εξωτερικό εργαλείο όπου διαβάζει τον Python κώδικα και τον αναλύει, αναζητώντας προβλήματα όπως λανθασμένοι τύποι. Βλ. επίσης :term:`type hints <type hint>` και το module :mod:`typing`.

source: In Python's C API, a strong reference is a reference to an object which is owned by the code holding the reference. The strong reference is taken by calling :c:func:`Py_INCREF` when the reference is created and released with :c:func:`Py_DECREF` when the reference is deleted.
el: Στο C API της Python, μια ισχυρή αναφορά είναι μια αναφορά σε ένα αντικείμενο που ανήκει στον κώδικα που περιέχει την αναφορά. Η ισχυρή αναφορά λαμβάνεται καλώντας το :c:func:`Py_INCREF` όταν η αναφορά δημιουργείται και απελευθερώνεται με :c:func:`Py_DECREF` όταν διαγραφεί η αναφορά.

source: The :c:func:`Py_NewRef` function can be used to create a strong reference to an object. Usually, the :c:func:`Py_DECREF` function must be called on the strong reference before exiting the scope of the strong reference, to avoid leaking one reference.
el: Η συνάρτηση :c:func:`Py_NewRef` μπορεί να χρησιμοποιηθεί για τη δημιουργία ισχυρής αναφοράς σε ένα αντικείμενο. Συνήθως, η συνάρτηση :c:func:`Py_DECREF` πρέπει να καλείται στην ισχυρή αναφορά πριν βγει από το εύρος της ισχυρής αναφοράς, για να αποφευχθεί η διαρροή μιας αναφοράς.

source: See also :term:`borrowed reference`.
el: Βλ. επίσης :term:`borrowed reference`.

source: text encoding
el: κωδικοποίηση κειμένου

source: A string in Python is a sequence of Unicode code points (in range ``U+0000``--``U+10FFFF``). To store or transfer a string, it needs to be serialized as a sequence of bytes.
el: Μια συμβολοσειρά στην Python είναι μια ακολουθία σημείων κώδικα Unicode (στο εύρος ``U+0000``--``U+10FFFF``). Για να αποθηκεύσετε ή να μεταφέρετε μια συμβολοσειρά, πρέπει να σειριοποιηθεί ως δυαδική ακολουθία.

source: Serializing a string into a sequence of bytes is known as "encoding", and recreating the string from the sequence of bytes is known as "decoding".
el: Η σειριοποίηση μιας συμβολοσειράς σε μια δυαδική ακολουθία είναι γνωστή ως "κωδικοποίηση" , και η αναδημιουργία της συμβολοσειράς από την δυαδική ακολουθία είναι γνωστή ως "αποκωδικοποίηση".

source: There are a variety of different text serialization :ref:`codecs <standard-encodings>`, which are collectively referred to as "text encodings".
el: Υπάρχει μια ποικιλία διαφορετικής σειριοποίησης κειμένου :ref:`codecs <standard-encodings>`, οι οποίοι συλλογικά αναφέρονται ως "κωδικοποιήσεις κειμένου".

source: text file
el: αρχείο κειμένου

source: A :term:`file object` able to read and write :class:`str` objects. Often, a text file actually accesses a byte-oriented datastream and handles the :term:`text encoding` automatically. Examples of text files are files opened in text mode (``'r'`` or ``'w'``), :data:`sys.stdin`, :data:`sys.stdout`, and instances of :class:`io.StringIO`.
el: Ένα :term:`file object` ικανό να διαβάζει και να γράφει αντικείμενα :class:`str`. Συχνά, ένα αρχείο κειμένου αποκτά πραγματικά πρόσβαση σε μια ροή δυαδική ροή δεδομένων και χειρίζεται αυτόματα την :term:`text encoding`. Παραδείγματα αρχείων κειμένου είναι αρχεία που ανοίγουν σε λειτουργία κειμένου (``'r'`` ή ``'w'``), :data:`sys.stdin`, :data:`sys.stdout`, και στιγμιότυπα του :class:`io.StringIO`.
