Repository: thepetk/python-docs-gr
Catalog: glossary.po
Languages: el

source: See also :term:`binary file` for a file object able to read and write :term:`bytes-like objects <bytes-like object>`.
el: Βλ. επίσης :term:`binary file` για ένα αντικείμενο αρχείου με δυνατότητα ανάγνωσης και εγγραφής :term:`δυαδικά αντικείμενα <bytes-like object>`.

source: thread state
el: κατάσταση νήματος

source: The information used by the :term:`CPython` runtime to run in an OS thread. For example, this includes the current exception, if any, and the state of the bytecode interpreter.
el: Οι πληροφορίες που χρησιμοποιούνται από τη ροή εκτέλεσης της :term:`CPython` για την εκτέλεση σε ένα νήμα λειτουργικού συστήματος. Για παράδειγμα, αυτό περιλαμβάνει την τρέχουσα εξαίρεση, εάν υπάρχει, και την κατάσταση του διερμηνέα bytecode.

source: Each thread state is bound to a single OS thread, but threads may have many thread states available. At most, one of them may be :term:`attached <attached thread state>` at once.
el: Κάθε κατάσταση νήματος είναι συνδεδεμένη με ένα μόνο νήμα λειτουργικού συστήματος, αλλά τα νήματα μπορεί να έχουν πολλές διαθέσιμες καταστάσεις νήματος. Το πολύ, μία από αυτές μπορεί να είναι :term:`attached <attached thread state>` ταυτόχρονα.

source: An :term:`attached thread state` is required to call most of Python's C API, unless a function explicitly documents otherwise. The bytecode interpreter only runs under an attached thread state.
el: Απαιτείται ένα :term:`attached thread state` για την κλήση του μεγαλύτερου μέρους του C API της Python, εκτός εάν μια συνάρτηση τεκμηριώνεται ρητά από το αντίθετο. Ο διερμηνέας bytecode εκτελείται μόνο υπό κατάσταση συνημμένου νήματος.

source: Each thread state belongs to a single interpreter, but each interpreter may have many thread states, including multiple for the same OS thread. Thread states from multiple interpreters may be bound to the same thread, but only one can be :term:`attached <attached thread state>` in that thread at any given moment.
el: Κάθε κατάσταση νήματος ανήκει σε έναν μόνο διερμηνέα, αλλά κάθε διερμηνέα μπορεί να έχει πολλές καταστάσεις νήματος, συμπεριλαμβανομένων πολλαπλών για το ίδιο νήμα λειτουργικού συστήματος. Οι καταστάσεις νήματος από πολλαπλούς διερμηνείς μπορεί να είναι συνδεδεμένος με το ίδιο νήμα, αλλά μόνο μία μπορεί να είναι :term:`attached <attached thread state>` σε αυτό το νήμα σε οποιαδήποτε δεδομένη στιγμή.

source: See :ref:`Thread State and the Global Interpreter Lock <threads>` for more information.
el: Δείτε το :ref:`Thread State and the Global Interpreter Lock <threads>` για περισσότερες πληροφορίες.

source: token
el: λεκτικό σύμβολο (token)

source: A small unit of source code, generated by the :ref:`lexical analyzer <lexical>` (also called the *tokenizer*). Names, numbers, strings, operators, newlines and similar are represented by tokens.
el: Μια μικρή μονάδα πηγαίου κώδικα, που παράγεται από τον :ref:`lexical analyzer <lexical>` (γνωστό και ως *αναλυτή (tokenizer)*). Ονόματα, αριθμοί, συμβολοσειρές, τελεστές αλλαγές γραμμής και παρόμοια στοιχεία αναπαρίστανται ως λεκτικά σύμβολα (tokens).

source: The :mod:`tokenize` module exposes Python's lexical analyzer. The :mod:`token` module contains information on the various types of tokens.
el: Το module :mod:`tokenize` εκθέτει τον λεξικό αναλυτή της Python. Το module :mod:`token` περιέχει πληροφορίες για τους διάφορους τύπους λεκτικών συμβόλων (tokens).

source: triple-quoted string
el: συμβολοσειρά τριπλών εισαγωγικών

source: A string which is bound by three instances of either a quotation mark (") or an apostrophe ('). While they don't provide any functionality not available with single-quoted strings, they are useful for a number of reasons. They allow you to include unescaped single and double quotes within a string and they can span multiple lines without the use of the continuation character, making them especially useful when writing docstrings.
el: Μια συμβολοσειρά που δεσμεύεται από τρεις περιπτώσεις είτε ενός εισαγωγικού (") ή μιας αποστρόφου ('). Αν και δεν παρέχουν καμία λειτουργικότητα που δεν είναι διαθέσιμη με συμβολοσειρές με μονά εισαγωγικά, είναι χρήσιμες για διαφόρους λόγους. Σας επιτρέπουν να συμπεριλάβετε μονά και διπλά εισαγωγικά χωρίς διαφυγή σε μια συμβολοσειρά και μπορούν να εκτείνονται σε πολλές γραμμές χωρίς τη χρήση του χαρακτήρα συνέχεια, καθιστώντας τα ιδιαίτερα χρήσιμα κατά τη σύνταξη εγγράφων με συμβολοσειρές.

source: type
el: τύπος

source: The type of a Python object determines what kind of object it is; every object has a type. An object's type is accessible as its :attr:`~object.__class__` attribute or can be retrieved with ``type(obj)``.
el: Ο τύπος ενός Python αντικειμένου καθορίζει τι είδους αντικείμενο είναι∙ κάθε αντικείμενο έχει έναν τύπο. Ο τύπος ενός αντικειμένου είναι προσβάσιμος ως το χαρακτηριστικό :attr:`~object.__class__` ή μπορεί να ανακτηθεί με ``type(obj)``.

source: A synonym for a type, created by assigning the type to an identifier.
el: Ένα συνώνυμο για έναν τύπο, που δημιουργείται με την ανάθεση τύπου σε ένα αναγνωριστικό.

source: Type aliases are useful for simplifying :term:`type hints <type hint>`. For example::
el: Τα type aliases είναι χρήσιμα για την απλοποίηση :term:`type alias <type hint>`. Για παράδειγμα::

source: could be made more readable like this::
el: μπορεί να γίνει πιο ευανάγνωστο όπως::

source: See :mod:`typing` and :pep:`484`, which describe this functionality.
el: Βλ. :mod:`typing` και :pep:`484`, που περιγράφει αυτήν την λειτουργικότητα.

source: An :term:`annotation` that specifies the expected type for a variable, a class attribute, or a function parameter or return value.
el: Ένας :term:`annotation` που καθορίζει τον αναμενόμενο τύπο για μια μεταβλητή, ένα χαρακτηριστικό κλάσης ή μια παράμετρο συνάρτησης ή τιμή επιστροφής.

source: Type hints are optional and are not enforced by Python but they are useful to :term:`static type checkers <static type checker>`. They can also aid IDEs with code completion and refactoring.
el: Οι υποδείξεις τύπων (type hints) είναι προαιρετικές και δεν επιβάλλονται από την Python, αλλά είναι χρήσιμες για :term:`static type checkers <static type checker>`. Μπορούν επίσης να βοηθήσουν τους IDEs με τη συμπλήρωση και την αναδιαμόρφωση κώδικα.

source: Type hints of global variables, class attributes, and functions, but not local variables, can be accessed using :func:`typing.get_type_hints`.
el: Υποδείξεις τύπου (type hints) για καθολικές μεταβλητές, χαρακτηριστικά κλάσης και συναρτήσεις , αλλά όχι τοπικές μεταβλητές, μπορούν να προσπελαστούν χρησιμοποιώντας το :func:`typing.get_type_hints`.

source: universal newlines
el: καθολικές νέες γραμμές

source: A manner of interpreting text streams in which all of the following are recognized as ending a line: the Unix end-of-line convention ``'\n'``, the Windows convention ``'\r\n'``, and the old Macintosh convention ``'\r'``. See :pep:`278` and :pep:`3116`, as well as :func:`bytes.splitlines` for an additional use.
el: Ένα τρόπος ερμηνείας ροών κειμένου στον οποίο όλα τα ακόλουθα αναγνωρίζονται ως λήξεις μιας γραμμής: η σύμβαση τέλους γραμμής του Unix ``'\n'``, η σύμβαση των Windows ``'\r\n'``, και την παλιά σύμβαση Macintosh ``'\r'``. Βλ. :pep:`278` και :pep:`3116`, καθώς και :func:`bytes.splitlines` για πρόσθετη χρήση.

source: variable annotation
el: annotation μεταβλητής

source: An :term:`annotation` of a variable or a class attribute.
el: Ένας :term:`annotation` μια μεταβλητής ή ενός χαρακτηριστικού κλάσης.

source: When annotating a variable or a class attribute, assignment is optional::
el: Όταν annotating μια μεταβλητή ή ένα χαρακτηριστικό κλάσης, η ανάθεση είναι προαιρετική::

source: Variable annotations are usually used for :term:`type hints <type hint>`: for example this variable is expected to take :class:`int` values::
el: Τα annotations μεταβλητών χρησιμοποιούνται συνήθως για :term:`type hints <type hint>`: για παράδειγμα αυτή η μεταβλητή αναμένεται να λάβει τιμές :class:`int`::

source: Variable annotation syntax is explained in section :ref:`annassign`.
el: Η σύνταξη annotation μεταβλητής περιγράφεται στην ενότητα :ref:`annassign`.

source: See :term:`function annotation`, :pep:`484` and :pep:`526`, which describe this functionality. Also see :ref:`annotations-howto` for best practices on working with annotations.
el: Βλ. :term:`function annotation`, :pep:`484` και :pep:`526`, που περιγράφουν αυτή τη λειτουργία. Δείτε επίσης :ref:`annotations-howto` για βέλτιστες πρακτικές σχετικά με την εργασία με σχολιασμούς.

source: A cooperatively isolated runtime environment that allows Python users and applications to install and upgrade Python distribution packages without interfering with the behaviour of other Python applications running on the same system.
el: Ένα συνεργατικά απομονωμένο περιβάλλον χρόνου εκτέλεσης που επιτρέπει στους χρήστες και τις εφαρμογές της Python να εγκαταστήσουν και να αναβαθμίσουν πακέτα διανομής Python χωρίς να παρεμβαίνουν στη συμπεριφορά άλλων εφαρμογών Python που εκτελούνται στο ίδιο σύστημα.

source: See also :mod:`venv`.
el: Βλ. επίσης :mod:`venv`.

source: A computer defined entirely in software. Python's virtual machine executes the :term:`bytecode` emitted by the bytecode compiler.
el: Ένας υπολογιστής ορίζεται εξ ολοκλήρου από το λογισμικό. Η εικονική μηχανή της Python εκτελεί το :term:`bytecode` που εκπέμπεται από τον μεταγλωττιστή bytecode.

source: Zen of Python
el: Zen της Python

source: Listing of Python design principles and philosophies that are helpful in understanding and using the language. The listing can be found by typing "``import this``" at the interactive prompt.
el: Κατάλογος σχεδιαστικών αρχών και φιλοσοφιών που είναι χρήσιμες για την κατανόηση και τη χρήση της γλώσσας. Ο κατάλογος μπορεί να βρεθεί πληκτρολογώντας "``import this``" στην διαδραστική κονσόλα.
