Repository: thepetk/python-docs-gr
Catalog: glossary.po
Languages: el

source: Glossary
el: Γλωσσάρι

source: The default Python prompt of the :term:`interactive` shell. Often seen for code examples which can be executed interactively in the interpreter.
el: Η προεπιλεγμένη Python εντολή του :term:`interactive` shell. Συχνά εμφανίζεται για παραδείγματα κώδικα που μπορούν να εκτελεστούν διαδραστικά στον interpreter.

source: Can refer to:
el: Μπορεί να αναφέρεται σε:

source: The default Python prompt of the :term:`interactive` shell when entering the code for an indented code block, when within a pair of matching left and right delimiters (parentheses, square brackets, curly braces or triple quotes), or after specifying a decorator.
el: Η προεπιλεγμένη Python εντολή του :term:`interactive` shell κατά την εισαγωγή του κώδικα για ένα μπλοκ κώδικα με εσοχή, όταν βρίσκεται μέσα σε ένα ζεύγος ταιριασμένων αριστερών και δεξιών delimiters (παρενθέσεις, αγκύλες, άγκιστρα ή τριπλά εισαγωγικά), ή μετά τον καθορισμό ενός decorator.

source: The :const:`Ellipsis` built-in constant.
el: Η ενσωματωμένη σταθερά :const:`Ellipsis`.

source: abstract base class
el: αφηρημένη βασική κλάση

source: Abstract base classes complement :term:`duck-typing` by providing a way to define interfaces when other techniques like :func:`hasattr` would be clumsy or subtly wrong (for example with :ref:`magic methods <special-lookup>`). ABCs introduce virtual subclasses, which are classes that don't inherit from a class but are still recognized by :func:`isinstance` and :func:`issubclass`; see the :mod:`abc` module documentation. Python comes with many built-in ABCs for data structures (in the :mod:`collections.abc` module), numbers (in the :mod:`numbers` module), streams (in the :mod:`io` module), import finders and loaders (in the :mod:`importlib.abc` module). You can create your own ABCs with the :mod:`abc` module.
el: Οι αφηρημένες βασικές κλάσεις συμπληρώνουν το :term:`duck-typing` παρέχοντας έναν τρόπο ορισμού interfaces όταν άλλες τεχνικές όπως η :func:`hasattr` θα ήταν αδέξιες ή ανεπαίσθητα λανθασμένες (για παράδειγμα με :ref:`magic methods <special-lookup>`). Τα ABC (abstract base class) εισάγουν εικονικές υποκλάσεις, οι οποίες είναι κλάσεις που δεν κληρονομούνται από μια κλάση, αλλά εξακολουθούν να αναγνωρίζονται από το :func:`isinstance` και από το :func:`issubclass`' βλ. την τεκμηρίωση του module :mod:`abc`. Η Python διαθέτει πολλά ενσωματωμένα ABC για δομές δεδομένων (στο module :mod:`collections.abc`), αριθμούς (στο module :mod:`numbers`), ροές (στο module μονάδα :mod:`io`), εισαγωγή finders και loaders (στο module :mod:`importlib.abc`). Μπορείτε να δημιουργήσετε τα δικά σας ABC με το module :mod:`abc`.

source: annotate function
el: συνάρτηση annotate

source: A function that can be called to retrieve the :term:`annotations <annotation>` of an object. This function is accessible as the :attr:`~object.__annotate__` attribute of functions, classes, and modules. Annotate functions are a subset of :term:`evaluate functions <evaluate function>`.
el: Μια συνάρτηση που μπορεί να κληθεί για να ανακτήσει το :term:`annotations <annotation>` ενός αντικειμένου. Αυτή η συνάρτηση είναι προσβάσιμη ως το χαρακτηριστικό :attr:`~object.__annotate__` των συναρτήσεων, των κλάσεων και των modules. Οι συναρτήσεις annotate είναι ένα υποσύνολο του :term:`evaluate functions <evaluate function>`.

source: A label associated with a variable, a class attribute or a function parameter or return value, used by convention as a :term:`type hint`.
el: Μια ετικέτα που σχετίζεται με μια μεταβλητή, ένα χαρακτηριστικό κλάσης ή μια παράμετρος συνάρτησης ή τιμή που επιστρέφεται, που χρησιμοποιείται κατά σύμβαση ως :term:`type hint`.

source: Annotations of local variables cannot be accessed at runtime, but annotations of global variables, class attributes, and functions can be retrieved by calling :func:`annotationlib.get_annotations` on modules, classes, and functions, respectively.
el: Δεν είναι δυνατή η πρόσβαση στα annotations των τοπικών μεταβλητών κατά το χρόνο εκτέλεσης, αλλά τα annotations των global μεταβλητών, των χαρακτηριστικών κλάσης και των συναρτήσεων μπορούν να ανακτηθούν καλώντας την εντολή :func:`annotationlib.get_annotations` σε modules, κλάσεις και συναρτήσεις, αντίστοιχα.

source: See :term:`variable annotation`, :term:`function annotation`, :pep:`484`, :pep:`526`, and :pep:`649`, which describe this functionality. Also see :ref:`annotations-howto` for best practices on working with annotations.
el: Βλ. τα :term:`variable annotation`, :term:`function annotation`, :pep:`484`, :pep:`526` και :pep:`649`, τα οποία περιγράφουν την λειτουργικότητα. Δείτε επίσης τα :ref:`annotations-howto` για τις βέλτιστες πρακτικές δουλεύοντας με annotations.

source: argument
el: όρισμα

source: A value passed to a :term:`function` (or :term:`method`) when calling the function. There are two kinds of argument:
el: Μια τιμή μεταβιβάζεται σε μία :term:`function` (ή :term:`method`) κατά την κλήση της συνάρτησης. Υπάρχουν δύο είδη ορισμάτων:

source: :dfn:`keyword argument`: an argument preceded by an identifier (e.g. ``name=``) in a function call or passed as a value in a dictionary preceded by ``**``. For example, ``3`` and ``5`` are both keyword arguments in the following calls to :func:`complex`::
el: :dfn:`keyword argument`: ένα όρισμα πριν από ένα αναγνωριστικό (π.χ. ``name=``) σε μια κλήση συνάρτησης ή περνώντας το ως τιμή σε ένα λεξικό πριν από ``**``. Για παράδειγμα, το ``3`` και το ``5`` αποτελούν ορίσματα λέξεων-κλειδιών στις ακόλουθες κλήσεις προς :func:`complex`::

source: :dfn:`positional argument`: an argument that is not a keyword argument. Positional arguments can appear at the beginning of an argument list and/or be passed as elements of an :term:`iterable` preceded by ``*``. For example, ``3`` and ``5`` are both positional arguments in the following calls::
el: :dfn:`positional argument`: ένα όρισμα που δεν είναι όρισμα keyword. Τα ορίσματα θέσης μπορούν να εμφανίζονται στην αρχής μιας λίστας ορισμάτων ή/και να μεταβιβάζονται ως στοιχεία ενός :term:`iterable` πριν από ``*``. Για παράδειγμα, το ``3`` και το ``5`` αποτελούν ορίσματα θέσης στις παρακάτω κλήσεις::

source: Arguments are assigned to the named local variables in a function body. See the :ref:`calls` section for the rules governing this assignment. Syntactically, any expression can be used to represent an argument; the evaluated value is assigned to the local variable.
el: Τα ορίσματα εκχωρούνται στις ονομασμένες τοπικές μεταβλητές στο σώμα μια συνάρτησης. Βλ. την ενότητα :ref:`calls` για τους κανόνες που διέπουν αυτήν την εκχώρηση. Συντακτικά, οποιαδήποτε έκφραση μπορεί να χρησιμοποιηθεί για να αναπαραστήσει ένα όρισμα' η αξιολογούμενη τιμή εκχωρείται σε μια τοπική μεταβλητή.

source: See also the :term:`parameter` glossary entry, the FAQ question on :ref:`the difference between arguments and parameters <faq-argument-vs-parameter>`, and :pep:`362`.
el: Βλ. επίσης την εγγραφή του γλωσσαρίου για το :term:`parameter`, την FAQ ερώτηση στο :ref:`η διαφορά μεταξύ ορισμάτων και παραμέτρων <faq-argument-vs-parameter>`, και :pep:`362`.

source: asynchronous context manager
el: ασύγχρονος διαχειριστής context

source: An object which controls the environment seen in an :keyword:`async with` statement by defining :meth:`~object.__aenter__` and :meth:`~object.__aexit__` methods. Introduced by :pep:`492`.
el: Ένα αντικείμενο που ελέγχει το ορατό περιβάλλον σε μια δήλωση :keyword:`async with` ορίζοντας τις μεθόδους :meth:`~object.__aenter__` και :meth:`~object.__aexit__`. Που εισήχθη από :pep:`492`.

source: asynchronous generator
el: ασύγχρονος generator

source: A function which returns an :term:`asynchronous generator iterator`. It looks like a coroutine function defined with :keyword:`async def` except that it contains :keyword:`yield` expressions for producing a series of values usable in an :keyword:`async for` loop.
el: Μια συνάρτηση που επιστρέφει έναν :term:`asynchronous generator iterator`. Μοιάζει με μια συνάρτηση coroutine που ορίζεται με :keyword:`async def` εκτός από ότι περιέχει εκφράσεις :keyword:`yield` για την παραγωγή μιας σειράς τιμών που μπορούν να χρησιμοποιηθούν σε έναν :keyword:`async for` βρόχο.

source: Usually refers to an asynchronous generator function, but may refer to an *asynchronous generator iterator* in some contexts. In cases where the intended meaning isn't clear, using the full terms avoids ambiguity.
el: Συνήθως αναφέρεται σε μια συνάρτηση ασύγχρονου generator, αλλά μπορεί να αναφέρεται σε έναν *ασύγχρονο generator iterator* σε ορισμένα contexts. Σε περιπτώσεις όπου το επιδιωκόμενο νόημα δεν είναι σαφές, με την χρήση των πλήρων όρων αποφεύγεται η ασάφεια.

source: An asynchronous generator function may contain :keyword:`await` expressions as well as :keyword:`async for`, and :keyword:`async with` statements.
el: Μια συνάρτηση ασύγχρονου generator μπορεί να περιέχει εκφράσεις :keyword:`await` , καθώς και δηλώσεις :keyword:`async for`, και :keyword:`async with`.

source: asynchronous generator iterator
el: ασύγχρονος generator iterator

source: An object created by a :term:`asynchronous generator` function.
el: Ένα αντικείμενο που δημιουργήθηκε από μια συνάρτηση :term:`asynchronous generator`.

source: This is an :term:`asynchronous iterator` which when called using the :meth:`~object.__anext__` method returns an awaitable object which will execute the body of the asynchronous generator function until the next :keyword:`yield` expression.
el: Αυτός είναι ένας :term:`asynchronous iterator` που όταν καλείται χρησιμοποιώντας την μέθοδο :meth:`~object.__anext__` επιστρέφει ένα αναμενόμενο αντικείμενο που θα εκτελέσει στο σώμα της συνάρτησης του ασύγχρονου generator μέχρι την επόμενη :keyword:`yield` έκφραση.

source: Each :keyword:`yield` temporarily suspends processing, remembering the execution state (including local variables and pending try-statements). When the *asynchronous generator iterator* effectively resumes with another awaitable returned by :meth:`~object.__anext__`, it picks up where it left off. See :pep:`492` and :pep:`525`.
el: Κάθε :keyword:`yield` αναστέλλει προσωρινά την επεξεργασία, θυμάται την κατάσταση εκτέλεσης (συμπεριλαμβανομένων των τοπικών μεταβλητών και των δηλώσεων `try` σε εκκρεμότητα). Όταν ο *ασύγχρονος generator iterator* συνεχίσει αποτελεσματικά με άλλο αναμενόμενο που επιστρέφεται από :meth:`~object.__anext__ `, συνεχίζει από εκεί που σταμάτησε. Βλ. :pep:`492` και :pep:`525`.

source: asynchronous iterable
el: ασύγχρονος iterable

source: An object, that can be used in an :keyword:`async for` statement. Must return an :term:`asynchronous iterator` from its :meth:`~object.__aiter__` method. Introduced by :pep:`492`.
el: Ένα αντικείμενο, που μπορεί να χρησιμοποιηθεί σε μια δήλωση :keyword:`async for`. Πρέπει να επιστρέφει ένα :term:`asynchronous iterator` από την μέθοδο :meth:`~object.__aiter__`. Που εισήχθη από :pep:`492`.

source: asynchronous iterator
el: ασύγχρονος iterator

source: An object that implements the :meth:`~object.__aiter__` and :meth:`~object.__anext__` methods. :meth:`~object.__anext__` must return an :term:`awaitable` object. :keyword:`async for` resolves the awaitables returned by an asynchronous iterator's :meth:`~object.__anext__` method until it raises a :exc:`StopAsyncIteration` exception. Introduced by :pep:`492`.
el: Ένα αντικείμενο που υλοποιεί τις μεθόδους :meth:`~object.__aiter__` και :meth:`~object.__anext__`. Η μέθοδος :meth:`~object.__anext__` πρέπει να επιστρέφει ένα :term:`awaitable` αντικείμενο. Το :keyword:`async for` επιλύει τα αναμενόμενα που επιστρέφονται από τη μέθοδο :meth:`~object.__anext__` ενός ασύγχρονου iterator έως ότου εγείρει μια εξαίρεση :exc:`StopAsyncIteration`. Εισήχθη από :pep:`492`.

source: attached thread state
el: κατάσταση συνδεδεμένου νήματος

source: A :term:`thread state` that is active for the current OS thread.
el: Ένα :term:`thread state` που είναι ενεργή για το τρέχον νήμα του λειτουργικού συστήματος.

source: When a :term:`thread state` is attached, the OS thread has access to the full Python C API and can safely invoke the bytecode interpreter.
el: Όταν επισυνάπτεται ένας :term:`thread state`, το νήμα του λειτουργικού συστήματος έχει πρόσβαση στο πλήρες Python C API και μπορεί να καλέσει με ασφάλεια τον διερμηνέα bytecode.

source: Unless a function explicitly notes otherwise, attempting to call the C API without an attached thread state will result in a fatal error or undefined behavior. A thread state can be attached and detached explicitly by the user through the C API, or implicitly by the runtime, including during blocking C calls and by the bytecode interpreter in between calls.
el: Εκτός εάν μια συνάρτηση αναφέρει ρητά το αντίθετο, η προσπάθεια κλήσης του C API χωρίς μια συνημμένη κατάσταση νήματος θα οδηγήσει ένα μοιραίο σφάλμα ή σε απροσδιόριστη συμπεριφορά. Μια κατάσταση νήματος μπορεί να συνδεθεί και να αποσυνδεθεί ρητά από τον χρήση μέσω του C API ή έμμεσα από τον χρόνο εκτέλεσης, συμπεριλαμβανομένων των κλήσεων αποκλεισμού C και από τον διερμηνέα bytecode μεταξύ των κλήσεων.

source: On most builds of Python, having an attached thread state implies that the caller holds the :term:`GIL` for the current interpreter, so only one OS thread can have an attached thread state at a given moment. In :term:`free-threaded <free threading>` builds of Python, threads can concurrently hold an attached thread state, allowing for true parallelism of the bytecode interpreter.
el: Στις περισσότερες εκδόσεις της Python, η ύπαρξη μιας κατάσταση συνδεδεμένου νήματος υπονοεί ότι ο καλών διατηρεί την :term:`GIL` για τον τρέχοντα διερμηνέα, επομένως μόνο ένα νήμα λειτουργικού συστήματος μπορεί να έχει μια κατάσταση συνδεδεμένου νήματος σε μια δεδομένη στιγμή. Στις εκδόσεις :term:`free-threaded <free threading>` της Python, τα νήματα μπορούν να διατηρούν ταυτόχρονα μια κατάσταση συνδεδεμένου νήματος, επιτρέποντας την πραγματική παραλληλία του διερμηνέα bytecode.

source: attribute
el: χαρακτηριστικό

source: A value associated with an object which is usually referenced by name using dotted expressions. For example, if an object *o* has an attribute *a* it would be referenced as *o.a*.
el: Μια τιμή που σχετίζεται με ένα αντικείμενο που συνήθως αναφέρεται με όνομα χρησιμοποιώντας εκφράσεις με κουκκίδες. Για παράδειγμα, εάν ένα αντικείμενο *o* έχει ένα χαρακτηριστικό *a* θα αναφέρεται ως *o.a*.

source: It is possible to give an object an attribute whose name is not an identifier as defined by :ref:`identifiers`, for example using :func:`setattr`, if the object allows it. Such an attribute will not be accessible using a dotted expression, and would instead need to be retrieved with :func:`getattr`.
el: Είναι δυνατό να δώσουμε σε ένα αντικείμενο ένα χαρακτηριστικό που το όνομα του δεν είναι αναγνωριστικό όπως ορίζεται από :ref:`identifiers`, για παράδειγμα χρησιμοποιώντας :func:`setattr`, αν επιτρέπεται από το αντικείμενο. Ένα τέτοιο χαρακτηριστικό δεν θα είναι προσβάσιμο χρησιμοποιώντας τις τελείες, και αντί αυτού θα πρέπει να ανακτηθεί χρησιμοποιώντας :func:`getattr`.

source: An object that can be used in an :keyword:`await` expression. Can be a :term:`coroutine` or an object with an :meth:`~object.__await__` method. See also :pep:`492`.
el: Ένα αντικείμενο που μπορεί να χρησιμοποιηθεί στην έκφραση :keyword:`await`. Μπορεί να είναι :term:`coroutine` ή ένα αντικείμενο με μια :meth:`~object.__await__` μέθοδο. Βλ. επίσης :pep:`492`.

source: Benevolent Dictator For Life, a.k.a. `Guido van Rossum <https://gvanrossum.github.io/>`_, Python's creator.
el: Ακρωνύμιο του *Benevolent Dictator For Life*, καλοκάγαθος δικτάτορας της ζωής, δηλαδή `Guido van Rossum <https://gvanrossum.github.io/>`_, ο δημιουργός της Python.

source: binary file
el: δυαδικό αρχείο

source: A :term:`file object` able to read and write :term:`bytes-like objects <bytes-like object>`. Examples of binary files are files opened in binary mode (``'rb'``, ``'wb'`` or ``'rb+'``), :data:`sys.stdin.buffer <sys.stdin>`, :data:`sys.stdout.buffer <sys.stdout>`, and instances of :class:`io.BytesIO` and :class:`gzip.GzipFile`.
el: Ένα :term:`file object` ικανό να διαβάζει και να γράφει :term:`δυαδικού τύπου αντικείμενα <bytes-like object>`. Παραδείγματα δυαδικών αρχείων είναι αρχεία που ανοίγουν σε δυαδική λειτουργία (``'rb'``, ``'wb'`` ή ``'rb+'``), :data:`sys.stdin.buffer <sys.stdin>`, :data:`sys.stdout.buffer <sys.stdout>`, και στιγμιοτύπων των :class:`io.BytesIO` και :class:`gzip.GzipFile`.

source: See also :term:`text file` for a file object able to read and write :class:`str` objects.
el: Βλ. επίσης :term:`text file` για ένα αντικείμενο τύπου αρχείο ικανό να διαβάσει και να γράψει :class:`str` αντικείμενα.

source: borrowed reference
el: δανεική αναφορά

source: In Python's C API, a borrowed reference is a reference to an object, where the code using the object does not own the reference. It becomes a dangling pointer if the object is destroyed. For example, a garbage collection can remove the last :term:`strong reference` to the object and so destroy it.
el: Στο C API της Python, μια δανεική αναφορά είναι μια αναφορά σε ένα αντικείμενο, όπου ο κώδικας που χρησιμοποιεί το αντικείμενο δεν κατέχει την αναφορά. Γίνεται ένας αχρησιμοποίητος δείκτης εάν το αντικείμενο καταστραφεί. Για παράδειγμα, μια διαδικασία garbage collection μπορεί να αφαιρέσει το τελευταίο :term:`strong reference` από το αντικείμενο και έτσι να το καταστρέψει.

source: Calling :c:func:`Py_INCREF` on the :term:`borrowed reference` is recommended to convert it to a :term:`strong reference` in-place, except when the object cannot be destroyed before the last usage of the borrowed reference. The :c:func:`Py_NewRef` function can be used to create a new :term:`strong reference`.
el: Συνίσταται η κλήση του :c:func:`Py_INCREF` στο :term:`δανεική αναφορά <borrowed reference>` με σκοπό να μετατραπεί σε ένα :term:`ισχυρή αναφορά <strong reference>` επιτόπου, εκτός όταν το αντικείμενο δεν μπορεί να καταστραφεί πριν από την τελευταία χρήση της δανεικής αναφοράς. Η συνάρτηση :c:func:`Py_NewRef` μπορεί να χρησιμοποιηθεί ώστε να δημιουργηθεί ένα :term:`ισχυρή αναφορά <strong reference>`.

source: bytes-like object
el: bytes-like αντικείμενα

source: An object that supports the :ref:`bufferobjects` and can export a C-:term:`contiguous` buffer. This includes all :class:`bytes`, :class:`bytearray`, and :class:`array.array` objects, as well as many common :class:`memoryview` objects. Bytes-like objects can be used for various operations that work with binary data; these include compression, saving to a binary file, and sending over a socket.
el: Ένα αντικείμενο που υποστηρίζει το :ref:`bufferobjects` και μπορεί να εξάγει ένα C-:term:`contiguous` buffer. Αυτό περιλαμβάνει όλα τα αντικείμενα :class:`bytes`, :class:`bytearray`, και :class:`array.array`, καθώς και πολλά κοινά :class:`memoryview` αντικείμενα. Τα δυαδικού τύπου (bytes-like) αντικείμενα μπορούν να χρησιμοποιηθούν για διάφορες λειτουργίες που διαχειρίζονται δυαδικά δεδομένα' αυτά περιλαμβάνουν συμπίεση αποθήκευση σε δυαδικό αρχείο και αποστολή μέσω socket.

source: Some operations need the binary data to be mutable. The documentation often refers to these as "read-write bytes-like objects". Example mutable buffer objects include :class:`bytearray` and a :class:`memoryview` of a :class:`bytearray`. Other operations require the binary data to be stored in immutable objects ("read-only bytes-like objects"); examples of these include :class:`bytes` and a :class:`memoryview` of a :class:`bytes` object.
el: Ορισμένες λειτουργίες χρειάζονται τα δυαδικά δεδομένα να είναι μεταβλητά. Η τεκμηρίωση συχνά αναφέρεται σε αυτά ως "δυαδικά αντικείμενα ανάγνωσης-εγγραφής" (read-write bytes-like objects). Παραδείγματα μεταβλητών αντικειμένων προσωρινής αποθήκευσης περιέχουν :class:`bytearray` και ένα :class:`memoryview` ενός :class:`bytearray`. Άλλες λειτουργίες απαιτούν την αποθήκευσης των δυαδικών δεδομένα σε αμετάβλητα αντικείμενα ("δυαδικά αντικείμενα μόνο ανάγνωσης"' (read-only bytes-like objects) παραδείγματα αυτών περιέχουν :class:`bytes` και ένα :class:`memoryview` ενός :class:`bytes` αντικειμένου.

source: Python source code is compiled into bytecode, the internal representation of a Python program in the CPython interpreter. The bytecode is also cached in ``.pyc`` files so that executing the same file is faster the second time (recompilation from source to bytecode can be avoided). This "intermediate language" is said to run on a :term:`virtual machine` that executes the machine code corresponding to each bytecode. Do note that bytecodes are not expected to work between different Python virtual machines, nor to be stable between Python releases.
el: Ο πηγαίος κώδικα της Python μεταγλωττίζεται σε *bytecode*, η εσωτερική αναπαράσταση ενός προγράμματος Python στον διερμηνέα CPython. Το *bytecode* αποθηκεύεται επίσης προσωρινά ως ``.pyc`` αρχεία ώστε η εκτέλεση του ίδιου αρχείου να είναι γρηγορότερη την δεύτερη φορά εκτέλεσης (μπορεί να αποφευχθεί η εκ νέου μεταγλώττιση από τον πηγαίο κώδικα σε *bytcode*). Αυτή η "ενδιάμεση γλώσσα" λέγεται ότι τρέχει σε μια :term:`virtual machine` που εκτελεί τον κώδικα μηχανής που αντιστοιχεί σε κάθε *bytecode*. Λάβετε υπόψη ότι τα *bytecode* δεν αναμένεται να λειτουργούν μεταξύ διαφορετικών εικονικών μηχανών Python, ούτε να είναι σταθερά μεταξύ των εκδόσεων της Python.

source: A list of bytecode instructions can be found in the documentation for :ref:`the dis module <bytecodes>`.
el: Μια λίστα από οδηγίες σχετικά με τα bytecode μπορεί να βρεθεί στην τεκμηρίωση για :ref:`το module dis <bytecodes>`.

source: A callable is an object that can be called, possibly with a set of arguments (see :term:`argument`), with the following syntax::
el: Ένα callable είναι ένα αντικείμενο που μπορεί να καλεστεί, πιθανά με ένα σύνολο ορισμάτων (βλ. :term:`argument`), με την παρακάτω σύνταξη::

source: A :term:`function`, and by extension a :term:`method`, is a callable. An instance of a class that implements the :meth:`~object.__call__` method is also a callable.
el: Μια :term:`function`, και κατ' επέκταση μια :term:`method` είναι callable. Ένα στιγμιότυπο μια κλάσης που υλοποιεί τη μέθοδο :meth:`~object.__call__` είναι επίσης callable.

source: A subroutine function which is passed as an argument to be executed at some point in the future.
el: Μια subroutine συνάρτηση η οποία μεταβιβάζεται ως όρισμα που θα εκτελεστεί κάποια στιγμή στο μέλλον.

source: class
el: κλάση

source: A template for creating user-defined objects. Class definitions normally contain method definitions which operate on instances of the class.
el: Ένα πρότυπο για τη δημιουργία αντικειμένων που ορίζονται από το χρήστη. Οι ορισμοί κλάσεων συνήθως περιέχουν ορισμούς μεθόδων που λειτουργούν σε στιγμιότυπα της κλάσης.

source: class variable
el: μεταβλητή κλάσης

source: A variable defined in a class and intended to be modified only at class level (i.e., not in an instance of the class).
el: Μια μεταβλητή που ορίζεται σε μια κλάση και προορίζεται να τροποποιηθεί μόνο σε επίπεδο κλάσης (δηλ. όχι σε ένα στιγμιότυπο μιας κλάσης).

source: closure variable
el: μεταβλητή κλεισίματος
