Repository: thepetk/python-docs-gr
Catalog: sphinx.po
Languages: el

source: Stable
el: Σταθερή

source: In development
el: Υπό ανάπτυξη

source: This Page
el: Αυτή η Σελίδα

source: Report a Bug
el: Ανέφερε ένα Bug

source: Show Source
el: Εμφάνιση Πηγής

source: Download
el: Κατεβάστε

source: Download Python %(dl_version)s Documentation
el: Κατεβάστε την τεκμηρίωση της Python %(dl_version)s

source: Last updated on: %(last_updated)s.
el: Τελευταία ενημέρωση στις: %(last_updated)s.

source: To download an archive containing all the documents for this version of Python in one of various formats, follow one of links in this table.
el: Για λήψη ενός αρχείου που περιέχει όλα τα έγγραφα για αυτήν την έκδοση της Python σε μία από τις διάφορες μορφές, ακολουθήστε έναν από τους συνδέσμου σε αυτόν τον πίνακα.σ

source: Format
el: Διάταξη

source: Packed as .zip
el: Συσκευασμένο ως .zip

source: Packed as .tar.bz2
el: Συσκευασμένο ως .tar.bz2

source: Plain text
el: Απλό κείμενο

source: These archives contain all the content in the documentation.
el: Αυτά τα αρχεία περιέχουν όλο το περιεχόμενο της τεκμηρίωσης.

source: Unpacking
el: Αποσυμπίεση

source: Unix users should download the .tar.bz2 archives; these are bzipped tar archives and can be handled in the usual way using tar and the bzip2 program. The <a href="https://infozip.sourceforge.net">Info-ZIP</a> unzip program can be used to handle the ZIP archives if desired. The .tar.bz2 archives provide the best compression and fastest download times.
el: Οι χρήστες Unix θα πρέπει να κατεβάσουν τα αρχεία .tar.bz2· αυτά τα αρχεία tar archives με μορφή bzip μπορούν να τα χειριστούν με τον συνήθη τρόπο χρησιμοποιώντας το tar και το πρόγραμμα bzip2 . Το πρόγραμμα αποσυμπίεσης <a href="https://infozip.sourceforge.net">Info-ZIP</a> μπορεί να χρησιμοποιηθεί για το χειρισμό των αρχείων ZIP εάν το επιθυμείτε. Τα αρχεία .tar.bz2 παρέχουν την καλύτερη συμπίεση και τους ταχύτερους χρόνους λήψης.

source: Windows users can use the ZIP archives since those are customary on that platform. These are created on Unix using the Info-ZIP zip program.
el: Οι χρήστες των Windows μπορούν να χρησιμοποιήσουν τα αρχεία ZIP αφού αυτά είναι συνηθισμένα σε αυτήν την πλατφόρμα. Αυτά δημιουργούνται στο Unix χρησιμοποιώντας το πρόγραμμα zip Info-ZIP.

source: Problems
el: Προβλήματα

source: If you have comments or suggestions for the Python documentation, please send email to <a href="mailto:docs@python.org">docs@python.org</a>.
el: Εάν έχετε σχόλια ή προτάσεις για την τεκμηρίωση της Python, στείλτε email στη διεύθυνση <a href="mailto:docs@python.org">docs@python.org</a>.

source: Availability
el: Διαθεσιμότητα

source: Part of the
el: Μέρος του

source: Limited API
el: Περιορισμένο API

source: Stable ABI
el: Σταθερό ABI

source: (as an opaque struct)
el: (ως μια αδιαφανής κατασκευή)

source: (including all members)
el: (συμπεριλαμβανομένων όλων των μελών)

source: since version %s
el: από την έκδοση %s

source: (Only some members are part of the stable ABI.)
el: (Μόνο ορισμένα μέλη αποτελούν μέρος του σταθερού ABI.)

source: This is
el: Αυτό είναι

source: Unstable API
el: Ασταθές API

source: . It may change without warning in minor releases.
el: . Μπορεί να αλλάξει χωρίς προειδοποίηση σε μικρές εκδόσεις.

source: Return value: Always NULL.
el: Επιστρεφόμενη τιμή: Πάντοτε NULL.

source: Return value: New reference.
el: Επιστρεφόμενη τιμή: New reference.

source: Return value: Borrowed reference.
el: Επιστρεφόμενη τιμή: Borrowed reference.

source: CPython implementation detail:
el: Λεπτομέρεια υλοποίησης CPython:

source: Deprecated since version {deprecated}, will be removed in version {removed}
el: Καταργήθηκε στην έκδοση {deprecated}, θα αφαιρεθεί στην έκδοση {removed}

source: Deprecated since version {deprecated}, removed in version {removed}
el: Καταργήθηκε στην έκδοση {deprecated}, αφαιρέθηκε στην έκδοση {removed}

source: in development
el: υπό ανάπτυξη

source: pre-release
el: προέκδοση

source: stable
el: σταθερή

source: security-fixes
el: επιδιορθώσεις ασφαλείας

source: Welcome! This is the official documentation for Python %(release)s.
el: Καλώς ήρθατε! Αυτό είναι η επίσημη τεκμηρίωση για την Python %(release)s.

source: Documentation sections:
el: Ενότητες Τεκμηρίωσης:

source: What's new in Python %(version)s?
el: Τι νέο υπάρχει στην Python %(version)s;

source: Or <a href="%(whatsnew_index)s">all "What's new" documents since Python 2.0</a>
el: Ή <a href="%(whatsnew_index)s">όλα "Τι νέο υπάρχει" έγγραφα</a> από την Python 2.0

source: Start here: a tour of Python's syntax and features
el: Ξεκινήστε εδώ, μια περιήγηση στη σύνταξη και τις δυνατότητες της Python

source: Library reference
el: Αναφορά βιβλιοθήκης

source: Standard library and builtins
el: Τυπική Βιβλιοθήκη και builtins

source: Language reference
el: Γλωσσική αναφορά

source: Syntax and language elements
el: Συντακτικά και γλωσσικά στοιχεία

source: Python setup and usage
el: Ρύθμιση και χρήση της Python

source: How to install, configure, and use Python
el: Πως να εγκαταστήσετε, ρυθμίσετε, και χρησιμοποιήσετε την Python

source: In-depth topic manuals
el: Σε βάθος εγχειρίδια θεμάτων

source: Installing Python modules
el: Εγκατάσταση Python modules

source: Third-party modules and PyPI.org
el: Modules τρίτων και PyPI.org

source: Distributing Python modules
el: Διανομή Python modules

source: Publishing modules for use by other people
el: Δημοσίευση modules για χρήση από άλλους

source: Extending and embedding
el: Επέκταση και ενσωμάτωση

source: For C/C++ programmers
el: Για προγραμματιστές C/C++

source: Python's C API
el: Το C API της Python

source: C API reference
el: Αναφορά C API

source: Frequently asked questions (with answers!)
el: Συχνές ερωτήσεις (με απαντήσεις!)

source: Deprecations
el: Απαρχαιωμένες δυνατότητες

source: Deprecated functionality
el: Απαρχαιωμένη λειτουργικότητα

source: Indices, glossary, and search:
el: Ευρετήρια, Γλωσσάριο, και αναζήτηση:

source: All modules and libraries
el: Όλα τα modules και οι βιβλιοθήκες

source: General index
el: Γενικό ευρετήριο

source: All functions, classes, and terms
el: Όλες οι συναρτήσεις, οι κλάσεις, οι όροι

source: Glossary
el: Γλωσσάριο

source: Terms explained
el: Οι όροι εξηγούνται

source: Search page
el: Αναζήτηση σελίδας

source: Search this documentation
el: Αναζητήστε αυτήν την τεκμηρίωση

source: Complete table of contents
el: Ολοκληρωμένος πίνακας περιεχομένων

source: Lists all sections and subsections
el: Παραθέτει όλες τις ενότητες και τις υποενότητες

source: Project information:
el: Πληροφορίες έργου:

source: Reporting issues
el: Αναφορά ζητημάτων

source: Contributing to Docs
el: Συμβολή στην Τεκμηρίωση

source: Download the documentation
el: Κατεβάστε την τεκμηρίωση

source: History and license of Python
el: Ιστορία και άδεια της Python

source: About the documentation
el: Σχετικά με την τεκμηρίωση

source: Download these documents
el: Κατεβάστε αυτά τα έγγραφα

source: Docs by version
el: Έγγραφα ανά έκδοση

source: All versions
el: Όλες οι εκδόσεις

source: Other resources
el: Άλλες πηγές

source: PEP Index
el: Ευρετήριο PEP

source: Beginner's Guide
el: Οδηγός για αρχάριους

source: Book List
el: Λίστα Βιβλίων

source: Audio/Visual Talks
el: Οπτικοακουστικές Ομιλίες

source: Python Developer’s Guide
el: Οδηγός Προγραμματιστή Python

source: This document is for an old version of Python that is no longer supported. You should upgrade, and read the
el: Αυτό το έγγραφο είναι για μια παλιά έκδοση της Python που δεν υποστηρίζεται πλέον. Θα πρέπει να αναβαθμίσετε και να διαβάσετε το

source: Python documentation for the current stable release
el: Τεκμηρίωση Python για την τρέχουσα σταθερή έκδοση

source: This is a deploy preview created from a <a href="%(repository_url)s/pull/%(pr_id)s">pull request</a>. For authoritative documentation, see
el: Αυτή είναι μια προεπισκόπηση deploy που δημιουργήθηκε από ένα <a href="%(repository_url)s/pull/%(pr_id)s">pull request</a>. Για έγκυρη τεκμηρίωση, βλ

source: the current stable release
el: η τρέχουσα σταθερή έκδοση
