Repository: thepetk/python-docs-gr
Catalog: extending/index.po
Languages: el

source: Extending and Embedding the Python Interpreter
el: Επέκταση και Ενσωμάτωση του Διερμηνέα της Python

source: This document describes how to write modules in C or C++ to extend the Python interpreter with new modules. Those modules can not only define new functions but also new object types and their methods. The document also describes how to embed the Python interpreter in another application, for use as an extension language. Finally, it shows how to compile and link extension modules so that they can be loaded dynamically (at run time) into the interpreter, if the underlying operating system supports this feature.
el: Αυτό το έγγραφο περιγράφει πώς να γράφετε modules σε C ή C++ για να επεκτείνετε τον διερμηνέα της Python με νέα modules. Αυτά τα modules δεν μπορούν μόνο να ορίσουν νέες συναρτήσεις αλλά και νέους τύπους αντικειμένων και τις μεθόδους τους. Το έγγραφο επίσης περιγράφει πώς να ενσωματώσετε τον διερμηνέα της Python σε μια άλλη εφαρμογή, ώστε να χρησιμοποιείται ως γλώσσα επέκτασης. Τέλος, δείχνει πώς να μεταγλωττίζετε και να συνδέετε τα modules επέκτασης ώστε να μπορούν να φορτώνονται δυναμικά (κατά την εκτέλεση) στον διερμηνέα, εφόσον το υποκείμενο λειτουργικό σύστημα υποστηρίζει αυτήν τη λειτουργία.

source: This document assumes basic knowledge about Python. For an informal introduction to the language, see :ref:`tutorial-index`. :ref:`reference-index` gives a more formal definition of the language. :ref:`library-index` documents the existing object types, functions and modules (both built-in and written in Python) that give the language its wide application range.
el: Αυτό το έγγραφο προϋποθέτει βασικές γνώσεις Python. Για μια ανεπίσημη εισαγωγή στη γλώσσα, δείτε το :ref:`tutorial-index`. Το :ref:`reference-index` παρέχει έναν πιο επίσημο ορισμό της γλώσσας. Το :ref:`library-index` τεκμηριώνει τους υπάρχοντες τύπους αντικειμένων, τις συναρτήσεις και τα modules (ενσωματωμένα και γραμμένα σε Python και τα δύο) που προσφέρουν στη γλώσσα το ευρύ πεδίο εφαρμογών της.

source: For a detailed description of the whole Python/C API, see the separate :ref:`c-api-index`.
el: Για μια λεπτομερή περιγραφή ολόκληρου του Python/C API, δείτε το ξεχωριστό :ref:`c-api-index`.

source: Recommended third party tools
el: Προτεινόμενα εργαλεία τρίτων

source: This guide only covers the basic tools for creating extensions provided as part of this version of CPython. Third party tools like `Cython <https://cython.org/>`_, `cffi <https://cffi.readthedocs.io>`_, `SWIG <https://www.swig.org>`_ and `Numba <https://numba.pydata.org/>`_ offer both simpler and more sophisticated approaches to creating C and C++ extensions for Python.
el: Αυτός ο οδηγός καλύπτει μόνο τα βασικά εργαλεία για τη δημιουργία επεκτάσεων που παρέχονται ως μέρος αυτής της έκδοσης της CPython. Εργαλεία τρίτων όπως τα `Cython <https://cython.org/>`_, `cffi <https://cffi.readthedocs.io>`_, `SWIG <https://www.swig.org>`_ και `Numba <https://numba.pydata.org/>`_ προσφέρουν τόσο απλούστερες όσο και πιο εξελιγμένες προσεγγίσεις για τη δημιουργία επεκτάσεων σε C και C++ για την Python.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/guides/packaging-binary-extensions/>`_
el: `Οδηγός Χρήστη για Δημιουργία πακέτων Python: Δυαδικές Επεκτάσεις <https://packaging.python.org/guides/packaging-binary-extensions/>`_

source: The Python Packaging User Guide not only covers several available tools that simplify the creation of binary extensions, but also discusses the various reasons why creating an extension module may be desirable in the first place.
el: Ο Οδηγός Χρήστη για Δημιουργία πακέτων της Python δεν καλύπτει μόνο διάφορα διαθέσιμα εργαλεία που απλοποιούν τη δημιουργία δυαδικών επεκτάσεων, αλλά επίσης συζητά και τους διάφορους λόγους για τους οποίους μπορεί να είναι επιθυμητή η δημιουργία ενός module επέκτασης σε πρώτη φάση.

source: Creating extensions without third party tools
el: Δημιουργία επεκτάσεων χωρίς εργαλεία τρίτων

source: This section of the guide covers creating C and C++ extensions without assistance from third party tools. It is intended primarily for creators of those tools, rather than being a recommended way to create your own C extensions.
el: Αυτό το μέρος του οδηγού καλύπτει τη δημιουργία επεκτάσεων σε C και C++ χωρίς τη βοήθεια εργαλείων τρίτων. Απευθύνεται κυρίως σε δημιουργούς αυτών των εργαλείων, παρά ως προτεινόμενη μέθοδος για τη δημιουργία δικών σας επεκτάσεων σε C.

source: Embedding the CPython runtime in a larger application
el: Ενσωμάτωση του χρόνου εκτέλεσης της CPython σε μεγαλύτερη εφαρμογή

source: Sometimes, rather than creating an extension that runs inside the Python interpreter as the main application, it is desirable to instead embed the CPython runtime inside a larger application. This section covers some of the details involved in doing that successfully.
el: Μερικές φορές, αντί να δημιουργήσουμε μια επέκταση που εκτελείται μέσα στον διερμηνέα της Python ως κύρια εφαρμογή, είναι προτιμότερο να ενσωματώσουμε τον χρόνο εκτέλεσης της CPython σε μια μεγαλύτερη εφαρμογή. Αυτή η ενότητα καλύπτει μερικές λεπτομέρειες για το πώς να το κάνετε αυτό με επιτυχία.
