Repository: thepetk/python-docs-gr
Catalog: library/importlib.resources.po
Languages: el

source: :mod:`!importlib.resources` -- Package resource reading, opening and access
el: :mod:`!importlib.resources` -- Ανάγνωση, άνοιγμα και πρόσβαση σε πόρους πακέτων

source: **Source code:** :source:`Lib/importlib/resources/__init__.py`
el: **Πηγαίος κώδικας:** :source:`Lib/importlib/resources/__init__.py`

source: This module leverages Python's import system to provide access to *resources* within *packages*.
el: Αυτό το module αξιοποιεί το σύστημα εισαγωγής της Python για να παρέχει πρόσβαση σε *πόρους* εντός *πακέτων*.

source: "Resources" are file-like resources associated with a module or package in Python. The resources may be contained directly in a package, within a subdirectory contained in that package, or adjacent to modules outside a package. Resources may be text or binary. As a result, Python module sources (.py) of a package and compilation artifacts (pycache) are technically de-facto resources of that package. In practice, however, resources are primarily those non-Python artifacts exposed specifically by the package author.
el: "Πόροι" είναι πόροι που μοιάζουν με αρχεία και σχετίζονται με ένα module ή πακέτο στην Python. Οι πόροι μπορεί να περιέχονται απευθείας σε ένα πακέτο, μέσα σε έναν υποκατάλογο που περιλαμβάνεται σε αυτό το πακέτο, ή δίπλα σε modules έξω από ένα πακέτο. Οι πόροι μπορεί να είναι μορφής κειμένου ή δυαδικής μορφής. Ως αποτέλεσμα, ο πηγαίος κώδικας των modules της Python (.py) ενός πακέτου και τα αποτελέσματα μεταγλώττισης (pycache) είναι τεχνικά de-facto πόροι αυτού του πακέτου. Ωστόσο, στην πράξη, οι πόροι είναι κυρίως εκείνα τα μη-Python αρχεία που εκτίθενται συγκεκριμένα από τον συγγραφέα του πακέτου.

source: Resources can be opened or read in either binary or text mode.
el: Οι πόροι μπορούν να ανοίξουν ή να διαβαστούν είτε σε δυαδική κατάσταση είτε σε κατάσταση κειμένου.

source: Resources are roughly akin to files inside directories, though it's important to keep in mind that this is just a metaphor. Resources and packages **do not** have to exist as physical files and directories on the file system: for example, a package and its resources can be imported from a zip file using :py:mod:`zipimport`.
el: Οι πόροι είναι κατά κάποιο τρόπο ανάλογοι με αρχεία μέσα σε καταλόγους, αν και είναι σημαντικό να θυμόμαστε ότι αυτή είναι απλώς μια μεταφορά. Οι πόροι και τα πακέτα **δεν** χρειάζεται να υπάρχουν ως φυσικά αρχεία και κατάλογοι στο σύστημα αρχείων: για παράδειγμα, ένα πακέτο και οι πόροι του μπορούν να εισαχθούν από ένα αρχείο zip χρησιμοποιώντας το :py:mod:`zipimport`.

source: This module provides functionality similar to `pkg_resources <https://setuptools.readthedocs.io/en/latest/pkg_resources.html>`_ `Basic Resource Access <https://setuptools.readthedocs.io/en/latest/pkg_resources.html#basic-resource-access>`_ without the performance overhead of that package. This makes reading resources included in packages easier, with more stable and consistent semantics.
el: Αυτό το module παρέχει λειτουργικότητα παρόμοια με το `pkg_resources <https://setuptools.readthedocs.io/en/latest/pkg_resources.html>`_ `Basic Resource Access <https://setuptools.readthedocs.io/en/latest/pkg_resources.html#basic-resource-access>`_, χωρίς όμως το κόστος απόδοσης που συνεπάγεται αυτό το πακέτο. Έτσι, η ανάγνωση πόρων που περιλαμβάνονται σε πακέτα γίνεται ευκολότερη, με πιο σταθερή και συνεπή σημασιολογία.

source: The standalone backport of this module provides more information on `using importlib.resources <https://importlib-resources.readthedocs.io/en/latest/using.html>`_ and `migrating from pkg_resources to importlib.resources <https://importlib-resources.readthedocs.io/en/latest/migration.html>`_.
el: Το αυτόνομο backport αυτού του module παρέχει περισσότερες πληροφορίες στα `using importlib.resources <https://importlib-resources.readthedocs.io/en/latest/using.html>`_ και `migrating from pkg_resources to importlib.resources <https://importlib-resources.readthedocs.io/en/latest/migration.html>`_.

source: :class:`Loaders <importlib.abc.Loader>` that wish to support resource reading should implement a ``get_resource_reader(fullname)`` method as specified by :class:`importlib.resources.abc.ResourceReader`.
el: Οι :class:`Loaders <importlib.abc.Loader>` που επιθυμούν να υποστηρίξουν ανάγνωση πόρων θα πρέπει να υλοποιήσουν μια μέθοδο ``get_resource_reader(fullname)`` όπως ορίζεται από την κλάση :class:`importlib.resources.abc.ResourceReader`.

source: Represents an anchor for resources, either a :class:`module object <types.ModuleType>` or a module name as a string. Defined as ``Union[str, ModuleType]``.
el: Αντιπροσωπεύει μία άγκυρα (anchor) για πόρους, είτε ένα :class:`module object <types.ModuleType>` είτε ένα όνομα module ως συμβολοσειρά. Ορίζεται ως ``Union[str, ModuleType]``.

source: Returns a :class:`~importlib.resources.abc.Traversable` object representing the resource container (think directory) and its resources (think files). A Traversable may contain other containers (think subdirectories).
el: Επιστρέφει ένα αντικείμενο :class:`~importlib.resources.abc.Traversable` που αντιπροσωπεύει το δοχείο των πόρων (σκεφτείτε έναν κατάλογο) και τους πόρους του (σκεφτείτε αρχεία). Ένα Traversable μπορεί να περιέχει και άλλα δοχεία (σκεφτείτε υποκαταλόγους).

source: *anchor* is an optional :class:`Anchor`. If the anchor is a package, resources are resolved from that package. If a module, resources are resolved adjacent to that module (in the same package or the package root). If the anchor is omitted, the caller's module is used.
el: Το *anchor* είναι μια προαιρετική κλάση :class:`Anchor`. Αν το anchor είναι πακέτο, οι πόροι επιλύονται σε αυτό το πακέτο. Αν είναι module, οι πόροι επιλύονται δίπλα σε αυτό το module (στο ίδιο πακέτο ή στη ρίζα του πακέτου). Αν το anchor παραλειφθεί, χρησιμοποιείται το module του καλούντος.

source: *package* parameter was renamed to *anchor*. *anchor* can now be a non-package module and if omitted will default to the caller's module. *package* is still accepted for compatibility but will raise a :exc:`DeprecationWarning`. Consider passing the anchor positionally or using ``importlib_resources >= 5.10`` for a compatible interface on older Pythons.
el: Η παράμετρος *package* μετονομάστηκε σε *anchor*. Το *anchor* μπορεί πλέον να είναι ένα module που δεν είναι πακέτο και αν παραλειφθεί θα χρησιμοποιηθεί το module του καλούντος. Το *package* γίνεται ακόμα αποδεκτό για συμβατότητα αλλά θα εμφανίσει ένα :exc:`DeprecationWarning`.Σκεφτείτε να περάσετε το anchor ως positional όρισμα ή να χρησιμοποιήσετε το ``importlib_resources >= 5.10`` για συμβατή διεπαφή σε παλαιότερες εκδόσεις Python.

source: Given a :class:`~importlib.resources.abc.Traversable` object representing a file or directory, typically from :func:`importlib.resources.files`, return a context manager for use in a :keyword:`with` statement. The context manager provides a :class:`pathlib.Path` object.
el: Δεδομένου ενός αντικειμένου :class:`~importlib.resources.abc.Traversable` που αντιπροσωπεύει ένα αρχείο ή κατάλογο, συνήθως από το :func:`importlib.resources.files`, επιστρέφει ένα context manager για χρήση σε μια :keyword:`with` πρόταση. Ο context manager παρέχει ένα αντικείμενο :class:`pathlib.Path`.

source: Exiting the context manager cleans up any temporary file or directory created when the resource was extracted from e.g. a zip file.
el: Η έξοδος από τον context manager καθαρίζει οποιοδήποτε προσωρινό αρχείο ή κατάλογο που δημιουργήθηκε όταν ο πόρος εξήχθη, π.χ. από ένα αρχείο zip.

source: Use ``as_file`` when the Traversable methods (``read_text``, etc) are insufficient and an actual file or directory on the file system is required.
el: Χρησιμοποιήστε το ``as_file`` όταν οι μέθοδοι του Traversable (όπως ``read_text``, κλπ) δεν επαρκούν και απαιτείται ένα πραγματικό αρχείο ή κατάλογος στο σύστημα αρχείων.

source: Added support for *traversable* representing a directory.
el: Προστέθηκε υποστήριξη για *traversable* που αντιπροσωπεύει έναν κατάλογο.

source: Functional API
el: Λειτουργικό API

source: A set of simplified, backwards-compatible helpers is available. These allow common operations in a single function call.
el: Ένα σύνολο απλοποιημένων, βοηθών συμβατών με προηγούμενες εκδόσεις είναι διαθέσιμο. Αυτά επιτρέπουν κοινές λειτουργίες σε μια κλήση συνάρτησης.

source: For all the following functions:
el: Για όλες τις παρακάτω λειτουργίες:

source: *anchor* is an :class:`~importlib.resources.Anchor`, as in :func:`~importlib.resources.files`. Unlike in ``files``, it may not be omitted.
el: Το *anchor* είναι μια :class:`~importlib.resources.Anchor`, όπως στη :func:`~importlib.resources.files`. Σε αντίθεση με τα ``αρχεία``, ενδέχεται να μην παραλειφθεί.

source: *path_names* are components of a resource's path name, relative to the anchor. For example, to get the text of resource named ``info.txt``, use::
el: Τα *path_names* είναι στοιχεία του ονόματος διαδρομής ενός πόρου, σε σχέση με το anchor. Για παράδειγμα, για να λάβετε το κείμενο του πόρου με το όνομα ``info.txt``, χρησιμοποιήστε::

source: Like :meth:`Traversable.joinpath <importlib.resources.abc.Traversable>`, The individual components should use forward slashes (``/``) as path separators. For example, the following are equivalent::
el: Όπως :meth:`Traversable.joinpath <importlib.resources.abc.Traversable>`, Τα μεμονωμένα στοιχεία θα πρέπει να χρησιμοποιούν κάθετε (``/``) ως διαχωριστές διαδρομή. Για παράδειγμα, τα ακόλουθα είναι ισοδύναμα::

source: For backward compatibility reasons, functions that read text require an explicit *encoding* argument if multiple *path_names* are given. For example, to get the text of ``info/chapter1.txt``, use::
el: Για λόγους συμβατότητας προς τα πίσω, οι συναρτήσεις που διαβάζουν κείμενο απαιτούν ένα ρητό όρισμα *encoding* εάν δίνονται πολλά *path_names*. Για παράδειγμα, για να λάβετε το κείμενο του ``info/chapter1.txt``, χρησιμοποιήστε::

source: Open the named resource for binary reading.
el: Ανοίξτε τον πόρο με όνομα για δυαδική ανάγνωση.

source: See :ref:`the introduction <importlib_resources_functional>` for details on *anchor* and *path_names*.
el: Δείτε :ref:`the introduction <importlib_resources_functional>` για λεπτομέρειες σχετικά με το *anchor* και *path_names*.

source: This function returns a :class:`~typing.BinaryIO` object, that is, a binary stream open for reading.
el: Αυτή η συνάρτηση επιστρέφει ένα αντικείμενο :class:`~typing.BinaryIO`, ένα δυαδικό ρεύμα εισόδου για ανάγνωση.

source: This function is roughly equivalent to::
el: Αυτή η συνάρτηση είναι περίπου ισοδύναμη με::

source: Multiple *path_names* are accepted.
el: Γίνονται αποδεκτά πολλά *path_names*.

source: Open the named resource for text reading. By default, the contents are read as strict UTF-8.
el: Ανοίγει τον δεδομένο πόρο για ανάγνωση κειμένου. Από προεπιλογή, τα περιεχόμενα διαβάζονται ως αυστηρά UTF-8.

source: See :ref:`the introduction <importlib_resources_functional>` for details on *anchor* and *path_names*. *encoding* and *errors* have the same meaning as in built-in :func:`open`.
el: Δείτε :ref:`the introduction <importlib_resources_functional>` για λεπτομέρειες σχετικά με το *anchor* και το *path_names*. Τα *encoding* και *errors* έχουν την ίδια σημασία όπως στο ενσωματωμένο :func:`open`.

source: For backward compatibility reasons, the *encoding* argument must be given explicitly if there are multiple *path_names*. This limitation is scheduled to be removed in Python 3.15.
el: Για λόγους συμβατότητας για προηγούμενες εκδόσεις, το όρισμα *encoding* πρέπει να δίνεται ρητά εάν υπάρχουν πολλά *path_names*. Αυτό ο περιορισμός έχει προγραμματιστεί να καταργηθεί στην Python 3.15.

source: This function returns a :class:`~typing.TextIO` object, that is, a text stream open for reading.
el: Αυτή η συνάρτηση επιστρέφει ένα :class:`~typing.TextIO` αντικείμενο, δηλαδή ένα ρεύμα εισόδου για ανάγνωση.

source: Multiple *path_names* are accepted. *encoding* and *errors* must be given as keyword arguments.
el: Πολλαπλά *path_names* γίνονται δεκτά. Τα *encoding* και *errors* πρέπει να δίνονται ως ορίσματα λέξεων-κλειδιών.

source: Read and return the contents of the named resource as :class:`bytes`.
el: Διαβάζει και επιστρέφει τα περιεχόμενα του δεδομένου πόρου ως :class:`bytes`.

source: Read and return the contents of the named resource as :class:`str`. By default, the contents are read as strict UTF-8.
el: Διαβάζει και επιστρέφει τα περιεχόμενα του δεδομένου πόρου μέσα στο ως :class:`str`. Από προεπιλογή, τα περιεχόμενα διαβάζονται ως αυστηρό UTF-8.

source: Provides the path to the *resource* as an actual file system path. This function returns a context manager for use in a :keyword:`with` statement. The context manager provides a :class:`pathlib.Path` object.
el: Παρέχει τη διαδρομή του *resource* ως πραγματική διαδρομή συστήματος αρχείων. Αυτή η συνάρτηση επιστρέφει ένα διαχειριστή περιεχομένου για χρήση σε μια :keyword:`with` πρόταση. Ο διαχειριστής περιεχομένου παρέχει ένα αντικείμενο :class:`pathlib.Path`.

source: Exiting the context manager cleans up any temporary files created, e.g. when the resource needs to be extracted from a zip file.
el: Η έξοδος από τον context manager καθαρίζει οποιοδήποτε προσωρινό αρχείο που δημιουργήθηκε, π.χ. όταν ο πόρος χρειάστηκε να εξαχθεί από ένα αρχείο zip.

source: For example, the :meth:`~pathlib.Path.stat` method requires an actual file system path; it can be used like this::
el: Για παράδειγμα, η μέθοδος :meth:`~pathlib.Path.stat` απαιτεί μια πραγματική διαδρομή συστήματος αρχείων· μπορεί να χρησιμοποιηθεί ως εξής::

source: Return ``True`` if the named resource exists, otherwise ``False``. This function does not consider directories to be resources.
el: Επιστρέφετε ``True`` εάν υπάρχει ο δεδομένος πόρος, διαφορετικά ``False``. Αυτή η συνάρτηση δεν θεωρεί τους καταλόγους ως πόρους.

source: Return an iterable over the named items within the package or path. The iterable returns names of resources (e.g. files) and non-resources (e.g. directories) as :class:`str`. The iterable does not recurse into subdirectories.
el: Επιστρέφει ένα iterable πάνω στα ονομασμένα στοιχεία μέσα στο πακέτο ή στη διαδρομή. Το iterable επιστρέφει τα ονόματα των πόρων (π.χ. αρχεία) και μη-πόρους (π.χ. καταλόγους) ως :class:`str`. Το iterable δεν επαναλαμβάνεται σε υποκαταλόγους.

source: Prefer ``iterdir()`` as above, which offers more control over the results and richer functionality.
el: Προτιμήστε το ``iterdir()`` όπως παραπάνω, το οποίο προσφέρει περισσότερο έλεγχο στα αποτελέσματα και πιο πλούσια λειτουργικότητα.
