Repository: thepetk/python-docs-gr
Catalog: library/stdtypes.po
Languages: el

source: Since 2 hexadecimal digits correspond precisely to a single byte, hexadecimal numbers are a commonly used format for describing binary data. Accordingly, the bytearray type has an additional class method to read data in that format:
el: Δεδομένου ότι 2 δεκαεξαδικά ψηφία αντιστοιχούν ακριβώς σε ένα μόνο byte, οι δεκαεξαδικοί αριθμοί είναι συνήθως χρησιμοποιούμενη μορφή για την περιγραφή δυαδικών δεδομένων. Συνεπώς, ο τύπος bytearray έχει μια πρόσθετη μέθοδο κλάσης για την ανάγνωση δεδομένων σε αυτήν την μορφή:

source: This :class:`bytearray` class method returns bytearray object, decoding the given string object. The string must contain two hexadecimal digits per byte, with ASCII whitespace being ignored.
el: Αυτή η μέθοδος κλάσης :class:`bytearray` επιστρέφει αντικείμενο bytearray, αποκωδικοποιώντας το δεδομένο αντικείμενο συμβολοσειράς. Η συμβολοσειρά πρέπει να περιέχει δύο δεκαεξαδικά ψηφία ανά byte, με το κενό διάστημα ASCII να αγνοείται.

source: :meth:`bytearray.fromhex` now skips all ASCII whitespace in the string, not just spaces.
el: Το :meth:`bytearray.fromhex` παρακάμπτει τώρα όλα τα κενά ASCII στη συμβολοσειρά, όχι μόνο τα κενά.

source: :meth:`bytearray.fromhex` now accepts ASCII :class:`bytes` and :term:`bytes-like objects <bytes-like object>` as input.
el: Η :meth:`bytearray.fromhex` δέχεται πλέον το ASCII :class:`bytes` και :term:`bytes-like objects <bytes-like object>` ως είσοδο.

source: A reverse conversion function exists to transform a bytearray object into its hexadecimal representation.
el: Υπάρχει μια συνάρτηση αντίστροφης μετατροπής για να μετατρέψει ένα αντικείμενο bytearray στη δεκαεξαδική αναπαράσταση του.

source: Similar to :meth:`bytes.hex`, :meth:`bytearray.hex` now supports optional *sep* and *bytes_per_sep* parameters to insert separators between bytes in the hex output.
el: Παρόμοια με το :meth:`bytes.hex`, το :meth:`bytearray.hex` υποστηρίζει τώρα προαιρετικές παραμέτρους *sep* και *bytes_per_sep* για την εισαγωγή διαχωριστικών μεταξύ των byte στην δεκαεξαδική έξοδο.

source: Resize the :class:`bytearray` to contain *size* bytes. *size* must be greater than or equal to 0.
el: Αλλάζει το μέγεθος του :class:`bytearray` ώστε αν περιέχει *size* bytes. Το *size* πρέπει να είναι μεγαλύτερο ή ίσο με το 0.

source: If the :class:`bytearray` needs to shrink, bytes beyond *size* are truncated.
el: Εάν η :class:`bytearray` χρειάζεται να συρρικνωθεί, τα bytes πέραν του *size* περικόπτονται.

source: If the :class:`bytearray` needs to grow, all new bytes, those beyond *size*, will be set to null bytes.
el: Εάν η :class:`bytearray` χρειάζεται να αυξηθεί, όλα τα νέα bytes, αυτά που είναι πέρα από το *size*, θα οριστούν σε null bytes.

source: This is equivalent to:
el: Ισοδύναμο με:

source: Examples:
el: Παραδείγματα:

source: Since bytearray objects are sequences of integers (akin to a list), for a bytearray object *b*, ``b[0]`` will be an integer, while ``b[0:1]`` will be a bytearray object of length 1. (This contrasts with text strings, where both indexing and slicing will produce a string of length 1)
el: Δεδομένου ότι τα αντικείμενα bytearray είναι ακολουθίες ακεραίων αριθμών (παρόμοια με μια λίστα), για ένα αντικείμενο bytearray *b*, το ``b[0]`` θα είναι ένας ακέραιος αριθμός, ενώ το ``b[0:1]`` θα είναι ένα αντικείμενο bytearray μήκους 1. (Αυτό έρχεται σε αντίθεση με τις συμβολοσειρές κειμένου, όπου τόσο το indexing και το slicing θα παράγουν μια συμβολοσειρά μήκους 1)

source: The representation of bytearray objects uses the bytes literal format (``bytearray(b'...')``) since it is often more useful than e.g. ``bytearray([46, 46, 46])``. You can always convert a bytearray object into a list of integers using ``list(b)``.
el: Η αναπαράσταση αντικειμένων bytearray χρησιμοποιεί τη μορφή bytes literal (``bytearray(b'...')``), καθώς είναι συχνά πιο χρήσιμη από π.χ. ``bytearray([46, 46, 46])``. Μπορείτε πάντα να μετατρέψετε ένα αντικείμενο bytearray σε λίστα ακεραίων χρησιμοποιώντας το ``list(b)``.

source: Bytes and Bytearray Operations
el: Λειτουργίες Bytes και Bytearray

source: Both bytes and bytearray objects support the :ref:`common <typesseq-common>` sequence operations. They interoperate not just with operands of the same type, but with any :term:`bytes-like object`. Due to this flexibility, they can be freely mixed in operations without causing errors. However, the return type of the result may depend on the order of operands.
el: Τόσο τα byte όσο και τα αντικείμενα του πίνακα byte υποστηρίζουν τις λειτουργίες της ακολουθίας :ref:`common <typesseq-common>`. Αλληλεπιδρούν όχι μόνο με τελεστές του ίδιου τύπου, αλλά και με οποιοδήποτε αντικείμενο :term:`bytes-like object`. Λόγω αυτής της ευελιξίας, μπορούν να αναμειχθούν ελεύθερα σε λειτουργίες χωρίς να προκαλούνται σφάλματα. Ωστόσο, ο τύπος επιστροφής του αποτελέσματος μπορεί να εξαρτάται από τη σειρά των τελεστών.

source: The methods on bytes and bytearray objects don't accept strings as their arguments, just as the methods on strings don't accept bytes as their arguments. For example, you have to write::
el: Οι μέθοδοι στα bytes και τα αντικείμενα bytearray δεν δέχονται συμβολοσειρές ως ορίσματά τους, όπως και οι μέθοδοι σε συμβολοσειρές δεν δέχονται bytes ως ορίσματα. Για παράδειγμα, πρέπει να γράψετε::

source: and::
el: και::

source: Some bytes and bytearray operations assume the use of ASCII compatible binary formats, and hence should be avoided when working with arbitrary binary data. These restrictions are covered below.
el: Ορισμένες λειτουργίες byte και bytearray προϋποθέτουν τη χρήση δυαδικών μορφών συμβατών με ASCII και, ως εκ τούτου, θα πρέπει να αποφεύγονται όταν εργάζεστε με αυθαίρετα δυαδικά δεδομένα. Αυτοί οι περιορισμοί καλύπτονται παρακάτω.

source: Using these ASCII based operations to manipulate binary data that is not stored in an ASCII based format may lead to data corruption.
el: Η χρήση αυτών των λειτουργιών βασίζονται στο ASCII για τον χειρισμό δυαδικών δεδομένων που δεν είναι αποθηκευμένα σε μορφή που βασίζεται σε ASCII μπορεί να οδηγήσει σε καταστροφή δεδομένων.

source: The following methods on bytes and bytearray objects can be used with arbitrary binary data.
el: Οι ακόλουθες μέθοδοι σε byte και αντικείμενα bytearray μπορούν να χρησιμοποιηθούν με αυθαίρετα δυαδικά δεδομένα.

source: Return the number of non-overlapping occurrences of subsequence *sub* in the range [*start*, *end*]. Optional arguments *start* and *end* are interpreted as in slice notation.
el: Επιστρέφει τον αριθμό των μη επικαλυπτόμενων εμφανίσεων της δευτερεύουσας ακολουθίας *sub* στο εύρος [*start*, *end*]. Τα προαιρετικά ορίσματα *start* και *end* ερμηνεύονται όπως στη σημειογραφία τμηματοποίησης.

source: The subsequence to search for may be any :term:`bytes-like object` or an integer in the range 0 to 255.
el: Η υποακολουθία για αναζήτηση μπορεί να είναι οποιοδήποτε :term:`bytes-like object` ή ένας ακέραιος αριθμός στην περιοχή από 0 έως 255.

source: If *sub* is empty, returns the number of empty slices between characters which is the length of the bytes object plus one.
el: Εάν το *sub* είναι κενό, επιστρέφει τον αριθμό των κενών τμημάτων μεταξύ των χαρακτήρων που είναι το μήκος του αντικειμένου bytes συν ένα.

source: Also accept an integer in the range 0 to 255 as the subsequence.
el: Επίσης αποδέχεται έναν ακέραιο αριθμό στο εύρος 0 έως 255 ως υποακολουθία.

source: If the binary data starts with the *prefix* string, return ``bytes[len(prefix):]``. Otherwise, return a copy of the original binary data::
el: Εάν τα δυαδικά δεδομένα ξεκινούν με τη συμβολοσειρά *prefix*, επιστρέφει ``bytes[len(prefix):]``. Διαφορετικά επιστρέψτε ένα αντίγραφο των αρχικών δυαδικών δεδομένων::

source: The *prefix* may be any :term:`bytes-like object`.
el: Το *prefix* μπορεί να είναι οποιοδήποτε :term:`bytes-like object`.

source: The bytearray version of this method does *not* operate in place - it always produces a new object, even if no changes were made.
el: Η έκδοση bytearray αυτής της μεθόδου *δεν* λειτουργεί στη θέση της - παράγει πάντα ένα νέο αντικείμενο, ακόμα και αν δεν έγιναν αλλαγές.

source: If the binary data ends with the *suffix* string and that *suffix* is not empty, return ``bytes[:-len(suffix)]``. Otherwise, return a copy of the original binary data::
el: Εάν τα δυαδικά δεδομένα τελειώνουν με τη συμβολοσειρά *suffix* και αυτό το *suffix* δεν είναι κενό, επιστρέφει ``bytes[:-len(suffix)]``. Διαφορετικά, επιστρέφει ένα αντίγραφο των αρχικών δυαδικών δεδομένων::

source: The *suffix* may be any :term:`bytes-like object`.
el: Το *suffix* μπορεί να είναι οποιοδήποτε :term:`bytes-like object`.

source: Return the bytes decoded to a :class:`str`.
el: Επιστρέφει τα bytes που έχουν αποκωδικοποιηθεί σε μια :class:`str`.

source: *errors* controls how decoding errors are handled. If ``'strict'`` (the default), a :exc:`UnicodeError` exception is raised. Other possible values are ``'ignore'``, ``'replace'``, and any other name registered via :func:`codecs.register_error`. See :ref:`error-handlers` for details.
el: Το *errors* ελέγχει τον τρόπο χειρισμού των σφαλμάτων αποκωδικοποίησης. Εάν ``'strict'`` (η προεπιλογή), γίνεται raise μια εξαίρεση :exc:`UnicodeError`. Άλλες πιθανές τιμές είναι το ``'ignore'``, ``'replace'``, και οποιοδήποτε άλλο όνομα που έχει καταχωρηθεί από την :func:`codecs.register_error`. Βλέπε :ref:`error-handlers` για λεπτομέρειες.

source: For performance reasons, the value of *errors* is not checked for validity unless a decoding error actually occurs, :ref:`devmode` is enabled or a :ref:`debug build <debug-build>` is used.
el: Για λόγους απόδοσης, η τιμή του *errors* δεν ελέγχεται ως προς την εγκυρότητα του, εκτός εάν παρουσιαστεί ένα σφάλμα αποκωδικοποίησης, είναι ενεργοποιημένο το :ref:`devmode` ή χρησιμοποιείται ένα :ref:`debug build <debug-build>`.

source: Passing the *encoding* argument to :class:`str` allows decoding any :term:`bytes-like object` directly, without needing to make a temporary :class:`!bytes` or :class:`!bytearray` object.
el: Η μετάδοση του ορίσματος *encoding* στην :class:`str` επιτρέπει την αποκωδικοποίηση οποιουδήποτε :term:`bytes-like object` απευθείας, χωρίς να χρειάζεται να δημιουργήσετε ένα προσωρινό αντικείμενο :class:`!bytes` ή :class:`!bytearray`.

source: Return ``True`` if the binary data ends with the specified *suffix*, otherwise return ``False``. *suffix* can also be a tuple of suffixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
el: Επιστρέφει ``True`` εάν τα δυαδικά δεδομένα τελειώνουν με το καθορισμένο *suffix*, διαφορετικά επιστρέφει ``False``. Το *suffix* μπορεί επίσης να είναι μια πλειάδα από επιθέματα που πρέπει να αναζητήσετε. Με το προαιρετικό *start*, η δοκιμή ξεκινά από αυτή τη θέση. Με το προαιρετικό *end*, σταματήστε να συγκρίνετε σε αυτή τη θέση.

source: The suffix(es) to search for may be any :term:`bytes-like object`.
el: Το(α) επίθεμα(τα) για αναζήτηση μπορεί να είναι οποιοδήποτε :term:`bytes-like object`.

source: Return the lowest index in the data where the subsequence *sub* is found, such that *sub* is contained in the slice ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` if *sub* is not found.
el: Επιστρέφει το χαμηλότερο index στα δεδομένα όπου βρίσκεται η υποακολουθία *sub*, έτσι ώστε το *sub* να περιέχεται στο slice ``s[start:end]``. Τα προαιρετικά ορίσματα *start* και *end* ερμηνεύονται ως συμβολισμό τμηματοποίησης. Επιστρέφει ``-1`` εάν το *sub* δεν βρεθεί.

source: The :meth:`~bytes.find` method should be used only if you need to know the position of *sub*. To check if *sub* is a substring or not, use the :keyword:`in` operator::
el: Η μέθοδος :meth:`~bytes.find` θα πρέπει να χρησιμοποιείται μόνο εάν χρειάζεται να γνωρίζετε τη θέση του *sub*. Για να ελέγξετε εάν το *sub* είναι υποσυμβολοσειρά ή όχι, χρησιμοποιήστε τον τελεστή :keyword:`in`::

source: Like :meth:`~bytes.find`, but raise :exc:`ValueError` when the subsequence is not found.
el: Όπως η :meth:`~bytes.find`, αλλά κάνει raise μια :exc:`ValueError` όταν δεν βρεθεί η δευτερεύουσα ακολουθία.

source: Return a bytes or bytearray object which is the concatenation of the binary data sequences in *iterable*. A :exc:`TypeError` will be raised if there are any values in *iterable* that are not :term:`bytes-like objects <bytes-like object>`, including :class:`str` objects. The separator between elements is the contents of the bytes or bytearray object providing this method.
el: Επιστρέφει ένα αντικείμενο bytes ή bytearray που είναι η συνένωση των δυαδικών ακολουθιών δεδομένων στο *iterable*. Μια :exc:`TypeError` θα γίνει raise εάν υπάρχουν τιμές στο *iterable* που δεν είναι σαν :term:`bytes-like objects <bytes-like object>`, συμπεριλαμβανομένων των αντικειμένων :class:`str`. Το διαχωριστικό μεταξύ των στοιχειών είναι τα περιεχόμενα των byte ή του αντικειμένου bytearray που παρέχει αυτή τη μέθοδο.

source: This static method returns a translation table usable for :meth:`bytes.translate` that will map each character in *from* into the character at the same position in *to*; *from* and *to* must both be :term:`bytes-like objects <bytes-like object>` and have the same length.
el: Αυτή η στατική μέθοδος επιστρέφει έναν πίνακα μετάφρασης που μπορεί να χρησιμοποιηθεί για την :meth:`bytes.translate` που θα αντιστοιχίσει κάθε χαρακτήρα στο *from* στον χαρακτήρα στην ίδια θέση στο *to*· τα *from* και *to* πρέπει να είναι και τα δύο :term:`bytes-like objects <bytes-like object>` και να έχουν το ίδιο μήκος.

source: Split the sequence at the first occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself or its bytearray copy, and the part after the separator. If the separator is not found, return a 3-tuple containing a copy of the original sequence, followed by two empty bytes or bytearray objects.
el: Διαχωρίζει την ακολουθία κατά την πρώτη εμφάνιση του *sep*, και επιστρέφει μια 3-πλειάδα που περιέχει το τμήμα πριν από το διαχωριστικό ή το αντίγραφο του bytearray του και το τμήμα μετά το διαχωριστικό. Εάν δεν βρεθεί το διαχωριστικό, επιστρέφει μια 3-πλειάδα που περιέχει ένα αντίγραφο της αρχικής ακολουθίας, ακολουθούμενη από δύο κενά byte ή αντικείμενα bytearray.

source: The separator to search for may be any :term:`bytes-like object`.
el: Το διαχωριστικό για αναζήτηση μπορεί να είναι οποιοδήποτε :term:`bytes-like object`.

source: Return a copy of the sequence with all occurrences of subsequence *old* replaced by *new*. If the optional argument *count* is given, only the first *count* occurrences are replaced.
el: Επιστρέφει ένα αντίγραφο της ακολουθίας με όλες τις εμφανίσεις της δευτερεύουσας ακολουθίας *old* αντικαθιστούμενη από την *new*. Εάν δοθεί το προαιρετικό όρισμα *count*, αντικαθίστανται μόνο οι πρώτες εμφανίσεις *count*.

source: The subsequence to search for and its replacement may be any :term:`bytes-like object`.
el: Η ακολουθία για αναζήτηση και αντικατάσταση της μπορεί να είναι οποιοδήποτε :term:`bytes-like object`.

source: Return the highest index in the sequence where the subsequence *sub* is found, such that *sub* is contained within ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` on failure.
el: Επιστρέφει τον υψηλότερο δείκτη στην ακολουθία όπου βρίσκεται η υποακολουθία *sub*, έτσι ώστε το *sub* να περιέχεται στο ``s[start:end]``. Τα προαιρετικά ορίσματα *start* και *end* ερμηνεύονται με συμβολισμό τμηματοποίησης. Επιστρέφει ``-1`` σε περίπτωση αποτυχίας.

source: Like :meth:`~bytes.rfind` but raises :exc:`ValueError` when the subsequence *sub* is not found.
el: Όπως η :meth:`~bytes.rfind` αλλά κάνει raise μια :exc:`ValueError` όταν δεν βρεθεί η υποακολουθία *sub*.

source: Split the sequence at the last occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself or its bytearray copy, and the part after the separator. If the separator is not found, return a 3-tuple containing two empty bytes or bytearray objects, followed by a copy of the original sequence.
el: Διαχωρίζει την ακολουθία στην τελευταία εμφάνιση του *sep*, και επιστρέφει μια 3-πλειάδα που περιέχει το τμήμα πριν από το διαχωριστικό, το ίδιο το διαχωριστικό ή το αντίγραφο του bytearray και το τμήμα μετά το διαχωριστικό. Εάν δεν βρεθεί το διαχωριστικό επιστρέφει μια 3-πλειάδα που περιέχει δύο κενά byte ή αντικείμενα bytearray, ακολουθούμενα από ένα αντίγραφο της αρχικής ακολουθίας.

source: Return ``True`` if the binary data starts with the specified *prefix*, otherwise return ``False``. *prefix* can also be a tuple of prefixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
el: Επιστρέφει ``True`` εάν τα δυαδικά δεδομένα ξεκινούν με το καθορισμένο *prefix*, διαφορετικά επιστρέφει ``False``. Το *prefix* μπορεί επίσης να είναι μια πλειάδα από προθέματα προς αναζήτηση. Με το προαιρετικό *start*, η δοκιμή ξεκινά από αυτή τη θέση. Με το προαιρετικό *end*, σταματάει να συγκρίνει σε αυτή τη θέση.

source: The prefix(es) to search for may be any :term:`bytes-like object`.
el: Το(α) πρόθεμα(τα) για αναζήτηση μπορεί να είναι οποιοδήποτε :term:`bytes-like object`.

source: Return a copy of the bytes or bytearray object where all bytes occurring in the optional argument *delete* are removed, and the remaining bytes have been mapped through the given translation table, which must be a bytes object of length 256.
el: Επιστρέφει ένα αντίγραφο των bytes ή του αντικειμένου bytearray όπου αφαιρούνται όλα τα byte που εμφανίζονται στο προαιρετικό όρισμα *delete* και τα υπόλοιπα byte έχουν αντιστοιχιστεί μέσω του δεδομένου πίνακα μετάφρασης, ο οποίος πρέπει να είναι ένα αντικείμενο bytes μήκους 256.

source: You can use the :func:`bytes.maketrans` method to create a translation table.
el: Μπορείτε να χρησιμοποιήσετε τη μέθοδο :func:`bytes.maketrans` για να δημιουργήσετε έναν πίνακα μετάφρασης.

source: Set the *table* argument to ``None`` for translations that only delete characters::
el: Ορίζει το όρισμα *table* σε ``None`` για μεταφράσεις που διαγράφουν μόνο χαρακτήρες::

source: *delete* is now supported as a keyword argument.
el: Το *delete* υποστηρίζεται πλέον ως όρισμα λέξης-κλειδιού.

source: The following methods on bytes and bytearray objects have default behaviours that assume the use of ASCII compatible binary formats, but can still be used with arbitrary binary data by passing appropriate arguments. Note that all of the bytearray methods in this section do *not* operate in place, and instead produce new objects.
el: Οι ακόλουθες μέθοδοι σε byte και bytearray αντικείμενα έχουν προεπιλεγμένες συμπεριφορές που προϋποθέτουν τη χρήση δυαδικών μορφών συμβατών με ASCII, αλλά μπορούν να χρησιμοποιηθούν με αυθαίρετα δυαδικά δεδομένα περνώντας κατάλληλα ορίσματα. Σημειώστε ότι όλες οι μέθοδοι bytearray σε αυτήν την ενότητα *δεν* λειτουργούν στη θέση τους και όμως παράγουν νέα αντικείμενα.

source: Return a copy of the object centered in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
el: Επιστρέφει ένα αντίγραφο του αντικειμένου με κέντρο σε μια ακολουθία μήκους *width*. Η συμπλήρωση πραγματοποιείται χρησιμοποιώντας το καθορισμένο *fillbyte* (η προεπιλογή είναι ένα διάστημα ASCII). Για αντικείμενα :class:`bytes, η αρχική ακολουθία επιστρέφεται εάν το *width* είναι μικρότερο ή ίσο με ``len(s)``.

source: Return a copy of the object left justified in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
el: Επιστρέφει ένα αντίγραφο του αντικειμένου αριστερά ευθυγραμμισμένο σε μια ακολουθία μήκους *width*. Η συμπλήρωση πραγματοποιείται χρησιμοποιώντας το καθορισμένο *fillbyte* (η προεπιλογή είναι ένα διάστημα ASCII). Για αντικείμενα :class:`bytes, η αρχική ακολουθία επιστρέφεται εάν το *width* είναι μικρότερο ή ίσο με ``len(s)``.

source: Return a copy of the sequence with specified leading bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a prefix; rather, all combinations of its values are stripped::
el: Επιστρέφει ένα αντίγραφο της ακολουθίας με καθορισμένα βασικά byte που έχουν αφαιρεθεί. Το όρισμα *chars* είναι μια δυαδική ακολουθία που καθορίζει το σύνολο των τιμών byte που πρέπει να αφαιρεθούν - το όνομα αναφέρεται στο γεγονός ότι αυτή η μέθοδος χρησιμοποιείται συνήθως με χαρακτήρες ASCII. Εάν παραληφθεί ή είναι ``None``, το όρισμα *chars* έχει ως προεπιλογή την αφαίρεση του κενού διαστήματος ASCII. Το όρισμα *chars* δεν είναι πρόθεμα, αλλά οι συνδυασμοί των τιμών του αφαιρούνται:

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`. See :meth:`~bytes.removeprefix` for a method that will remove a single prefix string rather than all of a set of characters. For example::
el: Η δυαδική ακολουθία τιμών byte προς κατάργηση μπορεί να είναι οποιαδήποτε :term:`bytes-like object`. Βλέπε :meth:`~bytes.removeprefix` για μια μέθοδο που θα αφαιρέσει μια μεμονωμένη συμβολοσειρά προθέματος αντί όλο το σύνολο χαρακτήρων. Για παράδειγμα::

source: Return a copy of the object right justified in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
el: Επιστρέφει ένα αντίγραφο του αντικειμένου ευθυγραμμισμένο δεξιά που δικαιολογείται σε μια ακολουθία μήκους *width*. Η συμπλήρωση πραγματοποιείται χρησιμοποιώντας το καθορισμένο *fillbyte* (η προεπιλογή είναι ένα διάστημα ASCII). Για αντικείμενα :class:`bytes`, η αρχική ακολουθία επιστρέφεται εάν το *width* είναι μικρότερο ή ίσο με ``len(s)``.

source: Split the binary sequence into subsequences of the same type, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done, the *rightmost* ones. If *sep* is not specified or ``None``, any subsequence consisting solely of ASCII whitespace is a separator. Except for splitting from the right, :meth:`rsplit` behaves like :meth:`split` which is described in detail below.
el: Διαχωρίζει τη δυαδική ακολουθία σε υποακολουθίες του ίδιου τύπου, χρησιμοποιώντας το *sep* ως συμβολοσειρά οριοθέτησης. Εάν δοθεί *maxsplit*, γίνονται το πολύ *maxsplit* διαχωρισμοί, οι *rightmost*. Εάν δεν καθορίζεται *sep* ή ``None``, οποιαδήποτε υποακολουθία που αποτελείται αποκλειστικά από κενό διάστημα ASCII είναι διαχωριστικό, εκτός από το διαχωρισμό από τα δεξιά, η :meth:`rsplit` συμπεριφέρεται όπως :meth:`split` που περιγράφεται λεπτομερώς παρακάτω.
