Repository: thepetk/python-docs-gr
Catalog: library/stdtypes.po
Languages: el

source: Since sets only define partial ordering (subset relationships), the output of the :meth:`list.sort` method is undefined for lists of sets.
el: Δεδομένου ότι τα σύνολα ορίζουν μόνο μερική σειρά (σχέσεις υποσυνόλων), η έξοδος της μεθόδου :meth:`list.sort` δεν έχει οριστεί για λίστες συνόλων.

source: Set elements, like dictionary keys, must be :term:`hashable`.
el: Τα στοιχεία συνόλου, όπως τα κλειδιά λεξικού, πρέπει να είναι :term:`hashable`.

source: Binary operations that mix :class:`set` instances with :class:`frozenset` return the type of the first operand. For example: ``frozenset('ab') | set('bc')`` returns an instance of :class:`frozenset`.
el: Δυαδικές πράξεις που συνδυάζουν στιγμιότυπα :class:`set` με :class:`frozenset` επιστρέφουν τον τύπο του πρώτου τελεστή. Για παράδειγμα: ``frozenset('ab') | set('bc')`` επιστρέφει ένα στιγμιότυπο του :class:`frozenset`.

source: The following table lists operations available for :class:`set` that do not apply to immutable instances of :class:`frozenset`:
el: Ο παρακάτω πίνακας παραθέτει λειτουργίες που είναι διαθέσιμες για :class:`set` που δεν ισχύουν για αμετάβλητα στιγμιότυπα της :class:`frozenset`:

source: Update the set, adding elements from all others.
el: Ενημερώνει το σύνολο (set), προσθέτοντας στοιχεία από όλα τα άλλα.

source: Update the set, keeping only elements found in it and all others.
el: Ενημερώνει το σύνολο, διατηρώντας μόνο τα στοιχεία που βρίσκονται σε αυτό και όλα τα άλλα.

source: Update the set, removing elements found in others.
el: Ενημερώνει το σύνολο, αφαιρώντας στοιχεία που βρίσκονται σε άλλα.

source: Update the set, keeping only elements found in either set, but not in both.
el: Ενημερώνει το σύνολο, διατηρώντας μόνο τα στοιχεία που βρίσκονται σε κάθε σύνολο, αλλά όχι και στα δύο.

source: Add element *elem* to the set.
el: Προσθέτει το στοιχείο *elem* στο σύνολο.

source: Remove element *elem* from the set. Raises :exc:`KeyError` if *elem* is not contained in the set.
el: Αφαιρεί το στοιχείο *elem* από το σύνολο. Κάνει raise τη :exc:`KeyError` εάν το *elem* δεν περιέχεται στο σύνολο.

source: Remove element *elem* from the set if it is present.
el: Αφαιρεί το στοιχείο *elem* από το σύνολο εάν υπάρχει.

source: Remove and return an arbitrary element from the set. Raises :exc:`KeyError` if the set is empty.
el: Αφαιρεί και επιστρέφει ένα αυθαίρετο στοιχείο από το σύνολο. Κάνει raise μια :exc:`KeyError` εάν το σύνολο είναι κενό.

source: Remove all elements from the set.
el: Αφαιρεί όλα τα στοιχεία από το σύνολο (set).

source: Note, the non-operator versions of the :meth:`update`, :meth:`intersection_update`, :meth:`difference_update`, and :meth:`symmetric_difference_update` methods will accept any iterable as an argument.
el: Σημείωση, οι εκδόσεις μη-τελεστή μεθόδων :meth:`update`, :meth:`intersection_update`, :meth:`difference_update`, και :meth:`symmetric_difference_update` θα δέχονται οποιοδήποτε επαναλαμβανόμενο στοιχείο ως όρισμα.

source: Note, the *elem* argument to the :meth:`~object.__contains__`, :meth:`remove`, and :meth:`discard` methods may be a set. To support searching for an equivalent frozenset, a temporary one is created from *elem*.
el: Σημείωση, το όρισμα *elem* για τις μεθόδους :meth:`~object.__contains__`, :meth:`remove`, και :meth:`discard` μπορεί να είναι ένα σύνολο. Για την υποστήριξη της αναζήτησης για ένα ισοδύναμο παγωμένο σύνολο (frozenset), ένα προσωρινό δημιουργείται από το *elem*.

source: Mapping Types --- :class:`dict`
el: Τύποι αντιστοίχισης --- :class:`dict`

source: A :term:`mapping` object maps :term:`hashable` values to arbitrary objects. Mappings are mutable objects. There is currently only one standard mapping type, the :dfn:`dictionary`. (For other containers see the built-in :class:`list`, :class:`set`, and :class:`tuple` classes, and the :mod:`collections` module.)
el: Ένα αντικείμενο :term:`mapping` αντιστοιχίζει :term:`hashable` τιμές σε αυθαίρετα αντικείμενα. Οι αντιστοιχίσεις είναι μεταβλητά αντικείμενα. Υπάρχει επί του παρόντος μόνο ένα τυπικός τύπο αντιστοίχισης, το :dfn:`dictionary`. (Για άλλα containers δείτε τις ενσωματωμένες (built-in) :class:`list`, :class:`set`, και :class:`tuple` κλάσεις, και το module :mod:`collections`.)

source: A dictionary's keys are *almost* arbitrary values. Values that are not :term:`hashable`, that is, values containing lists, dictionaries or other mutable types (that are compared by value rather than by object identity) may not be used as keys. Values that compare equal (such as ``1``, ``1.0``, and ``True``) can be used interchangeably to index the same dictionary entry.
el: Τα κλειδιά ενός λεξικού είναι *σχεδόν* αυθαίρετες τιμές. Οι τιμές που δεν είναι :term:`hashable`, δηλαδή, τιμές που περιέχουν λίστες, λεξικά ή άλλους μεταβλητούς τύπους (που συγκρίνονται βάσει τιμής και όχι βάσει ταυτότητας αντικειμένου) δεν μπορούν να χρησιμοποιηθούν ως κλειδιά. Οι τιμές που συγκρίνονται ίσες (όπως ``1``, ``1.0``, και ``True``) μπορούν να χρησιμοποιηθούν εναλλακτικά για το index της ίδιας καταχώρισης λεξικού.

source: Return a new dictionary initialized from an optional positional argument and a possibly empty set of keyword arguments.
el: Επιστρέφει ένα νέο λεξικό που έχει αρχικοποιηθεί από ένα προαιρετικό όρισμα θέσης και ένα πιθανό κενό σύνολο ορισμάτων λέξεων-κλειδιών.

source: Dictionaries can be created by several means:
el: Τα λεξικά μπορούν να δημιουργηθούν με διάφορους τρόπους:

source: Use a comma-separated list of ``key: value`` pairs within braces: ``{'jack': 4098, 'sjoerd': 4127}`` or ``{4098: 'jack', 4127: 'sjoerd'}``
el: Χρησιμοποιήστε μια λίστα διαχωρισμένων με κόμματα ζευγών ``key: value`` μέσα σε αγκύλες: ``{'jack': 4098, 'sjoerd': 4127}`` or ``{4098: 'jack', 4127: 'sjoerd'}``

source: Use a dict comprehension: ``{}``, ``{x: x ** 2 for x in range(10)}``
el: Χρησιμοποιήστε ένα comprehension λεξικού: ``{}``, ``{x: x ** 2 for x in range(10)}``

source: Use the type constructor: ``dict()``, ``dict([('foo', 100), ('bar', 200)])``, ``dict(foo=100, bar=200)``
el: Χρησιμοποιήστε τον κατασκευαστή τύπου: ``dict()``, ``dict([('foo', 100), ('bar', 200)])``, ``dict(foo=100, bar=200)``

source: If no positional argument is given, an empty dictionary is created. If a positional argument is given and it defines a ``keys()`` method, a dictionary is created by calling :meth:`~object.__getitem__` on the argument with each returned key from the method. Otherwise, the positional argument must be an :term:`iterable` object. Each item in the iterable must itself be an iterable with exactly two elements. The first element of each item becomes a key in the new dictionary, and the second element the corresponding value. If a key occurs more than once, the last value for that key becomes the corresponding value in the new dictionary.
el: Εάν δεν δοθεί όρισμα θέσης, δημιουργείται ένα κενό λεξικό. Εάν δοθεί ένα όρισμα θέσης και ορίζει μια μέθοδο ``keys()``, δημιουργείται ένα λεξικό καλώντας το :meth:`~object.__getitem__` στο όρισμα με κάθε κλειδί που επιστρέφεται από τη μέθοδο. Διαφορετικά, το όρισμα θέσης πρέπει να είναι ένα αντικείμενο :term:`iterable`. Κάθε στοιχείο στο iterable πρέπει από μόνο του να είναι ένας iterable με ακριβώς δύο στοιχεία. Το πρώτο στοιχείο κάθε στοιχείου γίνεται κλειδί στο νέο λεξικό και το δεύτερο στοιχείο η αντίστοιχη τιμή. Εάν ένα κλειδί εμφανίζεται περισσότερες από μία φορές, η τελευταία τιμή για αυτό το κλειδί γίνεται η αντίστοιχη τιμή στο νέο λεξικό.

source: If keyword arguments are given, the keyword arguments and their values are added to the dictionary created from the positional argument. If a key being added is already present, the value from the keyword argument replaces the value from the positional argument.
el: Εάν δίνονται ορίσματα λέξης-κλειδιού, τα ορίσματα λέξης-κλειδιού και οι τιμές τους προστίθενται στο λεξικό που δημιουργήθηκε από το όρισμα θέσης. Εάν υπάρχει ήδη ένα κλειδί που προστίθεται, η τιμή από το όρισμα λέξης-κλειδιού αντικαθιστά την τιμή από το όρισμα θέσης.

source: Providing keyword arguments as in the first example only works for keys that are valid Python identifiers. Otherwise, any valid keys can be used.
el: Η παροχή ορισμάτων λέξεων-κλειδιών όπως στο πρώτο παράδειγμα λειτουργεί μόνο για κλειδιά που είναι έγκυρα αναγνωριστικά Python. Διαφορετικά, μπορούν να χρησιμοποιηθούν οποιαδήποτε έγκυρα κλειδιά.

source: Dictionaries compare equal if and only if they have the same ``(key, value)`` pairs (regardless of ordering). Order comparisons ('<', '<=', '>=', '>') raise :exc:`TypeError`. To illustrate dictionary creation and equality, the following examples all return a dictionary equal to ``{"one": 1, "two": 2, "three": 3}``::
el: Τα λεξικά συγκρίνονται ως ίσα εάν και μόνο εάν έχουν τα ίδια ζεύγη ``(key, value)`` (ανεξάρτητα από τη σειρά). Οι συγκρίσεις διάταξης ('<', '<=', '>=', '>') κάνουν raise την :exc:`TypeError`. Για να επεξηγηθεί η δημιουργία λεξικού και η ισότητα, τα ακόλουθα παραδείγματα επιστρέφουν όλα ένα λεξικό ίσο με ``{"one": 1, "two": 2, "three": 3}``::

source: Dictionaries preserve insertion order. Note that updating a key does not affect the order. Keys added after deletion are inserted at the end. ::
el: Τα λεξικά διατηρούν τη σειρά εισαγωγής. Σημειώστε ότι η ενημέρωση ενός κλειδιού δεν επηρεάζει τη σειρά. Τα κλειδιά που προστέθηκαν μετά τη διαγραφή εισάγονται στο τέλος. ::

source: Dictionary order is guaranteed to be insertion order. This behavior was an implementation detail of CPython from 3.6.
el: Η σειρά λεξικού είναι εγγυημένη ότι είναι η σειρά εισαγωγής. Αυτή η συμπεριφορά ήταν μια λεπτομέρεια υλοποίηση της CPython από την έκδοση 3.6.

source: These are the operations that dictionaries support (and therefore, custom mapping types should support too):
el: Αυτές είναι οι λειτουργίες που υποστηρίζουν τα λεξικά (και επομένως, θα πρέπει να υποστηρίζουν και προσαρμοσμένους τύπους αντιστοίχισης επίσης):

source: Return a list of all the keys used in the dictionary *d*.
el: Επιστρέφει μια λίστα με όλα τα κλειδιά που χρησιμοποιούνται στο λεξικό *d*.

source: Return the number of items in the dictionary *d*.
el: Επιστρέφει τον αριθμό των στοιχείων στο λεξικό *d*.

source: Return the item of *d* with key *key*. Raises a :exc:`KeyError` if *key* is not in the map.
el: Επιστρέφει το στοιχείο του *d* με το κλειδί *key*. Κάνει raise μια :exc:`KeyError` εάν το *key* δεν υπάρχει για να αντιστοιχηθεί.

source: If a subclass of dict defines a method :meth:`__missing__` and *key* is not present, the ``d[key]`` operation calls that method with the key *key* as argument. The ``d[key]`` operation then returns or raises whatever is returned or raised by the ``__missing__(key)`` call. No other operations or methods invoke :meth:`__missing__`. If :meth:`__missing__` is not defined, :exc:`KeyError` is raised. :meth:`__missing__` must be a method; it cannot be an instance variable::
el: Εάν μια υποκλάση ενός λεξικού ορίζει μια μέθοδο :meth:`__missing__` και το *key* δεν υπάρχει, η λειτουργία ``d[key]`` καλεί αυτήν την μέθοδο με το κλειδί *key* ως όρισμα. Στη συνέχεια, η λειτουργία ``d[key]`` επιστρέφει ή κάνει raise ό, τι επιστρέφεται ή γίνεται raise από την κλήση ``__missing__(key)``. Καμία άλλη λειτουργία ή μέθοδος δεν επικαλεί την :meth:`__missing__`. Εάν το :meth:`__missing__` δεν έχει οριστεί, γίνεται raise :exc:`KeyError`. To :meth:`__missing__` πρέπει να είναι μέθοδος∙ δεν μπορεί να είναι ένα στιγμιότυπο μεταβλητής::

source: The example above shows part of the implementation of :class:`collections.Counter`. A different ``__missing__`` method is used by :class:`collections.defaultdict`.
el: Το παραπάνω παράδειγμα δείχνει μέρος της υλοποίησης του :class:`collections.Counter`. Μια διαφορετική μέθοδος ``__missing__`` χρησιμοποιείται από την :class:`collections.defaultdict`.

source: Set ``d[key]`` to *value*.
el: Ορίζει το ``d[key]`` στο *value*.

source: Remove ``d[key]`` from *d*. Raises a :exc:`KeyError` if *key* is not in the map.
el: Αφαιρεί το ``d[key]`` από το *d*. Κάνει raise ένα :exc:`KeyError` εάν το *key* δεν υπάρχει για αντιστοίχιση.

source: Return ``True`` if *d* has a key *key*, else ``False``.
el: Επιστρέφει ``True`` εάν το *d* έχει ένα κλειδί *key*, διαφορετικά ``False``.

source: Equivalent to ``not key in d``.
el: Ισοδυναμεί με ``not key in d``.

source: Return an iterator over the keys of the dictionary. This is a shortcut for ``iter(d.keys())``.
el: Επιστρέφει έναν iterator πάνω από τα κλειδιά του λεξικού. Αυτή είναι μια συντόμευση για ``iter(d.keys())``.

source: Remove all items from the dictionary.
el: Αφαιρεί όλα τα στοιχεία από το λεξικό.

source: Return a shallow copy of the dictionary.
el: Επιστρέφει ένα ρηχό αντίγραφο του λεξικού.

source: Create a new dictionary with keys from *iterable* and values set to *value*.
el: Δημιουργεί ένα νέο λεξικό με κλειδιά από το *iterable* και τιμές ως *value*.

source: :meth:`fromkeys` is a class method that returns a new dictionary. *value* defaults to ``None``. All of the values refer to just a single instance, so it generally doesn't make sense for *value* to be a mutable object such as an empty list. To get distinct values, use a :ref:`dict comprehension <dict>` instead.
el: Το :meth:`fromkeys` είναι μια μέθοδος κλάσης που επιστρέφει ένα νέο λεξικό. Η τιμή *value* ορίζεται από προεπιλογή σε ``None``. Όλες οι τιμές αναφέρονται σε ένα μόνο στιγμιότυπο, επομένως γενικά δεν έχει νόημα για το *value* να είναι μεταβλητό αντικείμενο, όπως μια κενή λίστα. Για να λάβετε διαφορετικές τιμές, χρησιμοποιήστε αντ' αυτού ένα :ref:`dict comprehension <dict>`.

source: Return the value for *key* if *key* is in the dictionary, else *default*. If *default* is not given, it defaults to ``None``, so that this method never raises a :exc:`KeyError`.
el: Επιστρέφει την τιμή για το *key* εάν το *key* είναι στο λεξικό, αλλιώς *default*. Εάν το *default* δεν δίνεται, ορίζεται από προεπιλογή σε ``None``, έτσι ώστε αυτή η μέθοδος να μην κάνει raise μια :exc:`KeyError`.

source: Return a new view of the dictionary's items (``(key, value)`` pairs). See the :ref:`documentation of view objects <dict-views>`.
el: Επιστρέφει μια νέα όψη των στοιχείων του λεξικού (``(key, value)`` ζεύγη). Δείτε την :ref:`documentation of view objects <dict-views>`.

source: Return a new view of the dictionary's keys. See the :ref:`documentation of view objects <dict-views>`.
el: Επιστρέφει μια νέα όψη των κλειδιών του λεξικού. Δείτε το :ref:`documentation of view objects <dict-views>`.

source: If *key* is in the dictionary, remove it and return its value, else return *default*. If *default* is not given and *key* is not in the dictionary, a :exc:`KeyError` is raised.
el: Εάν το *key* βρίσκεται στο λεξικό, αφαιρείται και επιστρέφει την τιμή του, διαφορετικά επιστρέφει *default*. Εάν *default* δεν δίνεται και το *key* δεν είναι στο λεξικό, γίνεται raise ένα :exc:`KeyError`.

source: Remove and return a ``(key, value)`` pair from the dictionary. Pairs are returned in :abbr:`LIFO (last-in, first-out)` order.
el: Αφαιρεί και επιστρέφει ένα ζεύγος ``(key, value)`` από το λεξικό. Τα ζεύγη επιστρέφονται με τη σειρά :abbr:`LIFO (last-in, first-out)`.

source: :meth:`popitem` is useful to destructively iterate over a dictionary, as often used in set algorithms. If the dictionary is empty, calling :meth:`popitem` raises a :exc:`KeyError`.
el: Η μέθοδος :meth:`popitem` είναι χρήσιμη για καταστροφική επανάληψη σε ένα λεξικό, όπως χρησιμοποιείται συχνά σε αλγόριθμους συνόλου. Εάν το λεξικό είναι κενό, η κλήση της :meth:`popitem` κάνει raise ένα :exc:`KeyError`.

source: LIFO order is now guaranteed. In prior versions, :meth:`popitem` would return an arbitrary key/value pair.
el: Η σειρά LIFO είναι πλέον εγγυημένη. Σε προηγούμενες εκδόσεις, η :meth:`popitem` επιστρέφει ένα αυθαίρετο ζεύγος κλειδιού/τιμής.

source: Return a reverse iterator over the keys of the dictionary. This is a shortcut for ``reversed(d.keys())``.
el: Επιστρέφει έναν αντίστροφο iterator πάνω από τα κλειδιά του λεξικού. Αυτή είναι μια συντόμευση για ``reversed(d.keys())``.

source: If *key* is in the dictionary, return its value. If not, insert *key* with a value of *default* and return *default*. *default* defaults to ``None``.
el: Εάν το *key* βρίσκεται στο λεξικό, επιστρέφει την τιμή του. Εάν όχι, εισάγετε το *key* με τιμή *default* και επιστρέφει *default*. Το *default* από προεπιλογή είναι ``None``.

source: Update the dictionary with the key/value pairs from *other*, overwriting existing keys. Return ``None``.
el: Ενημερώνει το λεξικό με τα ζεύγη κλειδιών/τιμών από το *other*, αντικαθιστώντας τα υπάρχοντα κλειδιά. Επιστρέφει ``None``.

source: :meth:`update` accepts either another object with a ``keys()`` method (in which case :meth:`~object.__getitem__` is called with every key returned from the method) or an iterable of key/value pairs (as tuples or other iterables of length two). If keyword arguments are specified, the dictionary is then updated with those key/value pairs: ``d.update(red=1, blue=2)``.
el: Η :meth:`update` δέχεται είτε ένα άλλο αντικείμενο με τη μέθοδο ``keys()`` (στην περίπτωση αυτή το :meth:`~object.__getitem__` καλείται με κάθε κλειδί που επιστρέφεται από τη μέθοδο) είτε ένα iterable από ζεύγη κλειδιών/τιμών (ως πλειάδες ή άλλα iterables μήκους δύο). Εάν καθορίζονται ορίσματα λέξεων-κλειδιών, το λεξικό ενημερώνεται στη συνέχεια με αυτά τα ζεύγη κλειδιών/τιμών: ``d.update(red=1, blue=2)``.

source: Return a new view of the dictionary's values. See the :ref:`documentation of view objects <dict-views>`.
el: Επιστρέφει μια νέα όψη των τιμών του λεξικού. Δείτε την :ref:`documentation of view objects <dict-views>`.

source: An equality comparison between one ``dict.values()`` view and another will always return ``False``. This also applies when comparing ``dict.values()`` to itself::
el: Μια σύγκριση ισότητας μεταξύ μιας όψης ``dict.values()`` και μιας άλλης θα επιστρέφει πάντα ``False``. Αυτό ισχύει επίσης όταν συγκρίνετε το ``dict.values()`` με τον εαυτό της::

source: Create a new dictionary with the merged keys and values of *d* and *other*, which must both be dictionaries. The values of *other* take priority when *d* and *other* share keys.
el: Δημιουργεί ένα νέο λεξικό με τα συγχωνευμένα κλειδιά και τις τιμές των *d* και *other*, τα οποία πρέπει να είναι και τα δύο λεξικά. Οι τιμές του *other* έχουν προτεραιότητα όταν τα κλειδιά των *d* και *other* είναι κοινά.

source: Update the dictionary *d* with keys and values from *other*, which may be either a :term:`mapping` or an :term:`iterable` of key/value pairs. The values of *other* take priority when *d* and *other* share keys.
el: Ενημερώνει το λεξικό *d* με κλειδιά και τιμές από το *other*, που μπορεί να είναι είτε :term:`mapping` είτε :term:`iterable` ζευγάρι κλειδιών/τιμών. Οι τιμές του *other* έχουν προτεραιότητα όταν τα κλειδιά των το *d* και *other* είναι κοινά.

source: Dictionaries and dictionary views are reversible. ::
el: Τα λεξικά και οι όψεις λεξικών είναι αναστρέψιμες. ::

source: Dictionaries are now reversible.
el: Τα λεξικά είναι πλέον αναστρέψιμα.

source: :class:`types.MappingProxyType` can be used to create a read-only view of a :class:`dict`.
el: Η :class:`types.MappingProxyType` μπορεί να χρησιμοποιηθεί για τη δημιουργία μιας όψης μόνο για ανάγνωση μιας :class:`dict`.

source: Dictionary view objects
el: Αντικείμενα όψης λεξικού

source: The objects returned by :meth:`dict.keys`, :meth:`dict.values` and :meth:`dict.items` are *view objects*. They provide a dynamic view on the dictionary's entries, which means that when the dictionary changes, the view reflects these changes.
el: Τα αντικείμενα που επιστρέφονται από τις :meth:`dict.keys`, :meth:`dict.values` and :meth:`dict.items` είναι *όψεις αντικειμένων (view objects)*. Παρέχουν μια δυναμική όψη στις εγγραφές του λεξικού, που σημαίνει ότι όταν αλλάζει το λεξικό, η όψη αντικατοπτρίζει αυτές τις αλλαγές.

source: Dictionary views can be iterated over to yield their respective data, and support membership tests:
el: Οι όψεις λεξικού μπορούν να γίνουν iterate για την απόδοση των αντίστοιχων δεδομένων τους και την υποστήριξη ελέγχων για το αν είναι μέρος του:

source: Return the number of entries in the dictionary.
el: Επιστρέφει τον αριθμό των καταχωρήσεων στο λεξικό.

source: Return an iterator over the keys, values or items (represented as tuples of ``(key, value)``) in the dictionary.
el: Επιστρέφει έναν iterator πάνω στα κλειδιά, τις τιμές ή τα στοιχεία (που αντιπροσωπεύονται ως πλειάδες (tuples) του ``(key, value)`` στο λεξικό.

source: Keys and values are iterated over in insertion order. This allows the creation of ``(value, key)`` pairs using :func:`zip`: ``pairs = zip(d.values(), d.keys())``. Another way to create the same list is ``pairs = [(v, k) for (k, v) in d.items()]``.
el: Τα κλειδιά και οι τιμές επαναλαμβάνονται με την σειρά εισαγωγής. Αυτό επιτρέπει τη δημιουργία ζευγών ``(value, key)`` χρησιμοποιώντας τη :func:`zip`: ``pairs = zip(d.values(), d.keys())``. Ένας άλλος τρόπος είναι να δημιουργήσετε την ίδια λίστα είναι ``pairs = [(v, k) for (k, v) in d.items()]``.

source: Iterating views while adding or deleting entries in the dictionary may raise a :exc:`RuntimeError` or fail to iterate over all entries.
el: Το iterate όψεων κατά την προσθήκη ή τη διαγραφή καταχωρήσεων στο λεξικό μπορεί να κάνει raise μια :exc:`RuntimeError` ή να αποτύχει το iterate σε όλες τις καταχωρήσεις.

source: Dictionary order is guaranteed to be insertion order.
el: Η σειρά λεξικού είναι εγγυημένη σειρά εισαγωγής.

source: Return ``True`` if *x* is in the underlying dictionary's keys, values or items (in the latter case, *x* should be a ``(key, value)`` tuple).
el: Επιστρέφει ``True`` εάν το *x* βρίσκεται στα κλειδιά του λεξικού, τις τιμές ή τα στοιχεία του υποκείμενου λεξικού (στην τελευταία περίπτωση, το *x* θα πρέπει να είναι μια ``(key, value)`` πλειάδα (tuple)).

source: Return a reverse iterator over the keys, values or items of the dictionary. The view will be iterated in reverse order of the insertion.
el: Επιστρέφει έναν αντίστροφο iterator πάνω στα κλειδιά, τις τιμές ή τα στοιχεία του λεξικού. Η όψη θα γίνει iterate με την αντίστροφη σειρά από την εισαγωγή.

source: Dictionary views are now reversible.
el: Οι όψεις λεξικού είναι πλέον αναστρέψιμες.

source: Return a :class:`types.MappingProxyType` that wraps the original dictionary to which the view refers.
el: Επιστρέφει μια :class:`types.MappingProxyType` που αναδιπλώνει το αρχικό λεξικό στο οποίο αναφέρεται η όψη.
