Repository: thepetk/python-docs-gr
Catalog: library/stdtypes.po
Languages: el

source: Python's :term:`generator`\s provide a convenient way to implement the iterator protocol. If a container object's :meth:`~object.__iter__` method is implemented as a generator, it will automatically return an iterator object (technically, a generator object) supplying the :meth:`~iterator.__iter__` and :meth:`~generator.__next__` methods. More information about generators can be found in :ref:`the documentation for the yield expression <yieldexpr>`.
el: Οι :term:`generator`\s της Python παρέχουν έναν βολικό τρόπο για να υλοποιήσετε το iterator πρωτόκολλο. Εάν η μέθοδος :meth:`~object.__iter__` ενός container αντικειμένου είναι υλοποιημένη ως generator, θα επιστρέψει αυτόματα ένα αντικείμενο iterator (τεχνικά, ένα αντικείμενο generator) που παρέχει τις :meth:`~iterator.__iter__` και :meth:`~generator.__next__` μεθόδους. Περισσότερες πληροφορίες σχετικά με τους generators μπορείτε να βρείτε στην :ref:`the documentation for the yield expression <yieldexpr>`.

source: Sequence Types --- :class:`list`, :class:`tuple`, :class:`range`
el: Τύποι Ακολουθίας (Sequence) --- :class:`list`, :class:`tuple`, :class:`range`

source: There are three basic sequence types: lists, tuples, and range objects. Additional sequence types tailored for processing of :ref:`binary data <binaryseq>` and :ref:`text strings <textseq>` are described in dedicated sections.
el: Υπάρχουν τρεις βασικοί τύποι ακολουθιών: lists (λίστες), tuples (πλειάδες) και range objects (αντικείμενα εύρους). Πρόσθετοι τύποι ακολουθίας προσαρμοσμένοι για την επεξεργασία :ref:`binary data <binaryseq>` και :ref:`text strings <textseq>` περιγράφονται σε ειδικές ενότητες.

source: Common Sequence Operations
el: Κοινές Λειτουργίες Ακολουθιών (Sequences)

source: The operations in the following table are supported by most sequence types, both mutable and immutable. The :class:`collections.abc.Sequence` ABC is provided to make it easier to correctly implement these operations on custom sequence types.
el: Οι λειτουργίες του παρακάτω πίνακα υποστηρίζονται από τους περισσότερους τύπους ακολουθιών, τόσο μεταβλητών (mutable) όσο και αμετάβλητων (immutable). Η :class:`collections.abc.Sequence` ABC παρέχεται για να διευκολύνει τη σωστή υλοποίηση αυτών των πράξεων σε προσαρμοσμένους τύπους ακολουθίας.

source: This table lists the sequence operations sorted in ascending priority. In the table, *s* and *t* are sequences of the same type, *n*, *i*, *j* and *k* are integers and *x* is an arbitrary object that meets any type and value restrictions imposed by *s*.
el: Αυτός ο πίνακας απαριθμεί τις λειτουργίες ακολουθίας ταξινομημένες κατά αύξουσα προτεραιότητα. Στον πίνακα, τα *s* και *t* είναι ακολουθίες του ίδιου τύπου, τα *n*, *i*, *j* και *k* είναι ακέραιοι αριθμοί και το *x* είναι ένα αυθαίρετο αντικείμενο που πληροί οποιονδήποτε τύπο και περιορισμούς τιμής που επιβάλλονται από το *s*.

source: The ``in`` and ``not in`` operations have the same priorities as the comparison operations. The ``+`` (concatenation) and ``*`` (repetition) operations have the same priority as the corresponding numeric operations. [3]_
el: Οι πράξεις ``in`` και ``not in`` έχουν τις ίδιες προτεραιότητες με τις πράξεις σύγκρισης. Οι πράξεις ``+`` (συνένωση) και ``*`` (επανάληψη) έχουν την ίδια προτεραιότητα με τις αντίστοιχες αριθμητικές πράξεις. [3]_

source: ``True`` if an item of *s* is equal to *x*, else ``False``
el: ``True`` αν ένα στοιχείο του *s* είναι ίσο με το *x*, αλλιώς ``False``

source: ``False`` if an item of *s* is equal to *x*, else ``True``
el: ``False`` αν ένα στοιχείο του *s* είναι ίσο με το *x*, αλλιώς ``True``

source: the concatenation of *s* and *t*
el: η συνένωση του *s* και *t*

source: ``s * n`` or ``n * s``
el: ``s * n`` ή ``n * s``

source: equivalent to adding *s* to itself *n* times
el: ίσο με την πρόσθεση του *s* στον εαυτό του *n* φορές

source: *i*\ th item of *s*, origin 0
el: *i*\ ο στοιχείο του *s*, αρχή το 0

source: slice of *s* from *i* to *j*
el: slice (υποσύνολο) του *s* από το *i* μέχρι το *j*

source: slice of *s* from *i* to *j* with step *k*
el: slice (υποσύνολο) του *s* από το *i* μέχρι το *j* με βήμα *k*

source: length of *s*
el: μήκος του *s*

source: smallest item of *s*
el: μικρότερο αντικείμενο του *s*

source: largest item of *s*
el: μεγαλύτερο αντικείμενο του *s*

source: index of the first occurrence of *x* in *s* (at or after index *i* and before index *j*)
el: δείκτης της πρώτης εμφάνισης του *x* στο *s* (μετά από τον ή στον δείκτη *i* και πριν από το δείκτη *j*)

source: total number of occurrences of *x* in *s*
el: συνολικές εμφανίσεις του *x* στο *s*

source: Sequences of the same type also support comparisons. In particular, tuples and lists are compared lexicographically by comparing corresponding elements. This means that to compare equal, every element must compare equal and the two sequences must be of the same type and have the same length. (For full details see :ref:`comparisons` in the language reference.)
el: Οι ακολουθίες (sequences) του ίδιου τύπου υποστηρίζουν επίσης συγκρίσεις. Ειδικότερα, τα tuples (πλειάδες) και οι λίστες συγκρίνονται λεξικογραφικά συγκρίνοντας τα αντίστοιχα στοιχεία. Αυτό σημαίνει ότι για να συγκρίνουμε ίσα, κάθε στοιχείο πρέπει να συγκρίνεται ως ίσο με το αντίστοιχό του, οι δύο ακολουθίες πρέπει να είναι του ίδιου τύπου και να έχουν το ίδιο μήκος. (Για πλήρεις λεπτομέρειες δείτε την αναφορά :ref:`comparisons`.)

source: Forward and reversed iterators over mutable sequences access values using an index. That index will continue to march forward (or backward) even if the underlying sequence is mutated. The iterator terminates only when an :exc:`IndexError` or a :exc:`StopIteration` is encountered (or when the index drops below zero).
el: Εμπρόσθιοι και αντίστροφοι iterators πάνω σε μεταβλητές ακολουθίες έχουν πρόσβαση σε τιμές χρησιμοποιώντας ένα δείκτη. Αυτός ο δείκτης θα συνεχίσει να βαδίζει προς τα εμπρός (ή προς τα πίσω) ακόμα και αν η υποκείμενη ακολουθία μεταλλάσσεται. Ο iterator τερματίζει μόνο όταν ένα :exc:`IndexError` ή ένα :exc:`StopIteration` γίνει raise (ή όταν ο δείκτης πέσει κάτω από το μηδέν).

source: While the ``in`` and ``not in`` operations are used only for simple containment testing in the general case, some specialised sequences (such as :class:`str`, :class:`bytes` and :class:`bytearray`) also use them for subsequence testing::
el: Ενώ οι πράξεις ``in`` και ``not in`` χρησιμοποιούνται γενικά μόνο για απλό έλεγχο containment (αν στοιχείο περιέχεται σε μια δομή), ορισμένες εξειδικευμένες ακολουθίες (όπως όπως οι :class:`str`, :class:`bytes` και :class:`bytearray`) τις χρησιμοποιούν επίσης για subsequence testing (έλεγχο υποακολουθίας)::

source: Values of *n* less than ``0`` are treated as ``0`` (which yields an empty sequence of the same type as *s*). Note that items in the sequence *s* are not copied; they are referenced multiple times. This often haunts new Python programmers; consider::
el: Τιμές του *n* μικρότερες από το ``0`` αντιμετωπίζονται ως ``0`` (που δίνει μια κενή ακολουθία του ίδιου τύπου με *s*). Σημειώστε ότι τα στοιχεία της ακολουθίας *s* δεν αντιγράφονται· αναφέρονται πολλές φορές. Αυτό συχνά στοιχειώνει τα άτομα που ξεκινούν με Python- σκεφτείτε::

source: What has happened is that ``[[]]`` is a one-element list containing an empty list, so all three elements of ``[[]] * 3`` are references to this single empty list. Modifying any of the elements of ``lists`` modifies this single list. You can create a list of different lists this way::
el: Αυτό που συνέβη είναι ότι το ``[[]]`` είναι μια λίστα ενός στοιχείου που περιέχει μία κενή λίστα, οπότε και τα τρία στοιχεία της ``[[]] * 3`` είναι αναφορές σε αυτή τη μία κενή λίστα. Η τροποποίηση οποιουδήποτε από τα στοιχεία της ``lists`` τροποποιεί αυτή τη μοναδική λίστα. Μπορείτε να δημιουργήσετε μια λίστα από διαφορετικές λίστες με αυτόν τον τρόπο::

source: Further explanation is available in the FAQ entry :ref:`faq-multidimensional-list`.
el: Περαιτέρω επεξήγηση είναι διαθέσιμη στο λήμμα FAQ :ref:`faq-multidimensional-list`.

source: If *i* or *j* is negative, the index is relative to the end of sequence *s*: ``len(s) + i`` or ``len(s) + j`` is substituted. But note that ``-0`` is still ``0``.
el: Εάν το *i* ή το *j* είναι αρνητικό, ο δείκτης είναι σχετικός με το τέλος της ακολουθίας *s*: το ``len(s) + i`` ή το ``len(s) + j`` αντικαθίσταται. Σημειώστε όμως ότι το ``-0`` εξακολουθεί να είναι ``0``.

source: The slice of *s* from *i* to *j* is defined as the sequence of items with index *k* such that ``i <= k < j``. If *i* or *j* is greater than ``len(s)``, use ``len(s)``. If *i* is omitted or ``None``, use ``0``. If *j* is omitted or ``None``, use ``len(s)``. If *i* is greater than or equal to *j*, the slice is empty.
el: Το υποσύνολο (slice) του *s* από το *i* έως το *j* ορίζεται ως η ακολουθία στοιχείων με δείκτη *k* τέτοια ώστε ``i <= k < j```. Εάν το *i* ή το *j* είναι μεγαλύτερο από το ``len(s)``, χρησιμοποιήστε το ``len(s)``. Αν το *i* παραλείπεται ή είναι ``None``, χρησιμοποιήστε ``0``. Αν το *j* παραλείπεται ή είναι ``μηδέν``, χρησιμοποιήστε το ``len(s)``. Εάν το *i* είναι μεγαλύτερο από ή ίσο με το *j*, το υποσύνολο (slice) είναι κενό.

source: The slice of *s* from *i* to *j* with step *k* is defined as the sequence of items with index ``x = i + n*k`` such that ``0 <= n < (j-i)/k``. In other words, the indices are ``i``, ``i+k``, ``i+2*k``, ``i+3*k`` and so on, stopping when *j* is reached (but never including *j*). When *k* is positive, *i* and *j* are reduced to ``len(s)`` if they are greater. When *k* is negative, *i* and *j* are reduced to ``len(s) - 1`` if they are greater. If *i* or *j* are omitted or ``None``, they become "end" values (which end depends on the sign of *k*). Note, *k* cannot be zero. If *k* is ``None``, it is treated like ``1``.
el: Το υποσύνολο (slice) του *s* από *i* έως *j* με βήμα *k* ορίζεται ως η ακολουθία των στοιχείων με δείκτη ``x = i + n*k`` τέτοια ώστε ``0 <= n < (j-i)/k``. Με άλλα λόγια, οι δείκτες είναι ``i``, ``i+k``, ``i+2*k``, ``i+3*k`` και ούτω καθεξής, σταματώντας όταν φτάσουμε στο *j* (αλλά ποτέ δεν περιλαμβάνει το *j*). Όταν το *k* είναι θετικό, τα *i* και *j* μειώνονται σε ``len(s)`` αν είναι μεγαλύτερα. Όταν το *k* είναι αρνητικό, τα *i* και *j* μειώνονται σε ``len(s) - 1`` αν είναι μεγαλύτερα. Εάν τα *i* ή *j* παραλείπονται ή είναι ``None``, γίνονται τιμές "end" (το τέλος εξαρτάται από το πρόσημο του *k*). Σημειώστε ότι το *k* δεν μπορεί να είναι μηδέν. Εάν το *k* είναι ``None``, αντιμετωπίζεται όπως το ``1``.

source: Concatenating immutable sequences always results in a new object. This means that building up a sequence by repeated concatenation will have a quadratic runtime cost in the total sequence length. To get a linear runtime cost, you must switch to one of the alternatives below:
el: Η συνένωση αμετάβλητων ακολουθιών (immutable sequences) οδηγεί πάντα σε ένα νέο αντικείμενο. Αυτό σημαίνει ότι η δημιουργία μιας ακολουθίας με επαναλαμβανόμενη συνένωση θα έχει τετραγωνικό κόστος χρόνου εκτέλεσης (runtime cost) στο συνολικό μήκος της ακολουθίας. Για να πάρετε ένα γραμμικό κόστος χρόνου εκτέλεσης (runtime cost), πρέπει να μεταβείτε σε μία από τις παρακάτω εναλλακτικές λύσεις::

source: if concatenating :class:`str` objects, you can build a list and use :meth:`str.join` at the end or else write to an :class:`io.StringIO` instance and retrieve its value when complete
el: αν συνενώνεται αντικείμενα :class:`str`, μπορείτε να δημιουργήσετε μια λίστα και να χρησιμοποιήσετε την :meth:`str.join` στο τέλος ή αλλιώς να γράψετε σε ένα :class:`io.StringIO` instance και ανακτήσετε την τιμή της όταν ολοκληρωθεί

source: if concatenating :class:`bytes` objects, you can similarly use :meth:`bytes.join` or :class:`io.BytesIO`, or you can do in-place concatenation with a :class:`bytearray` object. :class:`bytearray` objects are mutable and have an efficient overallocation mechanism
el: αν συνενώνεται αντικείμενα :class:`bytes`, μπορείτε να χρησιμοποιήσετε παρόμοια τη μέθοδο :meth:`bytes.join` ή :class:`io.BytesIO`, ή μπορείτε να κάνετε in-place συνένωση (concatenation) με ένα :class:`bytearray` αντικείμενο. Τα αντικείμενα :class:`bytearray` είναι μεταβλητά και έχουν έναν αποτελεσματικό μηχανισμό συνολικής κατανομής (overallocation)

source: if concatenating :class:`tuple` objects, extend a :class:`list` instead
el: αν συνενώνεται αντικείμενα :class:`tuple`, επεκτείνετε μια :class:`list` αντ' αυτού

source: for other types, investigate the relevant class documentation
el: για άλλους τύπους, ερευνήστε τη σχετική τεκμηρίωση των κλάσεων

source: Some sequence types (such as :class:`range`) only support item sequences that follow specific patterns, and hence don't support sequence concatenation or repetition.
el: Ορισμένοι τύποι ακολουθιών (όπως :class:`range`) υποστηρίζουν μόνο ακολουθίες στοιχείων που ακολουθούν συγκεκριμένα μοτίβα, και ως εκ τούτου δεν υποστηρίζουν ακολουθία συνένωση ή επανάληψη.

source: ``index`` raises :exc:`ValueError` when *x* is not found in *s*. Not all implementations support passing the additional arguments *i* and *j*. These arguments allow efficient searching of subsections of the sequence. Passing the extra arguments is roughly equivalent to using ``s[i:j].index(x)``, only without copying any data and with the returned index being relative to the start of the sequence rather than the start of the slice.
el: Το ``index`` κάνει raise :exc:`ValueError` όταν το *x* δεν βρίσκεται στο *s*. Όχι όλες οι υλοποιήσεις υποστηρίζουν τη διαβίβαση των πρόσθετων ορίων *i* και *j*. Αυτές οι παράμετροι επιτρέπουν την αποτελεσματική αναζήτηση υποτμημάτων της ακολουθίας. Η διαβίβαση των πρόσθετων ορίων είναι περίπου ισοδύναμη με τη χρήση του ``s[i:j].index(x)``, μόνο χωρίς να αντιγράφονται δεδομένα και με τον επιστρεφόμενο δείκτη να είναι σχετικός με την αρχή της ακολουθίας και όχι στην αρχή του υποσυνόλου (slice).

source: Immutable Sequence Types
el: Τύποι Αμετάβλητων Ακολουθιών (Sequences)

source: The only operation that immutable sequence types generally implement that is not also implemented by mutable sequence types is support for the :func:`hash` built-in.
el: Η μόνη λειτουργία που υλοποιούν οι αμετάβλητοι γενικοί τύποι ακολουθίας που δεν είναι υλοποιημένοι από μεταβλητούς τύπους ακολουθίας, είναι η υποστήριξη της :func:`hash` built-in.

source: This support allows immutable sequences, such as :class:`tuple` instances, to be used as :class:`dict` keys and stored in :class:`set` and :class:`frozenset` instances.
el: Αυτή η υποστήριξη επιτρέπει αμετάβλητες ακολουθίες, όπως οι περιπτώσεις των :class:`tuple`, να χρησιμοποιούνται ως κλειδιά :class:`dict` και να αποθηκεύονται σε :class:`set` και :class:`frozenset` instances.

source: Attempting to hash an immutable sequence that contains unhashable values will result in :exc:`TypeError`.
el: Η προσπάθεια κατακερματισμού μιας αμετάβλητης ακολουθίας που περιέχει μη κατακερματιστέες (unhashable) τιμές θα οδηγήσει σε :exc:`TypeError`.

source: Mutable Sequence Types
el: Τύποι Μεταβλητών Ακολουθιών (Sequences)

source: The operations in the following table are defined on mutable sequence types. The :class:`collections.abc.MutableSequence` ABC is provided to make it easier to correctly implement these operations on custom sequence types.
el: Οι λειτουργίες του ακόλουθου πίνακα ορίζονται σε μεταβλητούς τύπους ακολουθίας. Η :class:`collections.abc.MutableSequence` ABC παρέχεται για να κάνει ευκολότερη την σωστή υλοποίηση αυτών των λειτουργιών σε προσαρμοσμένους τύπους ακολουθιών.

source: In the table *s* is an instance of a mutable sequence type, *t* is any iterable object and *x* is an arbitrary object that meets any type and value restrictions imposed by *s* (for example, :class:`bytearray` only accepts integers that meet the value restriction ``0 <= x <= 255``).
el: Στον πίνακα το *s* είναι ένα instance ενός μεταβλητού τύπου ακολουθίας, το *t* είναι οποιοδήποτε iterable αντικείμενο και το *x* είναι ένα αυθαίρετο αντικείμενο που πληροί οποιονδήποτε τύπο και περιορισμούς τιμής που επιβάλλονται από το *s* (για παράδειγμα, το :class:`bytearray` δέχεται μόνο ακέραιους που πληρούν τον περιορισμό ``0 <= x <= 255``).

source: item *i* of *s* is replaced by *x*
el: το στοιχείο *i* του *s* αντικαθίσταται από το *x*

source: slice of *s* from *i* to *j* is replaced by the contents of the iterable *t*
el: το υποσύνολο (slice) του *s* από το *i* έως το *j* αντικαθίσταται από τα περιεχόμενα του iterable *t*

source: same as ``s[i:j] = []``
el: ίδιο με το ``s[i:j] = []``

source: the elements of ``s[i:j:k]`` are replaced by those of *t*
el: τα στοιχεία του ``s[i:j:k]`` αντικαθίστανται από εκείνα του *t*

source: removes the elements of ``s[i:j:k]`` from the list
el: αφαιρεί τα στοιχεία του ``s[i:j:k]`` από τη λίστα

source: appends *x* to the end of the sequence (same as ``s[len(s):len(s)] = [x]``)
el: εισάγει το *x* στο τέλος της ακολουθίας (ίδιο με ``s[len(s):len(s)] = [x]``)

source: removes all items from *s* (same as ``del s[:]``)
el: αφαιρεί όλα τα στοιχεία από το *s* (ίδιο με το ``del s[:]``)

source: creates a shallow copy of *s* (same as ``s[:]``)
el: δημιουργεί ένα shallow αντίγραφο του *s* (ίδιο με το ``s[:]``)

source: ``s.extend(t)`` or ``s += t``
el: ``s.extend(t)`` ή ``s += t``

source: extends *s* with the contents of *t* (for the most part the same as ``s[len(s):len(s)] = t``)
el: επεκτείνει το *s* με τα περιεχόμενα του *t* (ως επί το πλείστον το ίδιο με το ``s[len(s):len(s)] = t``)

source: updates *s* with its contents repeated *n* times
el: ενημερώνει το *s* με το περιεχόμενό του επαναλαμβανόμενο *n* φορές

source: inserts *x* into *s* at the index given by *i* (same as ``s[i:i] = [x]``)
el: εισάγει το *x* στο *s* στο δείκτη που δίνεται από το *i* (το ίδιο με το ``s[i:i] = [x]``)

source: ``s.pop()`` or ``s.pop(i)``
el: ``s.pop()`` ή ``s.pop(i)``

source: retrieves the item at *i* and also removes it from *s*
el: ανακτά το στοιχείο στο *i* και το αφαιρεί επίσης από το *s*

source: removes the first item from *s* where ``s[i]`` is equal to *x*
el: αφαιρεί το πρώτο στοιχείο από το *s* όπου ``s[i]`` είναι ίσο με *x*

source: reverses the items of *s* in place
el: αντιστρέφει τα στοιχεία του *s*

source: If *k* is not equal to ``1``, *t* must have the same length as the slice it is replacing.
el: Αν το *k* δεν είναι ίσο με ``1``, το *t* πρέπει να έχει το ίδιο μήκος με το τμήμα που αντικαθιστά.

source: The optional argument *i* defaults to ``-1``, so that by default the last item is removed and returned.
el: Το προαιρετικό όρισμα *i* έχει προεπιλεγμένη τιμή ``-1``, έτσι ώστε από default το τελευταίο στοιχείο αφαιρείται και επιστρέφεται.

source: :meth:`remove` raises :exc:`ValueError` when *x* is not found in *s*.
el: η :meth:`remove` κάνει raise :exc:`ValueError` όταν το *x* δεν βρίσκεται στο *s*.

source: The :meth:`reverse` method modifies the sequence in place for economy of space when reversing a large sequence. To remind users that it operates by side effect, it does not return the reversed sequence.
el: Η μέθοδος :meth:`reverse` τροποποιεί την ακολουθία στη θέση της για οικονομία χώρου όταν αντιστρέφεται μια μεγάλη ακολουθία. Να υπενθυμίσουμε στους χρήστες ότι λειτουργεί με παρενέργεια, δεν επιστρέφει την αντιστραμμένη ακολουθία.

source: :meth:`clear` and :meth:`!copy` are included for consistency with the interfaces of mutable containers that don't support slicing operations (such as :class:`dict` and :class:`set`). :meth:`!copy` is not part of the :class:`collections.abc.MutableSequence` ABC, but most concrete mutable sequence classes provide it.
el: η :meth:`clear` και η :meth:`!copy` περιλαμβάνονται για λόγους συνέπειας με τα interfaces των μεταβλητών container που δεν υποστηρίζουν λειτουργίες τμηματοποίησης (όπως τα :class:`dict` και :class:`set`). Η :meth:`!copy` δεν αποτελεί μέρος της :class:`collections.abc.MutableSequence` ABC, αλλά οι περισσότερες κλάσεις μεταβλητών ακολουθιών την παρέχουν.

source: :meth:`clear` and :meth:`!copy` methods.
el: μέθοδοι :meth:`clear` και :meth:`!copy`.

source: The value *n* is an integer, or an object implementing :meth:`~object.__index__`. Zero and negative values of *n* clear the sequence. Items in the sequence are not copied; they are referenced multiple times, as explained for ``s * n`` under :ref:`typesseq-common`.
el: Η τιμή *n* είναι ένας ακέραιος αριθμός ή ένα αντικείμενο που υλοποιεί την :meth:`~object.__index__`. Οι μηδενικές και αρνητικές τιμές του *n* καθαρίζουν την ακολουθία. Τα στοιχεία της ακολουθίας δεν αντιγράφονται· αναφέρονται πολλές φορές, όπως εξηγείται για το ``s * n``` στο :ref:`typesseq-common`.

source: Lists
el: Λίστες

source: Lists are mutable sequences, typically used to store collections of homogeneous items (where the precise degree of similarity will vary by application).
el: Οι λίστες είναι μεταβλητές ακολουθίες, που συνήθως χρησιμοποιούνται για την αποθήκευση συλλογών ομοιογενών στοιχείων (όπου ο ακριβής βαθμός ομοιότητας ποικίλλει ανάλογα με εφαρμογή).

source: Lists may be constructed in several ways:
el: Οι λίστες μπορούν να κατασκευαστούν με διάφορους τρόπους:

source: Using a pair of square brackets to denote the empty list: ``[]``
el: Χρησιμοποιείστε ένα ζεύγος αγκυλών για να δηλώσετε την κενή λίστα: ``[]``

source: Using square brackets, separating items with commas: ``[a]``, ``[a, b, c]``
el: Χρησιμοποιώντας αγκύλες, διαχωρίζοντας τα στοιχεία με κόμματα: ``[a]``, ``[a, b, c]``

source: Using a list comprehension: ``[x for x in iterable]``
el: Χρήση ενός list comprehension: ``[x for x in iterable]``

source: Using the type constructor: ``list()`` or ``list(iterable)``
el: Χρήση του κατασκευαστή τύπου (type constructor): ``list()`` ή ``list(iterable)``

source: The constructor builds a list whose items are the same and in the same order as *iterable*'s items. *iterable* may be either a sequence, a container that supports iteration, or an iterator object. If *iterable* is already a list, a copy is made and returned, similar to ``iterable[:]``. For example, ``list('abc')`` returns ``['a', 'b', 'c']`` and ``list( (1, 2, 3) )`` returns ``[1, 2, 3]``. If no argument is given, the constructor creates a new empty list, ``[]``.
el: Ο κατασκευαστής (constructor) δημιουργεί μια λίστα της οποίας τα στοιχεία είναι τα ίδια και με την ίδια σειρά όπως τα στοιχεία του *iterable*. Το *iterable* μπορεί να είναι είτε μια ακολουθία, είτε ένας container που υποστηρίζει την επανάληψη, ή ένα αντικείμενο iterator. Εάν το *iterable* είναι ήδη μια λίστα, δημιουργείται ένα αντίγραφο και επιστρέφεται, παρόμοια με την ``iterable[:]``. Για παράδειγμα, η ``list('abc')`` επιστρέφει ``['a', 'b', 'c']`` και η ``list( (1, 2, 3) )`` επιστρέφει ``[1, 2, 3]``. Αν δεν δοθεί κανένα όρισμα, ο κατασκευαστής δημιουργεί μία νέα κενή λίστα, ``[]``.

source: Many other operations also produce lists, including the :func:`sorted` built-in.
el: Πολλές άλλες λειτουργίες παράγουν επίσης λίστες, συμπεριλαμβανομένης της built-in :func:`sorted`.

source: Lists implement all of the :ref:`common <typesseq-common>` and :ref:`mutable <typesseq-mutable>` sequence operations. Lists also provide the following additional method:
el: Οι λίστες υλοποιούν όλες τις :ref:`common <typesseq-common>` και :ref:`mutable <typesseq-mutable>` λειτουργίες ακολουθίας. Οι λίστες παρέχουν επίσης την ακόλουθη πρόσθετη μέθοδο:
