Repository: thepetk/python-docs-gr
Catalog: library/stdtypes.po
Languages: el

source: Strings also support two styles of string formatting, one providing a large degree of flexibility and customization (see :meth:`str.format`, :ref:`formatstrings` and :ref:`string-formatting`) and the other based on C ``printf`` style formatting that handles a narrower range of types and is slightly harder to use correctly, but is often faster for the cases it can handle (:ref:`old-string-formatting`).
el: Οι συμβολοσειρές (string) υποστηρίζουν επίσης δύο στυλ μορφοποίησης συμβολοσειρών, το ένα παρέχει ένα μεγάλο βαθμό ευελιξίας και προσαρμογής (βλέπε :meth:`str.format`, :ref:`formatstrings` και :ref:`string-formatting`) και το άλλο βασίζεται στο στυλ μορφοποίησης ``printf`` της C που χειρίζεται ένα στενότερο εύρος τύπων και είναι λίγο πιο δύσκολο να χρησιμοποιηθεί σωστά, αλλά είναι συχνά ταχύτερο για τις περιπτώσεις που μπορεί να χειριστεί (:ref:`old-string-formatting`).

source: The :ref:`textservices` section of the standard library covers a number of other modules that provide various text related utilities (including regular expression support in the :mod:`re` module).
el: Το τμήμα :ref:`textservices` της πρότυπης βιβλιοθήκης καλύπτει έναν αριθμό από άλλες ενότητες που παρέχουν διάφορες βοηθητικές υπηρεσίες που σχετίζονται με το κείμενο (συμπεριλαμβανομένης της υποστήριξης των κανονικών εκφράσεων στην ενότητα :mod:`re`).

source: Return a copy of the string with its first character capitalized and the rest lowercased.
el: Επιστρέφει ένα αντίγραφο της συμβολοσειράς (string) με τον πρώτο χαρακτήρα κεφαλαίο και τα υπόλοιπα με πεζά γράμματα.

source: The first character is now put into titlecase rather than uppercase. This means that characters like digraphs will only have their first letter capitalized, instead of the full character.
el: Ο πρώτος χαρακτήρας τίθεται τώρα σε titlecase αντί για uppercase. Αυτό σημαίνει ότι χαρακτήρες όπως οι διγράφοι (digraphs) θα έχουν μόνο το πρώτο γράμμα τους με κεφαλαίο, αντί για όλους τους χαρακτήρες.

source: Return a casefolded copy of the string. Casefolded strings may be used for caseless matching.
el: Επιστρέφει ένα αντίγραφο της συμβολοσειράς (string) σε casefolded μορφή. Οι casefolded συμβολοσειρές μπορούν να χρησιμοποιηθούν για caseless matching.

source: Casefolding is similar to lowercasing but more aggressive because it is intended to remove all case distinctions in a string. For example, the German lowercase letter ``'ß'`` is equivalent to ``"ss"``. Since it is already lowercase, :meth:`lower` would do nothing to ``'ß'``; :meth:`casefold` converts it to ``"ss"``.
el: Το casefolding είναι παρόμοιο με το lowercasing αλλά πιο επιθετικό επειδή έχει ως στόχο να αφαιρέσει όλες τις διακρίσεις της πεζότητας σε μια συμβολοσειρά (string). Για παράδειγμα, το γερμανικό πεζό γράμμα ``'ß'`` ισοδυναμεί με ``"ss"``. Αφού είναι ήδη πεζό, η :meth:`lower` δεν θα έκανε τίποτα στο ``'ß'``· η :meth:`casefold` το μετατρέπει σε ``"ss"``.

source: The casefolding algorithm is `described in section 3.13 'Default Case Folding' of the Unicode Standard <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-3/#G33992>`__.
el: Ο αλγόριθμος casefolding `περιγράφεται στην ενότητα 3.13 'Default Case Folding' του προτύπου Unicode <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-3/#G33992>`__.

source: Return centered in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
el: Επιστρέφει ένα κεντραρισμένο σε μια συμβολοσειρά (string) μήκους *πλάτος*. Το padding γίνεται με τη χρήση του καθορισμένου *fillchar* (το default είναι ένα κενό ASCII). Η αρχική συμβολοσειρά επιστρέφεται εάν το *width* είναι μικρότερο ή ίσο με το ``len(s)``.

source: Return the number of non-overlapping occurrences of substring *sub* in the range [*start*, *end*]. Optional arguments *start* and *end* are interpreted as in slice notation.
el: Επιστρέφει τον αριθμό των μη επικαλυπτόμενων (non-overalpping) εμφανίσεων της υποομάδας *sub* στο εύρος [*start*, *end*]. Τα προαιρετικά ορίσματα *start* και *end* ερμηνεύονται όπως στο slice notation.

source: If *sub* is empty, returns the number of empty strings between characters which is the length of the string plus one.
el: Αν το *sub* είναι κενό, επιστρέφει τον αριθμό των κενών συμβολοσειρών (strings) μεταξύ των χαρακτήρων που είναι το μήκος της συμβολοσειράς συν ένα.

source: Return the string encoded to :class:`bytes`.
el: Επιστρέφει την συμβολοσειρά (string) κωδικοποιημένη σε :class:`bytes`.

source: *encoding* defaults to ``'utf-8'``; see :ref:`standard-encodings` for possible values.
el: το *encoding* έχει default σε ``'utf-8'``- δείτε :ref:`standard-encodings` για πιθανές τιμές.

source: *errors* controls how encoding errors are handled. If ``'strict'`` (the default), a :exc:`UnicodeError` exception is raised. Other possible values are ``'ignore'``, ``'replace'``, ``'xmlcharrefreplace'``, ``'backslashreplace'`` and any other name registered via :func:`codecs.register_error`. See :ref:`error-handlers` for details.
el: το *errors* ελέγχει τον τρόπο χειρισμού των σφαλμάτων κωδικοποίησης. Εάν είναι ``'strict'`` (το default), τότε γίνεται raise μια εξαίρεση :exc:`UnicodeError`. Άλλες πιθανές τιμές είναι τα ``'ignore'``, ``'replace'``, ``'xmlcharrefreplace'``, ``'backslashreplace'`` και οποιοδήποτε άλλο όνομα που έχει καταχωρηθεί μέσω του :func:`codecs.register_error`. Δείτε το :ref:`error-handlers` για λεπτομέρειες.

source: For performance reasons, the value of *errors* is not checked for validity unless an encoding error actually occurs, :ref:`devmode` is enabled or a :ref:`debug build <debug-build>` is used.
el: Για λόγους απόδοσης, η τιμή των *errors* δεν ελέγχεται ως προς την εγκυρότητα εκτός αν όντως προκύψει σφάλμα κωδικοποίησης, αν το :ref:`devmode` είναι ενεργοποιημένο ή αν ένα :ref:`debug build <debug-build>` χρησιμοποιείται.

source: Added support for keyword arguments.
el: Επιπρόσθετη υποστήριξη για keyword ορίσματα.

source: The value of the *errors* argument is now checked in :ref:`devmode` and in :ref:`debug mode <debug-build>`.
el: Η τιμή του όρου *errors* ελέγχεται τώρα στο :ref:`devmode` και στο :ref:`debug mode <debug-build>`.

source: Return ``True`` if the string ends with the specified *suffix*, otherwise return ``False``. *suffix* can also be a tuple of suffixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
el: Επιστρέφει ``True`` αν η συμβολοσειρά (string) τελειώνει με το καθορισμένο *suffix*, αλλιώς επιστρέφει ``False``. Το *suffix* μπορεί επίσης να είναι ένα tuple (πλειάδα) από επιθέματα που πρέπει να αναζητηθούν. Με το προαιρετικό *start*, το τεστ αρχίζει από αυτή τη θέση. Με το προαιρετικό *end*, η σύγκριση σταματά σε αυτή τη θέση.

source: Return a copy of the string where all tab characters are replaced by one or more spaces, depending on the current column and the given tab size. Tab positions occur every *tabsize* characters (default is 8, giving tab positions at columns 0, 8, 16 and so on). To expand the string, the current column is set to zero and the string is examined character by character. If the character is a tab (``\t``), one or more space characters are inserted in the result until the current column is equal to the next tab position. (The tab character itself is not copied.) If the character is a newline (``\n``) or return (``\r``), it is copied and the current column is reset to zero. Any other character is copied unchanged and the current column is incremented by one regardless of how the character is represented when printed.
el: Επιστρέφει ένα αντίγραφο της συμβολοσειράς (string) όπου όλοι οι χαρακτήρες tab αντικαθίστανται από έναν ή περισσότερα κενά, ανάλογα με την τρέχουσα στήλη και το δεδομένο μέγεθος των tabs. Οι θέσεις tab εμφανίζονται κάθε *tabsize* χαρακτήρες (το default είναι 8, δίνοντας tab θέσεις στις στήλες 0, 8, 16 κ.ο.κ.). Για την επέκταση της συμβολοσειράς, η τρέχουσα στήλη μηδενίζεται και η συμβολοσειρά εξετάζεται χαρακτήρας προς χαρακτήρα. Εάν ο χαρακτήρας είναι tab (``\t``), εισάγονται ένας ή περισσότεροι χαρακτήρες κενών στο αποτέλεσμα μέχρι η τρέχουσα στήλη να είναι ίση με την επόμενη θέση tab. (Ο ίδιος ο χαρακτήρας tab δεν αντιγράφεται.) Εάν ο χαρακτήρας είναι νέα γραμμή (``\n``) ή return (``\r``), αντιγράφεται και η τρέχουσα στήλη επαναφέρεται στο μηδέν. Οποιοσδήποτε άλλος χαρακτήρας αντιγράφεται αμετάβλητος και η τρέχουσα στήλη αυξάνεται κατά ένα, ανεξάρτητα από τον τρόπο αναπαράστασης του χαρακτήρα όταν τυπώνεται.

source: Return the lowest index in the string where substring *sub* is found within the slice ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` if *sub* is not found.
el: Επιστρέφει τον χαμηλότερο δείκτη στη συμβολοσειρά (string) όπου η υπό-συμβολοσειρά *sub* βρίσκεται μέσα στο υποσύνολο (slice) ``s[start:end]``. Τα προαιρετικά ορίσματα *start* και *end* ερμηνεύονται όπως στο notation του υποσυνόλου. Επιστρέφει ``-1`` αν δεν βρεθεί το *sub*.

source: The :meth:`~str.find` method should be used only if you need to know the position of *sub*. To check if *sub* is a substring or not, use the :keyword:`in` operator::
el: Η μέθοδος :meth:`~str.find` θα πρέπει να χρησιμοποιείται μόνο αν πρέπει να γνωρίζετε τη θέση του *sub*. Για να ελέγξετε αν το *sub* είναι υποσύνολο ή όχι, χρησιμοποιήστε τον τελεστή :keyword:`in`::

source: Perform a string formatting operation. The string on which this method is called can contain literal text or replacement fields delimited by braces ``{}``. Each replacement field contains either the numeric index of a positional argument, or the name of a keyword argument. Returns a copy of the string where each replacement field is replaced with the string value of the corresponding argument.
el: Εκτέλεση μιας λειτουργίας μορφοποίησης συμβολοσειράς (string formatting). Η συμβολοσειρά στην οποία αυτή η μέθοδος καλείται μπορεί να περιέχει κυριολεκτικό κείμενο ή πεδία αντικατάστασης που οριοθετούνται από αγκύλες ``{}``. Κάθε πεδίο αντικατάστασης περιέχει είτε τον αριθμητικό δείκτη ενός ορίσματος θέσης, είτε το όνομα ενός keyword ορίσματος. Επιστρέφει ένα αντίγραφο της συμβολοσειράς όπου κάθε πεδίο αντικατάστασης αντικαθίσταται με την τιμή της συμβολοσειράς του αντίστοιχου ορίσματος.

source: See :ref:`formatstrings` for a description of the various formatting options that can be specified in format strings.
el: Δείτε το :ref:`formatstrings` για μια περιγραφή των διαφόρων επιλογών μορφοποίησης που μπορούν να καθοριστούν στην μορφοποίηση συμβολοσειρών (format strings).

source: When formatting a number (:class:`int`, :class:`float`, :class:`complex`, :class:`decimal.Decimal` and subclasses) with the ``n`` type (ex: ``'{:n}'.format(1234)``), the function temporarily sets the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale to decode ``decimal_point`` and ``thousands_sep`` fields of :c:func:`localeconv` if they are non-ASCII or longer than 1 byte, and the ``LC_NUMERIC`` locale is different than the ``LC_CTYPE`` locale. This temporary change affects other threads.
el: Κατά τη μορφοποίηση ενός αριθμού (:class:`int`, :class:`float`, :class:`complex`, :class:`decimal.Decimal` και υποκλάσεις) με τον τύπο ``n`` (π.χ.: ``'{:n}'.format(1234)``, η συνάρτηση θέτει προσωρινά την τοποθεσία ``LC_CTYPE`` στην τοποθεσία ``LC_NUMERIC`` για την αποκωδικοποίηση των ``decimal_point`` και ``thousands_sep`` πεδίων του :c:func:`localeconv` αν είναι μη ASCII ή μεγαλύτερα από 1 byte, και το locale ``LC_NUMERIC`` είναι διαφορετικό από το locale ``LC_CTYPE``. Αυτή η προσωρινή αλλαγή επηρεάζει και άλλα νήματα (threads).

source: When formatting a number with the ``n`` type, the function sets temporarily the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale in some cases.
el: Κατά τη μορφοποίηση ενός αριθμού με τον τύπο ``n``, η συνάρτηση θέτει προσωρινά το locale ``LC_CTYPE`` στο locale ``LC_NUMERIC`` σε κάποιες περιπτώσεις.

source: Similar to ``str.format(**mapping)``, except that ``mapping`` is used directly and not copied to a :class:`dict`. This is useful if for example ``mapping`` is a dict subclass:
el: Παρόμοιο με το ``str.format(**mapping)``, εκτός από το ότι χρησιμοποιείται το ``mapping`` απευθείας και δεν αντιγράφεται σε μια :class:`dict`. Αυτό είναι χρήσιμο αν για παράδειγμα το ``mapping`` είναι μια υποκλάση του dict:

source: Like :meth:`~str.find`, but raise :exc:`ValueError` when the substring is not found.
el: Όπως η :meth:`~str.find`, αλλά κάνει raise :exc:`ValueError` όταν η υπό-συμβολοσειρά (substring) δεν έχει βρεθεί.

source: Return ``True`` if all characters in the string are alphanumeric and there is at least one character, ``False`` otherwise. A character ``c`` is alphanumeric if one of the following returns ``True``: ``c.isalpha()``, ``c.isdecimal()``, ``c.isdigit()``, or ``c.isnumeric()``.
el: Επιστρέφει ``True`` αν όλοι οι χαρακτήρες στη συμβολοσειρά (string) είναι αλφαριθμητικοί και υπάρχει τουλάχιστον ένας χαρακτήρας, διαφορετικά ``False``. Ένας χαρακτήρας ``c`` είναι αλφαριθμητικό εάν ένα από τα ακόλουθα επιστρέφει ``True``: ``c.isalpha()``, ``c.isdecimal()``, ``c.isdigit()``, ή ``c.isnumeric()``.

source: Return ``True`` if all characters in the string are alphabetic and there is at least one character, ``False`` otherwise. Alphabetic characters are those characters defined in the Unicode character database as "Letter", i.e., those with general category property being one of "Lm", "Lt", "Lu", "Ll", or "Lo". Note that this is different from the `Alphabetic property defined in the section 4.10 'Letters, Alphabetic, and Ideographic' of the Unicode Standard <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-4/#G91002>`_.
el: Επιστρέφει ``True`` αν όλοι οι χαρακτήρες στη συμβολοσειρά (string) είναι αλφαβητικοί και υπάρχει τουλάχιστον ένας χαρακτήρας, διαφορετικά ``False``. Οι αλφαβητικοί χαρακτήρες είναι χαρακτήρες που ορίζονται στη βάση δεδομένων χαρακτήρων Unicode ως "Letter", δηλαδή, εκείνοι με General Category ιδιότητα μία από τα "Lm", "Lt", "Lu", "Ll", ή "Lo". Σημειώστε ότι αυτό είναι διαφορετικό από το `Αλφαβητικό που ορίζεται στην ενότητα 4.10 'Letters, Alphabetic, and Ideographic' του προτύπου Unicode <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-4/#G91002>`_.

source: Return ``True`` if the string is empty or all characters in the string are ASCII, ``False`` otherwise. ASCII characters have code points in the range U+0000-U+007F.
el: Επιστρέφει ``True`` εάν η συμβολοσειρά (string) είναι κενή ή όλοι οι χαρακτήρες της συμβολοσειράς είναι ASCII, αλλιώς ``False``. Οι χαρακτήρες ASCII έχουν σημεία κωδικοποίησης στην περιοχή U+0000-U+007F.

source: Return ``True`` if all characters in the string are decimal characters and there is at least one character, ``False`` otherwise. Decimal characters are those that can be used to form numbers in base 10, e.g. U+0660, ARABIC-INDIC DIGIT ZERO. Formally a decimal character is a character in the Unicode General Category "Nd".
el: Επιστρέφει ``True`` αν όλοι οι χαρακτήρες στη συμβολοσειρά (string) είναι δεκαδικοί χαρακτήρες και υπάρχει τουλάχιστον ένας χαρακτήρας, διαφορετικά ``False``. Οι δεκαδικοί χαρακτήρες είναι αυτοί που μπορούν να χρησιμοποιηθούν για το σχηματισμό αριθμών στη βάση 10, π.χ. U+0660, ARABIC-INDIC DIGIT ZERO. Επίσημα ένας δεκαδικός χαρακτήρας είναι ένας χαρακτήρας του Unicode General Category "Nd".

source: Return ``True`` if all characters in the string are digits and there is at least one character, ``False`` otherwise. Digits include decimal characters and digits that need special handling, such as the compatibility superscript digits. This covers digits which cannot be used to form numbers in base 10, like the Kharosthi numbers. Formally, a digit is a character that has the property value Numeric_Type=Digit or Numeric_Type=Decimal.
el: Επιστρέφει ``True`` αν όλοι οι χαρακτήρες στη συμβολοσειρά είναι ψηφία και υπάρχει τουλάχιστον ένας χαρακτήρας, διαφορετικά ``False``. Τα ψηφία περιλαμβάνουν δεκαδικούς χαρακτήρες και ψηφία που χρειάζονται ειδικό χειρισμό, όπως τα compatibility superscript ψηφία. Αυτό καλύπτει τα ψηφία που δεν μπορούν να χρησιμοποιηθούν για το σχηματισμό αριθμών στη βάση 10, όπως οι αριθμοί Kharosthi. Τυπικά, ένα ψηφίο είναι ένας χαρακτήρας που έχει την τιμή της ιδιότητας Numeric_Type=Digit ή Numeric_Type=Decimal.

source: Return ``True`` if the string is a valid identifier according to the language definition, section :ref:`identifiers`.
el: Επιστρέφει ``True`` αν η συμβολοσειρά είναι έγκυρο αναγνωριστικό σύμφωνα με το ορισμό της γλώσσας, ενότητα :ref:`identifiers`.

source: :func:`keyword.iskeyword` can be used to test whether string ``s`` is a reserved identifier, such as :keyword:`def` and :keyword:`class`.
el: το :func:`keyword.iskeyword` μπορεί να χρησιμοποιηθεί για να ελέγξει αν η συμβολοσειρά ``s`` είναι ένα δεσμευμένο αναγνωριστικό, όπως τα :keyword:`def` και :keyword:`class`.

source: Example: ::
el: Παράδειγμα ::

source: Return ``True`` if all cased characters [4]_ in the string are lowercase and there is at least one cased character, ``False`` otherwise.
el: Επιστρέφει ``True`` αν όλοι οι χαρακτήρες [4]_ στο αλφαριθμητικό (string) είναι πεζοί και υπάρχει τουλάχιστον ένας cased χαρακτήρας, αλλιώς ``False``.

source: Return ``True`` if all characters in the string are numeric characters, and there is at least one character, ``False`` otherwise. Numeric characters include digit characters, and all characters that have the Unicode numeric value property, e.g. U+2155, VULGAR FRACTION ONE FIFTH. Formally, numeric characters are those with the property value Numeric_Type=Digit, Numeric_Type=Decimal or Numeric_Type=Numeric.
el: Επιστρέφει ``True`` αν όλοι οι χαρακτήρες στη συμβολοσειρά είναι αριθμητικοί (numeric) χαρακτήρες, και υπάρχει τουλάχιστον ένας χαρακτήρας, διαφορετικά ``False``. Οι αριθμητικοί χαρακτήρες περιλαμβάνουν ψηφιακούς χαρακτήρες και όλους τους χαρακτήρες που έχουν την αριθμητική τιμή, π.χ. U+2155, VULGAR FRACTION ONE FIFTH. Τυπικά, οι αριθμητικοί χαρακτήρες είναι εκείνοι με την τιμή της ιδιότητας Numeric_Type=Digit, Numeric_Type=Decimal ή Numeric_Type=Numeric.

source: Return ``True`` if all characters in the string are printable, ``False`` if it contains at least one non-printable character.
el: Επιστρέφει ``True`` αν όλοι οι χαρακτήρες στη συμβολοσειρά μπορούν να εκτυπωθούν, ``False`` εάν περιέχει τουλάχιστον έναν μη εκτυπώσιμο χαρακτήρα.

source: Here "printable" means the character is suitable for :func:`repr` to use in its output; "non-printable" means that :func:`repr` on built-in types will hex-escape the character. It has no bearing on the handling of strings written to :data:`sys.stdout` or :data:`sys.stderr`.
el: Εδώ "εκτυπώσιμος" σημαίνει ότι ο χαρακτήρας είναι κατάλληλος για την :func:`repr` για χρήση στην έξοδο του∙ το "μη εκτυπώσιμος" σημαίνει ότι ο χαρακτήρας στη :func:`repr` στους ενσωματωμένους τύπους θα διαφεύγει εξαγωνικά από τον χαρακτήρα. Δεν έχει καμία σχέση με τον χειρισμό συμβολοσειρών που γράφονται σε :data:`sys.stdout` ή :data:`sys.stderr`.

source: The printable characters are those which in the Unicode character database (see :mod:`unicodedata`) have a general category in group Letter, Mark, Number, Punctuation, or Symbol (L, M, N, P, or S); plus the ASCII space 0x20. Nonprintable characters are those in group Separator or Other (Z or C), except the ASCII space.
el: Οι εκτυπώσιμοι χαρακτήρες είναι αυτοί που στη βάση δεδομένων χαρακτήρων Unicode (βλ. :mod:`unicodedata`) έχουν μια γενική κατηγορία στην ομάδα Γράμμα, Σήμα, Αριθμός, Σημεία στίξης ή Σύμβολο (L, M, N, P ή S), συν το διάστημα ASCII 0x20. Οι μη εκτυπώσιμοι χαρακτήρες είναι αυτοί που βρίσκονται στο χώρο Διαχωρισμού ομάδας ή Άλλο (Z ή CII).

source: Return ``True`` if there are only whitespace characters in the string and there is at least one character, ``False`` otherwise.
el: Επιστρέφει ``True`` αν υπάρχουν μόνο χαρακτήρες κενού (whitespace) στο αλφαριθμητικό (string) και υπάρχει τουλάχιστον ένας χαρακτήρας, διαφορετικά ``False``.

source: A character is *whitespace* if in the Unicode character database (see :mod:`unicodedata`), either its general category is ``Zs`` ("Separator, space"), or its bidirectional class is one of ``WS``, ``B``, or ``S``.
el: Ένας χαρακτήρας είναι *whitespace* εάν στη βάση δεδομένων χαρακτήρων Unicode (βλέπε :mod:`unicodedata`), είτε η γενική κατηγορία του είναι ``Zs`` ("Separator, space"), είτε η αμφίδρομη κατηγορία του είναι μία από τις κατηγορίες ``WS``, ``B``, ή ``S``.

source: Return ``True`` if the string is a titlecased string and there is at least one character, for example uppercase characters may only follow uncased characters and lowercase characters only cased ones. Return ``False`` otherwise.
el: Επιστρέφει ``True`` αν η συμβολοσειρά (string) είναι μια titlecased συμβολοσειρά και υπάρχει τουλάχιστον ένας χαρακτήρας, για παράδειγμα, οι κεφαλαίοι χαρακτήρες μπορούν να ακολουθούν μόνο τους uncased χαρακτήρες και οι πεζοί χαρακτήρες μόνο cased χαρακτήρες. Διαφορετικά, επιστρέφει ``False``.

source: Return ``True`` if all cased characters [4]_ in the string are uppercase and there is at least one cased character, ``False`` otherwise.
el: Επιστρέφει ``True`` αν όλοι οι χαρακτήρες [4]_ στο αλφαριθμητικό είναι κεφαλαίοι και υπάρχει τουλάχιστον ένας cased χαρακτήρας, διαφορετικά ``False``.

source: Return a string which is the concatenation of the strings in *iterable*. A :exc:`TypeError` will be raised if there are any non-string values in *iterable*, including :class:`bytes` objects. The separator between elements is the string providing this method.
el: Επιστρέφει μια συμβολοσειρά (string) που είναι η συνένωση των συμβολοσειρών στο *iterable*. Ένα :exc:`TypeError` θα γίνει raise αν υπάρχουν τιμές μη συμβολοσειράς (non-string) στο *iterable*, συμπεριλαμβανομένων των αντικειμένων :class:`bytes`. Το διαχωριστικό μεταξύ των στοιχείων είναι η συμβολοσειρά που παρέχει αυτή η μέθοδος.

source: Return the string left justified in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
el: Επιστρέφει τη συμβολοσειρά (string) με αριστερή ευθυγράμμιση σε μια συμβολοσειρά μήκους *width*. Το padding γίνεται με τη χρήση του καθορισμένου *fillchar* (το default είναι ένα κενό ASCII). Η αρχική συμβολοσειρά επιστρέφεται εάν το *width* είναι μικρότερο ή ίσο με το ``len(s)``.

source: Return a copy of the string with all the cased characters [4]_ converted to lowercase.
el: Επιστρέφει ένα αντίγραφο της συμβολοσειράς (string) με όλους τους cased χαρακτήρες [4]_ να έχουν μετατραπεί σε πεζούς.

source: The lowercasing algorithm used is `described in section 3.13 'Default Case Folding' of the Unicode Standard <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-3/#G33992>`__.
el: Ο αλγόριθμος που χρησιμοποιείται για την πεζογράμμιση `περιγράφεται στην ενότητα 3.13 'Default Case Folding' του προτύπου Unicode <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-3/#G33992>`__.
