Repository: thepetk/python-docs-gr
Catalog: library/stdtypes.po
Languages: el

source: This method sorts the list in place, using only ``<`` comparisons between items. Exceptions are not suppressed - if any comparison operations fail, the entire sort operation will fail (and the list will likely be left in a partially modified state).
el: Αυτή η μέθοδος ταξινομεί τη λίστα, χρησιμοποιώντας μόνο συγκρίσεις ``<`` μεταξύ στοιχείων. Οι εξαιρέσεις δεν καταστέλλονται - αν αποτύχει κάποια πράξη σύγκρισης, ολόκληρη η λειτουργία ταξινόμησης θα αποτύχει (και η λίστα θα παραμείνει πιθανότατα σε μια μερικώς τροποποιημένη κατάσταση).

source: :meth:`sort` accepts two arguments that can only be passed by keyword (:ref:`keyword-only arguments <keyword-only_parameter>`):
el: η :meth:`sort` δέχεται δύο ορίσματα που μπορούν να περάσουν μόνο με τη λέξη-κλειδί (:ref:`keyword-only arguments <keyword-only_parameter>`):

source: *key* specifies a function of one argument that is used to extract a comparison key from each list element (for example, ``key=str.lower``). The key corresponding to each item in the list is calculated once and then used for the entire sorting process. The default value of ``None`` means that list items are sorted directly without calculating a separate key value.
el: το *key* καθορίζει μια συνάρτηση ενός ορίσματος που χρησιμοποιείται για την εξαγωγή ενός κλειδιού σύγκρισης (comparison key) από κάθε στοιχείο της λίστας (για παράδειγμα, ``key=str.lower``). Το κλειδί που αντιστοιχεί σε κάθε στοιχείο της λίστας υπολογίζεται μία φορά και στη συνέχεια χρησιμοποιείται για ολόκληρη τη διαδικασία ταξινόμησης. Η προεπιλεγμένη τιμή (default) ``None`` σημαίνει ότι τα στοιχεία της λίστας ταξινομούνται απευθείας χωρίς να υπολογίζεται ξεχωριστή τιμή κλειδιού.

source: The :func:`functools.cmp_to_key` utility is available to convert a 2.x style *cmp* function to a *key* function.
el: Το utility :func:`functools.cmp_to_key` είναι διαθέσιμο για τη μετατροπή μια συνάρτηση *cmp* στυλ 2.x σε συνάρτηση *key*.

source: *reverse* is a boolean value. If set to ``True``, then the list elements are sorted as if each comparison were reversed.
el: η *reverse* είναι μια λογική (boolean) τιμή. Αν τεθεί σε ``True``, τότε τα στοιχεία της λίστας ταξινομούνται σαν να ήταν αντίστροφη κάθε σύγκριση.

source: This method modifies the sequence in place for economy of space when sorting a large sequence. To remind users that it operates by side effect, it does not return the sorted sequence (use :func:`sorted` to explicitly request a new sorted list instance).
el: Αυτή η μέθοδος τροποποιεί την ακολουθία για εξοικονόμηση χώρου κατά την ταξινόμηση μιας μεγάλης ακολουθίας. Nα υπενθυμίσουμε στους χρήστες ότι λειτουργεί με παρενέργεια, δεν επιστρέφει την ταξινομημένη ακολουθία (χρησιμοποιήστε την :func:`sorted` για να ζητήσετε μια νέα περίπτωση ταξινομημένης λίστας).

source: The :meth:`sort` method is guaranteed to be stable. A sort is stable if it guarantees not to change the relative order of elements that compare equal --- this is helpful for sorting in multiple passes (for example, sort by department, then by salary grade).
el: Η μέθοδος :meth:`sort` είναι εγγυημένα σταθερή. Μια ταξινόμηση είναι σταθερή αν εγγυάται ότι δεν θα αλλάξει τη σχετική σειρά των στοιχείων που συγκρίνουν ίσα --- αυτό είναι χρήσιμο για την ταξινόμηση σε πολλαπλά περάσματα (για παράδειγμα, ταξινόμηση κατά τμήμα, στη συνέχεια με βάση το μισθολογικό κλιμάκιο κτλ).

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
el: Για παραδείγματα ταξινόμησης και ένα σύντομο tutorial, δείτε :ref:`sortinghowto`.

source: While a list is being sorted, the effect of attempting to mutate, or even inspect, the list is undefined. The C implementation of Python makes the list appear empty for the duration, and raises :exc:`ValueError` if it can detect that the list has been mutated during a sort.
el: Ενώ μια λίστα ταξινομείται, το αποτέλεσμα της προσπάθειας μετάλλαξης, ή ακόμα και η επιθεώρηση, της λίστας είναι απροσδιόριστη. Η υλοποίηση της Python στη C κάνει την λίστα να εμφανίζεται κενή για όλη τη διάρκεια, και κάνει raise :exc:`ValueError` αν ανιχνεύσει ότι η λίστα έχει μεταλλαχθεί κατά τη διάρκεια μιας ταξινόμησης.

source: Tuples
el: Πλειάδες (Tuples)

source: Tuples are immutable sequences, typically used to store collections of heterogeneous data (such as the 2-tuples produced by the :func:`enumerate` built-in). Tuples are also used for cases where an immutable sequence of homogeneous data is needed (such as allowing storage in a :class:`set` or :class:`dict` instance).
el: Οι πλειάδες (tuples) είναι αμετάβλητες ακολουθίες, που συνήθως χρησιμοποιούνται για την αποθήκευση συλλογών ετερογενών δεδομένων (όπως οι 2-tuples που παράγονται από την built-in :func:`enumerate`). Τα tuples χρησιμοποιούνται επίσης για περιπτώσεις όπου μια αμετάβλητη ακολουθία ομοιογενών δεδομένων (όπως για παράδειγμα για να επιτρέπεται η αποθήκευση σε ένα :class:`set` ή σε ένα :class:`dict` instance).

source: Tuples may be constructed in a number of ways:
el: Οι πλειάδες (tuples) μπορούν να κατασκευαστούν με διάφορους τρόπους:

source: Using a pair of parentheses to denote the empty tuple: ``()``
el: Χρήση ενός ζεύγους παρενθέσεων για να δηλωθεί το κενό tuple (πλειάδα): ``()``

source: Using a trailing comma for a singleton tuple: ``a,`` or ``(a,)``
el: Χρήση ενός κόμματος στο τέλος για ένα μοναδικό tuple (πλειάδα): ``a,`` ή ``(a,)``

source: Separating items with commas: ``a, b, c`` or ``(a, b, c)``
el: Διαχωρισμός στοιχείων με κόμμα: ``a, b, c`` ή ``(a, b, c)``

source: Using the :func:`tuple` built-in: ``tuple()`` or ``tuple(iterable)``
el: Χρήση του ενσωματωμένου :func:`tuple`: ``tuple()`` ή ``tuple(iterable)``

source: The constructor builds a tuple whose items are the same and in the same order as *iterable*'s items. *iterable* may be either a sequence, a container that supports iteration, or an iterator object. If *iterable* is already a tuple, it is returned unchanged. For example, ``tuple('abc')`` returns ``('a', 'b', 'c')`` and ``tuple( [1, 2, 3] )`` returns ``(1, 2, 3)``. If no argument is given, the constructor creates a new empty tuple, ``()``.
el: Ο κατασκευαστής (constructor) δημιουργεί μια πλειάδα (tuple) του οποίου τα στοιχεία είναι τα ίδια και στην ίδια σειρά με τα στοιχεία του *iterable*. Η *iterable* μπορεί να είναι είτε μια ακολουθία, είτε έναν container που υποστηρίζει την επανάληψη, ή ένα αντικείμενο iterator. Εάν το *iterable* είναι ήδη ένα tuple, επιστρέφεται αμετάβλητο. Για παράδειγμα, το ``tuple('abc')`` επιστρέφει ``('a', 'b', 'c')`` και το ``tuple( [1, 2, 3] )`` επιστρέφει ``(1, 2, 3)``. Αν δεν δοθεί κανένα όρισμα, ο κατασκευαστής δημιουργεί μια ένα κενό tuple, ``()``.

source: Note that it is actually the comma which makes a tuple, not the parentheses. The parentheses are optional, except in the empty tuple case, or when they are needed to avoid syntactic ambiguity. For example, ``f(a, b, c)`` is a function call with three arguments, while ``f((a, b, c))`` is a function call with a 3-tuple as the sole argument.
el: Σημειώστε ότι στην πραγματικότητα το κόμμα είναι αυτό που κάνει ένα tuple (πλειάδα), όχι οι παρενθέσεις. Οι παρενθέσεις είναι προαιρετικές, εκτός από την περίπτωση κενού tuple ή όταν χρειάζονται για την αποφυγή συντακτικής ασάφειας. Για παράδειγμα, η ``f(a, b, c)`` είναι μια κλήση συνάρτησης με τρία ορίσματα, ενώ η ``f((a, b, c))`` είναι μια συνάρτηση κλήση συνάρτησης με ένα 3-tuple ως μοναδικό όρισμα.

source: Tuples implement all of the :ref:`common <typesseq-common>` sequence operations.
el: Τα Tuples υλοποιούν όλες τις πράξεις ακολουθιών :ref:`common <typesseq-common>`.

source: For heterogeneous collections of data where access by name is clearer than access by index, :func:`collections.namedtuple` may be a more appropriate choice than a simple tuple object.
el: Για ετερογενείς συλλογές δεδομένων όπου η πρόσβαση με βάση το όνομα είναι σαφέστερη από την πρόσβαση με βάση το δείκτη, το :func:`collections.namedtuple` μπορεί να είναι μια πιο κατάλληλη επιλογή από ένα απλό αντικείμενο tuple (πλειάδα).

source: Ranges
el: Εύρη (Ranges)

source: The :class:`range` type represents an immutable sequence of numbers and is commonly used for looping a specific number of times in :keyword:`for` loops.
el: Ο τύπος :class:`range` αναπαριστά μια αμετάβλητη ακολουθία αριθμών και συνήθως χρησιμοποιείται για την επανάληψη ενός συγκεκριμένου αριθμού επαναλήψεων σε βρόχους :keyword:`for`.

source: The arguments to the range constructor must be integers (either built-in :class:`int` or any object that implements the :meth:`~object.__index__` special method). If the *step* argument is omitted, it defaults to ``1``. If the *start* argument is omitted, it defaults to ``0``. If *step* is zero, :exc:`ValueError` is raised.
el: Τα ορίσματα του κατασκευαστή εύρους (range constructor) πρέπει να είναι ακέραιοι αριθμοί (είτε της built-in :class:`int` ή οποιοδήποτε αντικείμενο που υλοποιεί την ειδική μέθοδο :meth:`~object.__index__`). Εάν το όρισμα *step* παραλείπεται, το προεπιλογή (default) είναι ``1``. Εάν το όρισμα *start* παραλείπεται, το προεπιλογή (default) είναι ``0``. Εάν το *step* είναι μηδέν, γίνεται raise ένα :exc:`ValueError`.

source: For a positive *step*, the contents of a range ``r`` are determined by the formula ``r[i] = start + step*i`` where ``i >= 0`` and ``r[i] < stop``.
el: Για ένα θετικό *βήμα*, τα περιεχόμενα του range (εύρους) ``r`` καθορίζονται από τον τύπο ``r[i] = start + step*i`` όπου ``i >= 0`` και ``r[i] < stop``.

source: For a negative *step*, the contents of the range are still determined by the formula ``r[i] = start + step*i``, but the constraints are ``i >= 0`` and ``r[i] > stop``.
el: Για ένα αρνητικό *βήμα*, τα περιεχόμενα του εύρους (range) εξακολουθούν να καθορίζονται από τον τύπο ``r[i] = start + step*i``, αλλά οι περιορισμοί είναι ``i >= 0`` και ``r[i] > stop``.

source: A range object will be empty if ``r[0]`` does not meet the value constraint. Ranges do support negative indices, but these are interpreted as indexing from the end of the sequence determined by the positive indices.
el: Ένα αντικείμενο range θα είναι άδειο εάν το ``r[0]`` δεν πληροί τον περιορισμό τιμής. Τα ranges υποστηρίζουν αρνητικούς δείκτες, αλλά αυτοί ερμηνεύονται ως δείκτες από το τέλος της ακολουθίας που καθορίζεται από τους θετικούς δείκτες.

source: Ranges containing absolute values larger than :data:`sys.maxsize` are permitted but some features (such as :func:`len`) may raise :exc:`OverflowError`.
el: Τα ranges που περιέχουν απόλυτες τιμές μεγαλύτερες από :data:`sys.maxsize` είναι επιτρεπτά, αλλά ορισμένα χαρακτηριστικά (όπως :func:`len`) μπορεί να κάνουν raise :exc:`OverflowError`.

source: Range examples::
el: Παραδείγματα Range::

source: Ranges implement all of the :ref:`common <typesseq-common>` sequence operations except concatenation and repetition (due to the fact that range objects can only represent sequences that follow a strict pattern and repetition and concatenation will usually violate that pattern).
el: Τα ranges υλοποιούν όλες τις ακολουθίες :ref:`common <typesseq-common>` εκτός από τη συνένωση και την επανάληψη (λόγω του γεγονότος ότι τα range αντικείμενα μπορούν να αναπαριστούν μόνο ακολουθίες που ακολουθούν ένα αυστηρό μοτίβο και η επανάληψη και η συνένωση συνήθως παραβιάζουν αυτό το πρότυπο).

source: The value of the *start* parameter (or ``0`` if the parameter was not supplied)
el: Η τιμή της παραμέτρου *start* (ή ``0`` αν η παράμετρος δεν παρέχεται)

source: The value of the *stop* parameter
el: Η τιμή της παραμέτρου *stop*

source: The value of the *step* parameter (or ``1`` if the parameter was not supplied)
el: Η τιμή της παραμέτρου *step* (ή ``1`` αν η παράμετρος δεν παρέχεται)

source: The advantage of the :class:`range` type over a regular :class:`list` or :class:`tuple` is that a :class:`range` object will always take the same (small) amount of memory, no matter the size of the range it represents (as it only stores the ``start``, ``stop`` and ``step`` values, calculating individual items and subranges as needed).
el: Το πλεονέκτημα του τύπου :class:`range` έναντι ενός κανονικού τύπου :class:`list` ή :class:`tuple` είναι ότι ένα αντικείμενο :class:`range` θα παίρνει πάντα το ίδιο (μικρό) ποσό μνήμης, ανεξάρτητα από το μέγεθος του range που αντιπροσωπεύει (μιας και αποθηκεύει μόνο τις τιμές ``start``, ``stop`` και ``step``, υπολογίζοντας τα μεμονωμένα στοιχεία και τις υποπεριοχές όπως απαιτείται).

source: Range objects implement the :class:`collections.abc.Sequence` ABC, and provide features such as containment tests, element index lookup, slicing and support for negative indices (see :ref:`typesseq`):
el: Τα αντικείμενα range υλοποιούν την :class:`collections.abc.Sequence` ABC, και παρέχουν χαρακτηριστικά όπως δοκιμές περιορισμού, αναζήτηση δείκτη στοιχείου, τεμαχισμό και υποστήριξη αρνητικών δεικτών (βλ. :ref:`typesseq`):

source: Testing range objects for equality with ``==`` and ``!=`` compares them as sequences. That is, two range objects are considered equal if they represent the same sequence of values. (Note that two range objects that compare equal might have different :attr:`~range.start`, :attr:`~range.stop` and :attr:`~range.step` attributes, for example ``range(0) == range(2, 1, 3)`` or ``range(0, 3, 2) == range(0, 4, 2)``.)
el: Ο έλεγχος των αντικειμένων range για ισότητα με ``==`` και ``!=`` τα συγκρίνει ως ακολουθίες. Δηλαδή, δύο αντικείμενα range θεωρούνται ίσα αν αντιπροσωπεύουν την ίδια ακολουθία τιμών. (Σημειώστε ότι δύο αντικείμενα range που συγκρίνονται ως ίσα μπορεί να έχουν διαφορετικά :attr:`~range.start`, :attr:`~range.stop` και :attr:`~range.step` χαρακτηριστικά, για παράδειγμα ``range(0) == range(2, 1, 3)`` ή ``range(0, 3, 2) == range(0, 4, 2)``.)

source: Implement the Sequence ABC. Support slicing and negative indices. Test :class:`int` objects for membership in constant time instead of iterating through all items.
el: Υλοποιείστε την ακολουθία ABC. Υποστηρίξτε την τμηματοποίηση και τους αρνητικούς δείκτες. Δοκιμάστε τα :class:`int` αντικείμενα για συμμετοχή σε σταθερό χρόνο αντί της επανάληψης σε όλα τα αντικείμενα.

source: Define '==' and '!=' to compare range objects based on the sequence of values they define (instead of comparing based on object identity).
el: Ορίστε τα '==' και '!=' για να συγκρίνετε αντικείμενα range με βάση την ακολουθία των τιμών που ορίζουν (αντί να συγκρίνουν με βάση την ταυτότητα του αντικειμένου).

source: Added the :attr:`~range.start`, :attr:`~range.stop` and :attr:`~range.step` attributes.
el: Προστέθηκαν τα :attr:`~range.start`, :attr:`~range.stop` και :attr:`~range.step` attributes.

source: The `linspace recipe <https://code.activestate.com/recipes/579000-equally-spaced-numbers-linspace/>`_ shows how to implement a lazy version of range suitable for floating-point applications.
el: Η συνταγή `linspace <https://code.activestate.com/recipes/579000-equally-spaced-numbers-linspace/>`_ δείχνει πώς να υλοποιήσετε μια lazy έκδοση του range κατάλληλη για εφαρμογές κινητής υποδιαστολής.

source: Text and Binary Sequence Type Methods Summary
el: Σύνοψη μεθόδων τύπου κειμένου και δυαδική ακολουθίας

source: The following table summarizes the text and binary sequence types methods by category.
el: Ο παρακάτω πίνακας συνοψίζει τις μεθόδους τύπων κειμένου και δυαδική ακολουθίας ανά κατηγορία.

source: Category
el: Κατηγορία

source: :class:`bytes` and :class:`bytearray` methods
el: οι μέθοδοι :class:`bytes` και :class:`bytearray`

source: Formatting
el: Μορφοποίηση

source: Searching and Replacing
el: Αναζήτηση και Αντικατάσταση

source: Splitting and Joining
el: Διαχωρισμός και Ένωση

source: String Classification
el: Ταξινόμηση Συμβολοσειρών

source: Case Manipulation
el: Χειρισμός υποθέσεων

source: Padding and Stripping
el: Συμπλήρωση και Αφαίρεση

source: Translation and Encoding
el: Μετάφραση και Κωδικοποίηση

source: Text Sequence Type --- :class:`str`
el: Τύπος Ακολουθίας (Sequence) Κειμένου --- :class:`str`

source: Textual data in Python is handled with :class:`str` objects, or :dfn:`strings`. Strings are immutable :ref:`sequences <typesseq>` of Unicode code points. String literals are written in a variety of ways:
el: Τα δεδομένα κειμένου στην Python αντιμετωπίζονται με αντικείμενα :class:`str` ή :dfn:`strings`. Τα αλφαριθμητικά (strings) είναι αμετάβλητες :ref:`sequences <typesseq>` των Unicode points. Τα αλφαριθμητικά γράφονται με διάφορους τρόπους:

source: Single quotes: ``'allows embedded "double" quotes'``
el: Απλά εισαγωγικά: ``'allows embedded "double" quotes'``

source: Double quotes: ``"allows embedded 'single' quotes"``
el: Διπλά εισαγωγικά: ``'allows embedded "double" quotes'``

source: Triple quoted: ``'''Three single quotes'''``, ``"""Three double quotes"""``
el: Τριπλά εισαγωγικά: ``'''Three single quotes'''``, ``"""Three double quotes"""``

source: Triple quoted strings may span multiple lines - all associated whitespace will be included in the string literal.
el: Τα αλφαριθμητικά σε τριπλά εισαγωγικά μπορούν να καλύπτουν πολλές γραμμές - όλα τα σχετικά κενά θα συμπεριληφθούν στο αλφαριθμητικό.

source: String literals that are part of a single expression and have only whitespace between them will be implicitly converted to a single string literal. That is, ``("spam " "eggs") == "spam eggs"``.
el: Τα Αλφαριθμητικά (strings) που αποτελούν μέρος μιας ενιαίας έκφρασης και έχουν μόνο κενά μεταξύ τους, θα μετατραπούν σιωπηρά σε ένα ενιαίο αλφαριθμητικό literal. Δηλαδή, ``("spam " "eggs") == "spam eggs"``.

source: See :ref:`strings` for more about the various forms of string literal, including supported :ref:`escape sequences <escape-sequences>`, and the ``r`` ("raw") prefix that disables most escape sequence processing.
el: Δείτε τα :ref:`strings` για περισσότερες πληροφορίες σχετικά με τις διάφορες μορφές των αλφαριθμητικών, συμπεριλαμβανομένων των υποστηριζόμενων ακολουθιών :ref:`escape sequences <escape-sequences>`, και του ``r`` ("raw") πρόθεμα που απενεργοποιεί την επεξεργασία των περισσότερων ακολουθιών διαφυγής.

source: Strings may also be created from other objects using the :class:`str` constructor.
el: Τα αλφαριθμητικά (strings) μπορούν επίσης να δημιουργηθούν από άλλα αντικείμενα χρησιμοποιώντας τον constructor :class:`str`.

source: Since there is no separate "character" type, indexing a string produces strings of length 1. That is, for a non-empty string *s*, ``s[0] == s[0:1]``.
el: Εφόσον δεν υπάρχει ξεχωριστός τύπος "character", το indexing μιας συμβολοσειράς (string) παράγει συμβολοσειρές μήκους 1. Δηλαδή, για μια μη κενή συμβολοσειρά *s*, ``s[0] == s[0:1]``.

source: There is also no mutable string type, but :meth:`str.join` or :class:`io.StringIO` can be used to efficiently construct strings from multiple fragments.
el: Δεν υπάρχει επίσης μεταβλητός τύπος συμβολοσειράς (string), αλλά το :meth:`str.join` ή το :class:`io.StringIO` μπορεί να χρησιμοποιηθεί για την αποτελεσματική κατασκευή συμβολοσειρών από πολλαπλά μέρη.

source: For backwards compatibility with the Python 2 series, the ``u`` prefix is once again permitted on string literals. It has no effect on the meaning of string literals and cannot be combined with the ``r`` prefix.
el: Για συμβατότητα προς τα πίσω (backwards compatibility) με τη σειρά Python 2, το πρόθεμα ``u`` είναι επιτρεπτό και πάλι σε αλφαριθμητικά. Δεν έχει καμία επίδραση στη σημασία των αλφαριθμητικών και δεν μπορεί να συνδυαστεί με το πρόθεμα ``r``.

source: Return a :ref:`string <textseq>` version of *object*. If *object* is not provided, returns the empty string. Otherwise, the behavior of ``str()`` depends on whether *encoding* or *errors* is given, as follows.
el: Επιστρέφει μια έκδοση :ref:`string <textseq>` του *object*. Αν το *object* δεν παρέχεται, επιστρέφει κενό αλφαριθμητικό. Διαφορετικά, η συμπεριφορά της ``str()`` εξαρτάται από το αν δίνεται *encoding* ή *errors*, ως εξής.

source: If neither *encoding* nor *errors* is given, ``str(object)`` returns :meth:`type(object).__str__(object) <object.__str__>`, which is the "informal" or nicely printable string representation of *object*. For string objects, this is the string itself. If *object* does not have a :meth:`~object.__str__` method, then :func:`str` falls back to returning :func:`repr(object) <repr>`.
el: Αν δεν έχει δοθεί ούτε *encoding* ούτε *errors*, το ``str(object)`` επιστρέφει :meth:`type(object).__str__(object) <object.__str__>`, το οποίο είναι το "informal" ή ωραία εκτυπώσιμη αναπαράσταση συμβολοσειράς (string) του *object*. Για αντικείμενα συμβολοσειράς, είναι η ίδια η συμβολοσειρά. Εάν το *object* δεν έχει την :meth:`~object.__str__`, τότε η :func:`str` επιστρέφει τη μέθοδο :func:`repr(object) <repr>`.

source: If at least one of *encoding* or *errors* is given, *object* should be a :term:`bytes-like object` (e.g. :class:`bytes` or :class:`bytearray`). In this case, if *object* is a :class:`bytes` (or :class:`bytearray`) object, then ``str(bytes, encoding, errors)`` is equivalent to :meth:`bytes.decode(encoding, errors) <bytes.decode>`. Otherwise, the bytes object underlying the buffer object is obtained before calling :meth:`bytes.decode`. See :ref:`binaryseq` and :ref:`bufferobjects` for information on buffer objects.
el: Εάν δίνεται τουλάχιστον ένα από τα *encoding* ή *errors*, το *object* θα πρέπει να είναι ένα :term:`bytes-like object` (π.χ. :class:`bytes` ή :class:`bytearray`). Σε αυτή την περίπτωση, αν το *object* είναι ένα αντικείμενο :class:`bytes` (ή :class:`bytearray`), τότε το ``str(bytes, encoding, errors)`` είναι ισοδύναμο με το :meth:`bytes.decode(encoding, errors) <bytes.decode>`. Διαφορετικά, το αντικείμενο bytes που υποκρύπτει το αντικείμενο buffer λαμβάνεται πριν από την κλήση του :meth:`bytes.decode`. Δείτε :ref:`binaryseq` και :ref:`bufferobjects` για πληροφορίες σχετικά με τα αντικείμενα buffer.

source: Passing a :class:`bytes` object to :func:`str` without the *encoding* or *errors* arguments falls under the first case of returning the informal string representation (see also the :option:`-b` command-line option to Python). For example::
el: Πέρασμα ενός αντικειμένου :class:`bytes` στο :func:`str` χωρίς το *encoding* ή το *errors* ορίσματα εμπίπτει στην πρώτη περίπτωση επιστροφής της άτυπης αναπαράστασης συμβολοσειράς (string) (δείτε επίσης την επιλογή :option:`-b` της γραμμής εντολών για Python). Για παράδειγμα::

source: For more information on the ``str`` class and its methods, see :ref:`textseq` and the :ref:`string-methods` section below. To output formatted strings, see the :ref:`f-strings` and :ref:`formatstrings` sections. In addition, see the :ref:`stringservices` section.
el: Για περισσότερες πληροφορίες σχετικά με την κλάση ``str`` και τις μεθόδους της, δείτε :ref:`textseq` και την ενότητα :ref:`string-methods` παρακάτω. Για την παραγωγή μορφοποιημένων συμβολοσειρών (string), ανατρέξτε στις ενότητες :ref:`f-strings` και :ref:`formatstrings`. Επιπλέον, δείτε την ενότητα :ref:`stringservices`.

source: String Methods
el: Μέθοδοι Συμβολοσειράς (String)

source: Strings implement all of the :ref:`common <typesseq-common>` sequence operations, along with the additional methods described below.
el: Οι συμβολοσειρές (string) υλοποιούν όλες τις λειτουργίες των :ref:`common <typesseq-common>` ακολουθιών, μαζί με τις πρόσθετες μεθόδους που περιγράφονται παρακάτω.
