Repository: thepetk/python-docs-gr
Catalog: library/stdtypes.po
Languages: el

source: The user-exposed type for the union object can be accessed from :class:`typing.Union` and used for :func:`isinstance` checks::
el: Ο τύπος που εκτίθεται από τον χρήστη για το αντικείμενο ένωσης μπορεί να προσπελαστεί από το :data:`types.UnionType` και να χρησιμοποιηθεί για ελέγχους :func:`isinstance`.

source: The :meth:`!__or__` method for type objects was added to support the syntax ``X | Y``. If a metaclass implements :meth:`!__or__`, the Union may override it:
el: Η μέθοδος :meth:`!__or__` για αντικείμενα τύπου προστέθηκε για να υποστηρίξει τη σύνταξη ``X | Y``. Εάν μια μετακλάση υλοποιεί :meth:`!__or__`, η Ένωση μπορεί να την παρακάμψει:

source: :pep:`604` -- PEP proposing the ``X | Y`` syntax and the Union type.
el: :pep:`604` -- Το PEP προτείνει τη σύνταξη ``X | Y`` και τον τύπο Ένωση.

source: Union objects are now instances of :class:`typing.Union`. Previously, they were instances of :class:`types.UnionType`, which remains an alias for :class:`typing.Union`.
el: Τα αντικείμενα Union είναι πλέον στιγμιότυπα του :class:`typing.Union`. Προηγουμένως, ήταν στιγμιότυπα της :class:`types.UnionType`, το οποίο παραμείνει ένα ψευδώνυμο για τη :class:`typing.Union`.

source: Other Built-in Types
el: Άλλοι Ενσωματωμένοι (built-in) Τύποι

source: The interpreter supports several other kinds of objects. Most of these support only one or two operations.
el: Ο διερμηνέας υποστηρίζει πολλά άλλα είδη αντικειμένων. Τα περισσότερα από αυτά υποστηρίζουν μόνο μία ή δύο λειτουργίες.

source: The only special operation on a module is attribute access: ``m.name``, where *m* is a module and *name* accesses a name defined in *m*'s symbol table. Module attributes can be assigned to. (Note that the :keyword:`import` statement is not, strictly speaking, an operation on a module object; ``import foo`` does not require a module object named *foo* to exist, rather it requires an (external) *definition* for a module named *foo* somewhere.)
el: Η μόνη ειδική λειτουργία σε ένα module είναι η πρόσβαση χαρακτηριστικών: ``m.name``, όπου το *m* είναι ένα module και το *name* έχει πρόσβαση σε ένα όνομα που ορίζεται στον πίνακα συμβόλων του *m*. Τα χαρακτηριστικά του module μπορούν να εκχωρηθούν. (Σημειώστε ότι η δήλωση :keyword:`import` δεν είναι, αυστηρά, μια λειτουργία σε ένα αντικείμενο module· το ``import foo`` δεν απαιτεί να υπάρχει ένα αντικείμενο module με το όνομα *foo* αλλά απαιτεί έναν (εξωτερικό) *definition* για ένα module που ονομάζεται *foo* κάπου.)

source: A special attribute of every module is :attr:`~object.__dict__`. This is the dictionary containing the module's symbol table. Modifying this dictionary will actually change the module's symbol table, but direct assignment to the :attr:`~object.__dict__` attribute is not possible (you can write ``m.__dict__['a'] = 1``, which defines ``m.a`` to be ``1``, but you can't write ``m.__dict__ = {}``). Modifying :attr:`~object.__dict__` directly is not recommended.
el: Ένα ειδικό χαρακτηριστικό κάθε module είναι :attr:`~object.__dict__`. Αυτό είναι το λεξικό που περιέχει τον πίνακα συμβόλων της ενότητας. Η τροποποίηση αυτού του λεξικού θα αλλάξει στην πραγματικότητα τον πίνακα συμβόλων του module, αλλά η απευθείας εκχώρηση στο χαρακτηριστικό :attr:`~object.__dict__` δεν είναι δυνατή (μπορείτε να γράψετε ``m.__dict__['a'] = 1``, που ορίζει το ``m.a`` να είναι ``1``, αλλά δεν μπορείτε να γράψετε ``m.__dict__ = {}``). Δεν συνίσταται η απευθείας τροποποίηση του :attr:`~object.__dict__`.

source: Modules built into the interpreter are written like this: ``<module 'sys' (built-in)>``. If loaded from a file, they are written as ``<module 'os' from '/usr/local/lib/pythonX.Y/os.pyc'>``.
el: Τα modules που είναι ενσωματωμένες στον διερμηνέα γράφονται ως εξής: ``<module 'sys' (built-in)>``. Εάν φορτωθούν από ένα αρχείο, γράφονται ως ``<module 'os' from '/usr/local/lib/pythonX.Y/os.pyc'>``.

source: Classes and Class Instances
el: Κλάσεις και Στιγμιότυπα Κλάσης

source: See :ref:`objects` and :ref:`class` for these.
el: Δείτε :ref:`objects` και :ref:`class` για αυτά.

source: Functions
el: Συναρτήσεις

source: Function objects are created by function definitions. The only operation on a function object is to call it: ``func(argument-list)``.
el: Τα αντικείμενα συναρτήσεων δημιουργούνται από ορισμούς συναρτήσεων. Η μόνη λειτουργία σε ένα αντικείμενο συνάρτησης είναι να το ονομάσουμε: ``func(argument-list)``.

source: There are really two flavors of function objects: built-in functions and user-defined functions. Both support the same operation (to call the function), but the implementation is different, hence the different object types.
el: Υπάρχουν πραγματικά δύο είδη αντικειμένων συναρτήσεων: ενσωματωμένες συναρτήσεις και συναρτήσεις που καθορίζονται από τον χρήστη. Και οι δύο υποστηρίζουν την ίδια λειτουργία (για να καλέσετε τη συνάρτηση), αλλά η υλοποίηση είναι διαφορετική, εξ ου και οι διαφορετικοί τύποι αντικειμένων.

source: See :ref:`function` for more information.
el: Δείτε το :ref:`function` για περισσότερες πληροφορίες.

source: Methods
el: Μέθοδοι

source: Methods are functions that are called using the attribute notation. There are two flavors: :ref:`built-in methods <builtin-methods>` (such as :meth:`append` on lists) and :ref:`class instance method <instance-methods>`. Built-in methods are described with the types that support them.
el: Οι μέθοδοι είναι συναρτήσεις που καλούνται χρησιμοποιώντας το notation χαρακτηριστικών. Υπάρχουν δύο είδη: :ref:`built-in methods <builtin-methods>` (όπως η :meth:`append` στις λίστες) και :ref:`class instance method <instance-methods>`. Οι ενσωματωμένες μέθοδοι περιγράφονται με τους τύπους που τις υποστηρίζουν.

source: If you access a method (a function defined in a class namespace) through an instance, you get a special object: a :dfn:`bound method` (also called :ref:`instance method <instance-methods>`) object. When called, it will add the ``self`` argument to the argument list. Bound methods have two special read-only attributes: :attr:`m.__self__ <method.__self__>` is the object on which the method operates, and :attr:`m.__func__ <method.__func__>` is the function implementing the method. Calling ``m(arg-1, arg-2, ..., arg-n)`` is completely equivalent to calling ``m.__func__(m.__self__, arg-1, arg-2, ..., arg-n)``.
el: Εάν αποκτήσετε πρόσβαση σε μια μέθοδο (μια συνάρτηση που ορίζεται μια namespace κλάση) μέσω ενός στιγμιοτύπου, λαμβάνετε ένα ειδικό αντικείμενο: ένα αντικείμενο :dfn:`bound method` (ονομάζεται επίσης :ref:`instance method <instance-methods>`). Όταν καλείται, θα προσθέσει το όρισμα ``self`` στη λίστα ορισμάτων. Οι δεσμευμένες μέθοδοι έχουν δύο ειδικά χαρακτηριστικά μόνο για ανάγνωση: :attr:`m.__self__ <method.__self__>` είναι το αντικείμενο στο οποίο λειτουργεί η μέθοδος και :attr:`m.__func__ <method.__func__>` είναι η συνάρτηση που υλοποιεί την μέθοδο. Η κλήση του ``m(arg-1, arg-2, ..., arg-n)`` είναι απολύτως ισοδύναμη με την κλήση του ``m.__func__(m.__self__, arg-1, arg-2, ..., arg-n)``.

source: Like :ref:`function objects <user-defined-funcs>`, bound method objects support getting arbitrary attributes. However, since method attributes are actually stored on the underlying function object (:attr:`method.__func__`), setting method attributes on bound methods is disallowed. Attempting to set an attribute on a method results in an :exc:`AttributeError` being raised. In order to set a method attribute, you need to explicitly set it on the underlying function object:
el: Όπως τα :ref:`function objects <user-defined-funcs>`, τα αντικείμενα δεσμευμένης μεθόδου υποστηρίζουν τη λήψη αυθαίρετων χαρακτηριστικών. Ωστόσο, δεδομένου ότι τα χαρακτηριστικά της μεθόδου αποθηκεύονται στην πραγματικότητα στο υποκείμενο αντικείμενο συνάρτησης (:attr:`method.__func__`), ο ορισμός χαρακτηριστικών μεθόδου σε δεσμευμένες μεθόδους δεν επιτρέπεται. Η προσπάθεια ορισμού ενός χαρακτηριστικού σε μια μέθοδο έχει ως αποτέλεσμα να γίνει raise η :exc:`AttributeError`. Για να ορίσετε ένα χαρακτηριστικό μεθόδου πρέπει να το ορίσετε ρητά στο υποκείμενο αντικείμενο συνάρτησης:

source: See :ref:`instance-methods` for more information.
el: Δείτε το :ref:`instance-methods` για περισσότερες πληροφορίες.

source: Code Objects
el: Αντικείμενα Κώδικα

source: Code objects are used by the implementation to represent "pseudo-compiled" executable Python code such as a function body. They differ from function objects because they don't contain a reference to their global execution environment. Code objects are returned by the built-in :func:`compile` function and can be extracted from function objects through their :attr:`~function.__code__` attribute. See also the :mod:`code` module.
el: Τα αντικείμενα κώδικα χρησιμοποιούνται από την υλοποίηση για να αναπαραστήσουν τον "ψευδο-μεταγλωττισμένο" εκτελέσιμο κώδικα Python, όπως ένα σώμα συνάρτησης. Διαφέρουν από τα αντικείμενα συνάρτησης επειδή δεν περιέχουν αναφορά στο παγκόσμιο (global) περιβάλλον εκτέλεσης τους. Τα αντικείμενα κώδικα επιστρέφονται από την ενσωματωμένη συνάρτηση :func:`compile` και μπορεί να εξαχθεί από τα αντικείμενα συνάρτησης μέσω του χαρακτηριστικού τους :attr:`~function.__code__`. Δείτε επίσης το module :mod:`code`.

source: Accessing :attr:`~function.__code__` raises an :ref:`auditing event <auditing>` ``object.__getattr__`` with arguments ``obj`` and ``"__code__"``.
el: Η πρόσβαση στη :attr:`~function.__code__` κάνει raise ένα :ref:`auditing event <auditing>` ``object.__getattr__`` με ορίσματα ``obj`` και ``"__code__"``.

source: A code object can be executed or evaluated by passing it (instead of a source string) to the :func:`exec` or :func:`eval` built-in functions.
el: Ένα αντικείμενο κώδικα μπορεί να εκτελεστεί ή να αξιολογηθεί περνώντας το (αντί για πηγαία συμβολοσειρά) στις ενσωματωμένες συναρτήσεις :func:`exec` ή :func:`eval`.

source: See :ref:`types` for more information.
el: Δείτε :ref:`types` για περισσότερες πληροφορίες.

source: Type Objects
el: Τύποι Αντικειμένων

source: Type objects represent the various object types. An object's type is accessed by the built-in function :func:`type`. There are no special operations on types. The standard module :mod:`types` defines names for all standard built-in types.
el: Τα αντικείμενα τύπου αντιπροσωπεύουν τους διάφορους τύπους αντικειμένων. Ο τύπος ενός αντικειμένου προσεγγίζεται από την ενσωματωμένη συνάρτηση :func:`type`. Δεν υπάρχουν ειδικές λειτουργίες στους τύπους. Το τυπικό (standard) module :mod:`types` ορίζει ονόματα για όλους τους τυπικούς ενσωματωμένους τύπους.

source: Types are written like this: ``<class 'int'>``.
el: Οι τύποι γράφονται ως εξής: ``<class 'int'>``.

source: The Null Object
el: Το Αντικείμενο Null

source: This object is returned by functions that don't explicitly return a value. It supports no special operations. There is exactly one null object, named ``None`` (a built-in name). ``type(None)()`` produces the same singleton.
el: Αυτό το αντικείμενο επιστρέφεται από συναρτήσεις που δεν επιστρέφουν ρητά μια τιμή. Δεν υποστηρίζει ειδικές λειτουργίες. Υπάρχει ακριβώς ένα μηδενικό αντικείμενο, που ονομάζεται ``None`` (ένα ενσωματωμένο όνομα). Το ``type(None)()`` παράγει το ίδιο singleton.

source: It is written as ``None``.
el: Γράφεται ως ``None``.

source: The Ellipsis Object
el: Το αντικείμενο Ellipsis

source: This object is commonly used by slicing (see :ref:`slicings`). It supports no special operations. There is exactly one ellipsis object, named :const:`Ellipsis` (a built-in name). ``type(Ellipsis)()`` produces the :const:`Ellipsis` singleton.
el: Αυτό το αντικείμενο χρησιμοποιείται συνήθως με λειτουργία τμηματοποίησης (δείτε :ref:`slicings`). Δεν υποστηρίζει ειδικές λειτουργίες. Υπάρχει ακριβώς ένα αντικείμενο έλλειψης, που ονομάζεται :const:`Ellipsis` (ένα ενσωματωμένο όνομα). Το ``type(Ellipsis)()`` παράγει το :const:`Ellipsis` singleton.

source: It is written as ``Ellipsis`` or ``...``.
el: Γράφεται ως ``Ellipsis`` ή ``...``.

source: The NotImplemented Object
el: Το NotImplemented Αντικείμενο

source: This object is returned from comparisons and binary operations when they are asked to operate on types they don't support. See :ref:`comparisons` for more information. There is exactly one :data:`NotImplemented` object. :code:`type(NotImplemented)()` produces the singleton instance.
el: Αυτό το αντικείμενο επιστρέφεται από συγκρίσεις και δυαδικές λειτουργίες όταν τους ζητείται να λειτουργήσουν σε τύπους που δεν υποστηρίζουν. Δείτε το :ref:`comparisons` για περισσότερες πληροφορίες. Υπάρχει ακριβώς ένα αντικείμενο :data:`NotImplemented`. Το :code:`type(NotImplemented)()` παράγει το στιγμιότυπο singleton.

source: It is written as :code:`NotImplemented`.
el: Είναι γραμμένο ως :code:`NotImplemented`.

source: Internal Objects
el: Εσωτερικά Αντικείμενα

source: See :ref:`types` for this information. It describes :ref:`stack frame objects <frame-objects>`, :ref:`traceback objects <traceback-objects>`, and slice objects.
el: Δείτε :ref:`types` για αυτές τις πληροφορίες. Περιγράφει :ref:`stack frame objects <frame-objects>`, :ref:`traceback objects <traceback-objects>`, και αντικείμενα τμηματοποίησης.

source: Special Attributes
el: Ειδικά Χαρακτηριστικά

source: The implementation adds a few special read-only attributes to several object types, where they are relevant. Some of these are not reported by the :func:`dir` built-in function.
el: Η υλοποίηση προσθέτει μερικά ειδικά χαρακτηριστικά μόνο για ανάγνωση σε διάφορους τύπους αντικειμένων, όπου είναι σχετικά. Ορισμένα από αυτά δεν αναφέρονται από την ενσωματωμένη συνάρτηση :func:`dir`.

source: The name of the class, function, method, descriptor, or generator instance.
el: Το όνομα της κλάσης, της συνάρτησης, της μεθόδου, του descriptor ή του στιγμιοτύπου generator.

source: The :term:`qualified name` of the class, function, method, descriptor, or generator instance.
el: Το :term:`qualified name` της κλάσης, της συνάρτησης, της μεθόδου, του descriptor, ή του στιγμιοτύπου generator.

source: The name of the module in which a class or function was defined.
el: Το όνομα του module στο οποίο ορίστηκε μια κλάση ή μια συνάρτηση.

source: The documentation string of a class or function, or ``None`` if undefined.
el: Η συμβολοσειρά τεκμηρίωσης μιας κλάσης ή συνάρτησης ή ``None`` εάν δεν έχει οριστεί.

source: The :ref:`type parameters <type-params>` of generic classes, functions, and :ref:`type aliases <type-aliases>`. For classes and functions that are not generic, this will be an empty tuple.
el: Οι παράμετροι :ref:`type parameters <type-params>` των γενικών κλάσεων, συναρτήσεων και :ref:`type aliases <type-aliases>`. Για κλάσεις και συναρτήσεις που δεν είναι γενικές, αυτή θα είναι μια κενή πλειάδα.

source: Integer string conversion length limitation
el: Περιορισμός μήκους μετατροπής συμβολοσειράς ακέραιου αριθμού

source: CPython has a global limit for converting between :class:`int` and :class:`str` to mitigate denial of service attacks. This limit *only* applies to decimal or other non-power-of-two number bases. Hexadecimal, octal, and binary conversions are unlimited. The limit can be configured.
el: Η CPython έχει ένα παγκόσμιο όριο για τη μετατροπή μεταξύ :class:`int` and :class:`str` για τον μετριασμό των επιθέσεων άρνησης υπηρεσίας. Αυτό το όριο ισχύει *μόνο* για δεκαδικές ή άλλες βάσεις αριθμών που δεν έχουν την δύναμη του δύο. Οι δεξαεξαδικές, οκταδικές, και δυαδικές μετατροπές είναι απεριόριστες. Το όριο μπορεί να διαμορφωθεί.

source: The :class:`int` type in CPython is an arbitrary length number stored in binary form (commonly known as a "bignum"). There exists no algorithm that can convert a string to a binary integer or a binary integer to a string in linear time, *unless* the base is a power of 2. Even the best known algorithms for base 10 have sub-quadratic complexity. Converting a large value such as ``int('1' * 500_000)`` can take over a second on a fast CPU.
el: Ο τύπος :class:`int` στην CPython είναι ένας αυθαίρετος αριθμός μήκους που είναι αποθηκευμένος σε δυαδική μορφή (κοινώς γνωστός ως "bignum"). Δεν υπάρχει αλγόριθμος που να μπορεί να μετατρέψει μια συμβολοσειρά σε δυαδικό ακέραιο ή δυαδικό ακέραιο σε μια συμβολοσειρά σε γραμμικό χρόνο, *εκτός* εάν η βάση είναι δύναμη του 2. Ακόμη και οι πιο γνωστοί αλγόριθμοι για τη βάση 10 έχουν υποτετραγωνική πολυπλοκότητα. Η μετατροπή μιας μεγάλης τιμής όπως ``int('1' * 500_000)`` μπορεί να διαρκέσει περισσότερο από ένα δευτερόλεπτο σε μια γρήγορη CPU.

source: Limiting conversion size offers a practical way to avoid :cve:`2020-10735`.
el: Ο περιορισμός του μεγέθους μετατροπής προσφέρει έναν πρακτικό τρόπο αποφυγής του :cve:`2020-10735`.

source: The limit is applied to the number of digit characters in the input or output string when a non-linear conversion algorithm would be involved. Underscores and the sign are not counted towards the limit.
el: Το όριο εφαρμόζεται στον αριθμό των ψηφιακών χαρακτήρων στη συμβολοσειρά εισόδου ή εξόδου όταν εμπλέκεται ένας μη γραμμικός αλγόριθμος μετατροπής. Τα underscores και το πρόσημο δεν υπολογίζονται στο όριο.

source: When an operation would exceed the limit, a :exc:`ValueError` is raised:
el: Όταν μια λειτουργία υπερβαίνει το όριο, γίνεται raise μια :exc:`ValueError`:

source: The default limit is 4300 digits as provided in :data:`sys.int_info.default_max_str_digits <sys.int_info>`. The lowest limit that can be configured is 640 digits as provided in :data:`sys.int_info.str_digits_check_threshold <sys.int_info>`.
el: Το προεπιλεγμένο όριο είναι 4300 ψηφία όπως προβλέπεται στο :data:`sys.int_info.default_max_str_digits <sys.int_info>`. Το κατώτατο όριο που μπορεί να διαμορφωθεί είναι 640 ψηφία όπως προβλέπεται στο :data:`sys.int_info.str_digits_check_threshold <sys.int_info>`.

source: Verification:
el: Επαλήθευση:

source: Affected APIs
el: Επηρεασμένα APIs

source: The limitation only applies to potentially slow conversions between :class:`int` and :class:`str` or :class:`bytes`:
el: Ο περιορισμός ισχύει μόνο για δυνητικά αργές μετατροπές μεταξύ :class:`int` και :class:`str` ή :class:`bytes`:

source: ``int(string)`` with default base 10.
el: ``int(string)`` με default βάση το 10.

source: ``int(string, base)`` for all bases that are not a power of 2.
el: ``int(string, base)`` για όλες τις βάσεις που δεν είναι δύναμη του 2.

source: any other string conversion to base 10, for example ``f"{integer}"``, ``"{}".format(integer)``, or ``b"%d" % integer``.
el: οποιαδήποτε άλλη μετατροπή συμβολοσειράς στη βάση 10, για παράδειγμα ``f"{integer}"``, ``"{}".format(integer)``, ή ``b"%d" % integer``.

source: The limitations do not apply to functions with a linear algorithm:
el: Οι περιορισμοί δεν ισχύουν για συναρτήσεις με γραμμικό αλγόριθμο:

source: ``int(string, base)`` with base 2, 4, 8, 16, or 32.
el: ``int(string, base)`` με βάση 2, 4, 8, 16, ή 32.

source: :func:`int.from_bytes` and :func:`int.to_bytes`.
el: :func:`int.from_bytes` και :func:`int.to_bytes`.

source: :ref:`formatspec` for hex, octal, and binary numbers.
el: :ref:`formatspec` για δεκαεξαδικούς, οκταδικούς και δυαδικούς αριθμούς.

source: :class:`str` to :class:`float`.
el: :class:`str` σε :class:`float`.

source: :class:`str` to :class:`decimal.Decimal`.
el: :class:`str` σε :class:`decimal.Decimal`.

source: Configuring the limit
el: Διαμόρφωση ορίου

source: Before Python starts up you can use an environment variable or an interpreter command line flag to configure the limit:
el: Πριν από την εκκίνηση της Python, μπορείτε να χρησιμοποιήσετε μια μεταβλητή περιβάλλοντος ή ένα δείκτη γραμμής εντολών διερμηνέα για να διαμορφώσετε το όριο:

source: :envvar:`PYTHONINTMAXSTRDIGITS`, e.g. ``PYTHONINTMAXSTRDIGITS=640 python3`` to set the limit to 640 or ``PYTHONINTMAXSTRDIGITS=0 python3`` to disable the limitation.
el: :envvar:`PYTHONINTMAXSTRDIGITS`, π.χ. ``PYTHONINTMAXSTRDIGITS=640 python3`` για να ορίσετε το όριο σε 640 ή ``PYTHONINTMAXSTRDIGITS=0 python3`` για να απενεργοποιήσετε τον περιορισμό.

source: :option:`-X int_max_str_digits <-X>`, e.g. ``python3 -X int_max_str_digits=640``
el: :option:`-X int_max_str_digits <-X>`, π.χ. ``python3 -X int_max_str_digits=640``

source: :data:`sys.flags.int_max_str_digits` contains the value of :envvar:`PYTHONINTMAXSTRDIGITS` or :option:`-X int_max_str_digits <-X>`. If both the env var and the ``-X`` option are set, the ``-X`` option takes precedence. A value of *-1* indicates that both were unset, thus a value of :data:`sys.int_info.default_max_str_digits` was used during initialization.
el: Το :data:`sys.flags.int_max_str_digits` περιέχει την τιμή :envvar:`PYTHONINTMAXSTRDIGITS` ή :option:`-X int_max_str_digits <-X>`. Εάν και η επιλογή env var και η επιλογή ``-X`` είναι καθορισμένη, η επιλογή ``-X`` έχει προτεραιότητα. Μια τιμή *-1* υποδεικνύει ότι και τα δύο δεν ορίστηκαν, επομένως χρησιμοποιήθηκε μια τιμή :data:`sys.int_info.default_max_str_digits` κατά την προετοιμασία.

source: From code, you can inspect the current limit and set a new one using these :mod:`sys` APIs:
el: Από τον κώδικα, μπορείτε να επιθεωρήσετε το τρέχον όριο και να ορίσετε ένα νέο χρησιμοποιώντας αυτά τα :mod:`sys` APIs:

source: :func:`sys.get_int_max_str_digits` and :func:`sys.set_int_max_str_digits` are a getter and setter for the interpreter-wide limit. Subinterpreters have their own limit.
el: Οι :func:`sys.get_int_max_str_digits` και :func:`sys.set_int_max_str_digits` είναι ένας getter και setter για το όριο σε όλο τον διερμηνέα. Οι δευτερεύοντες διερμηνείς έχουν το δικό τους όριο.

source: Information about the default and minimum can be found in :data:`sys.int_info`:
el: Πληροφορίες σχετικά με την προεπιλογή και το ελάχιστο μπορούν να βρεθούν στο :data:`sys.int_info`:

source: :data:`sys.int_info.default_max_str_digits <sys.int_info>` is the compiled-in default limit.
el: Το :data:`sys.int_info.default_max_str_digits <sys.int_info>` είναι το μεταγλωττισμένο προεπιλεγμένο όριο.

source: :data:`sys.int_info.str_digits_check_threshold <sys.int_info>` is the lowest accepted value for the limit (other than 0 which disables it).
el: Το :data:`sys.int_info.str_digits_check_threshold <sys.int_info>` είναι η χαμηλότερη αποδεκτή τιμή για το όριο (εκτός από το 0 που το απενεργοποιεί).

source: Setting a low limit *can* lead to problems. While rare, code exists that contains integer constants in decimal in their source that exceed the minimum threshold. A consequence of setting the limit is that Python source code containing decimal integer literals longer than the limit will encounter an error during parsing, usually at startup time or import time or even at installation time - anytime an up to date ``.pyc`` does not already exist for the code. A workaround for source that contains such large constants is to convert them to ``0x`` hexadecimal form as it has no limit.
el: Ο ορισμός ενός χαμηλού ορίου *μπορεί* να οδηγήσει σε προβλήματα. Αν και σπάνιος, υπάρχει κώδικας που περιέχει ακέραιες σταθερές σε δεκαδικό αριθμό στην πηγή τους που υπερβαίνουν το ελάχιστο όριο. Συνέπεια της ρύθμισης του ορίου είναι ότι ο πηγαίος κώδικας Python που περιέχει δεκαδικούς ακέραιους αριθμούς μεγαλύτερους από το όριο θα αντιμετωπίσει σφάλμα κατά την ανάλυση, συνήθως κατά την εκκίνηση ή την ώρα της εισαγωγής ή ακόμα και κατά την εγκατάσταση - ανά πάσα στιγμή είναι ενημερωμένο ``.pyc`` δεν υπάρχει ήδη για τον κώδικα. Μια λύση για τον πηγαίο που περιέχει τόσο μεγάλες σταθερές είναι να τις μετατρέψετε σε δεκαεξαδική μορφή ``0x`` καθώς δεν έχει όριο.
