Repository: thepetk/python-docs-gr
Catalog: library/stdtypes.po
Languages: el

source: Return a copy of the string with leading characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a prefix; rather, all combinations of its values are stripped::
el: Επιστρέφει ένα αντίγραφο της συμβολοσειράς (string) με την αφαίρεση των αρχικών χαρακτήρων. Τα *chars* είναι μια συμβολοσειρά που καθορίζει το σύνολο των χαρακτήρων που πρέπει να αφαιρεθούν. Εάν παραλειφθεί ή είναι ``None``, το όρισμα *chars* έχει ως default την αφαίρεση των κενών χαρακτήρων. Το όρισμα *chars* δεν είναι ένα πρόθεμα· οπότε, όλοι οι συνδυασμοί των τιμών του αφαιρούνται::

source: See :meth:`str.removeprefix` for a method that will remove a single prefix string rather than all of a set of characters. For example::
el: Δείτε την :meth:`str.removeprefix` για μια μέθοδο που θα αφαιρέσει ένα μόνο πρόθεμα συμβολοσειράς (string) αντί για όλο το σύνολο των χαρακτήρων. Για παράδειγμα::

source: This static method returns a translation table usable for :meth:`str.translate`.
el: Αυτή η στατική μέθοδος επιστρέφει έναν πίνακα μεταφράσεων που μπορεί να χρησιμοποιηθεί για το :meth:`str.translate`.

source: If there is only one argument, it must be a dictionary mapping Unicode ordinals (integers) or characters (strings of length 1) to Unicode ordinals, strings (of arbitrary lengths) or ``None``. Character keys will then be converted to ordinals.
el: Εάν υπάρχει μόνο ένα όρισμα, πρέπει να είναι ένα λεξικό αντιστοίχισης Unicode ordinals (ακέραιοι αριθμοί) ή χαρακτήρες (συμβολοσειρές - strings μήκους 1) σε ordinals Unicode, συμβολοσειρές (αυθαίρετου μήκους) ή ``None``. Τα κλειδιά χαρακτήρων τότε θα μετατραπούν σε κανονικούς αριθμούς.

source: If there are two arguments, they must be strings of equal length, and in the resulting dictionary, each character in x will be mapped to the character at the same position in y. If there is a third argument, it must be a string, whose characters will be mapped to ``None`` in the result.
el: Εάν υπάρχουν δύο ορίσματα, πρέπει να είναι συμβολοσειρές (strings) ίσου μήκους και στο λεξικό (dictionary) που θα προκύψει, κάθε χαρακτήρας στο x θα αντιστοιχιστεί στο χαρακτήρα στην ίδια θέση στο y. Αν υπάρχει τρίτο όρισμα, πρέπει να είναι συμβολοσειρά, του οποίου οι χαρακτήρες θα αντιστοιχιστούν στο αποτέλεσμα σε ``None``.

source: Split the string at the first occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself, and the part after the separator. If the separator is not found, return a 3-tuple containing the string itself, followed by two empty strings.
el: Διαχωρίστε τη συμβολοσειρά (string) στην πρώτη εμφάνιση του *sep*, και επιστρέφει ένα 3-tuple που περιέχει το μέρος πριν από το διαχωριστικό, το ίδιο το διαχωριστικό και το μέρος μετά το διαχωριστικό. Αν ο διαχωριστής δεν βρεθεί, επιστρέφει ένα 3-σύνολο που περιέχει την ίδια τη συμβολοσειρά, ακολουθούμενη από δύο κενές συμβολοσειρές.

source: If the string starts with the *prefix* string, return ``string[len(prefix):]``. Otherwise, return a copy of the original string::
el: Εάν η συμβολοσειρά (string) ξεκινά με το *prefix*, επιστρέφει ``string[len(prefix):]``. Διαφορετικά, επιστρέφει ένα αντίγραφο της αρχικής συμβολοσειράς::

source: If the string ends with the *suffix* string and that *suffix* is not empty, return ``string[:-len(suffix)]``. Otherwise, return a copy of the original string::
el: Αν η συμβολοσειρά τελειώνει με το *suffix* και το *suffix* δεν είναι κενό, επιστρέφει ``string[:-len(suffix)]``. Διαφορετικά, επιστρέφει ένα αντίγραφο της αρχικής συμβολοσειράς::

source: Return a copy of the string with all occurrences of substring *old* replaced by *new*. If *count* is given, only the first *count* occurrences are replaced. If *count* is not specified or ``-1``, then all occurrences are replaced.
el: Επιστρέφει ένα αντίγραφο της συμβολοσειράς (string) με όλες τις εμφανίσεις της υπό-συμβολοσειράς *old* αντικατεστημένες από την *new*. Εάν δοθεί η παράμετρος *count*, μόνο οι πρώτες *count* εμφανίσεις. Αν δεν έχει οριστεί ή είναι -1, τότε αντικαθίστανται όλες οι εμφανίσεις.

source: *count* is now supported as a keyword argument.
el: Το *count* υποστηρίζεται πλέον ως όρισμα λέξης-κλειδιού.

source: Return the highest index in the string where substring *sub* is found, such that *sub* is contained within ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` on failure.
el: Επιστρέφει το υψηλότερο index στη συμβολοσειρά (string) όπου βρίσκεται η υπό-συμβολοσειρά *sub*, έτσι ώστε το *sub* περιέχεται στο ``s[start:end]``. Τα προαιρετικά ορίσματα *start* και *end* ερμηνεύονται ως slice notation. Επιστρέφει ``-1`` σε περίπτωση αποτυχίας.

source: Like :meth:`rfind` but raises :exc:`ValueError` when the substring *sub* is not found.
el: Όπως η :meth:`rfind`, αλλά κάνει raise :exc:`ValueError` όταν η υπό-συμβολοσειρά (sub-string) *sub* δεν βρέθηκε.

source: Return the string right justified in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
el: Επιστρέφει τη συμβολοσειρά (string) με δεξιό προσανατολισμό σε μια συμβολοσειρά μήκους *width*. Το padding γίνεται χρησιμοποιώντας το καθορισμένο *fillchar* (η προεπιλογή είναι ένα διάστημα ASCII). Η αρχική συμβολοσειρά επιστρέφεται εάν το *width* είναι μικρότερο ή ίσο με ``len(s)``.

source: Split the string at the last occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself, and the part after the separator. If the separator is not found, return a 3-tuple containing two empty strings, followed by the string itself.
el: Διαχωρίζει τη συμβολοσειρά (string) στην τελευταία εμφάνιση του *sep* και επιστρέφει ένα 3-tuple που περιέχει το τμήμα πριν από το διαχωριστικό, το ίδιο το διαχωριστικό και το μέρος μετά το διαχωριστικό. Εάν το διαχωριστικό δεν βρεθεί, επιστρέφει ένα 3-tuple που περιέχει δύο κενές συμβολοσειρές, ακολουθούμενες από την ίδια τη συμβολοσειρά.

source: Return a list of the words in the string, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done, the *rightmost* ones. If *sep* is not specified or ``None``, any whitespace string is a separator. Except for splitting from the right, :meth:`rsplit` behaves like :meth:`split` which is described in detail below.
el: Επιστρέφει μια λίστα με τις λέξεις στη συμβολοσειρά (string), χρησιμοποιώντας το *sep* ως οριοθέτη. Εάν δοθεί το *maxsplit*, θα γίνουν το πολύ *maxsplit* διαχωρισμοί, ξεκινώντας από τα δεξιά. Εάν το *sep* δεν έχει καθοριστεί ή είναι ``None``, οποιοδήποτε κενό διάστημα γίνεται διαχωριστικό. Εκτός από το διαχωρισμό από τα δεξιά, η :meth:`rsplit` συμπεριφέρεται όπως η :meth:`split` που περιγράφεται λεπτομερώς παρακάτω.

source: Return a copy of the string with trailing characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a suffix; rather, all combinations of its values are stripped::
el: Επιστρέφει ένα αντίγραφο της συμβολοσειράς (string) με τους χαρακτήρες που έχουν αφαιρεθεί. Τα όρισμα *chars* είναι μια συμβολοσειρά που καθορίζει το σύνολο των χαρακτήρων που πρέπει να αφαιρεθούν. Εάν παραληφθεί ή είναι ``None``, το όρισμα *chars* έχει ως προεπιλογή την αφαίρεση των κενών διαστημάτων. Το όρισμα *chars* δεν είναι suffix, αλλά όλοι οι συνδυασμοί των τιμών του αφαιρούνται::

source: See :meth:`str.removesuffix` for a method that will remove a single suffix string rather than all of a set of characters. For example::
el: Δείτε τη :meth:`str.removesuffix` για μια μέθοδο που θα αφαιρέσει ένα απλό suffix αντί για όλο το σύνολο των χαρακτήρων. Για παράδειγμα::

source: Return a list of the words in the string, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done (thus, the list will have at most ``maxsplit+1`` elements). If *maxsplit* is not specified or ``-1``, then there is no limit on the number of splits (all possible splits are made).
el: Επιστρέφει μια λίστα με τις λέξεις της συμβολοσειράς (string), χρησιμοποιώντας το *sep* ως διαχωριστικό. Αν δοθεί το *maxsplit*, γίνονται το πολύ *maxsplit* διαχωρισμοί (έτσι, η λίστα θα έχει το πολύ ``maxsplit+1`` στοιχεία). Εάν το *maxsplit* δεν καθοριστεί ή είναι ``-1``, τότε δεν υπάρχει όριο στον αριθμό των διαχωρισμών (γίνονται όλες οι πιθανές διασπάσεις).

source: If *sep* is given, consecutive delimiters are not grouped together and are deemed to delimit empty strings (for example, ``'1,,2'.split(',')`` returns ``['1', '', '2']``). The *sep* argument may consist of multiple characters as a single delimiter (to split with multiple delimiters, use :func:`re.split`). Splitting an empty string with a specified separator returns ``['']``.
el: Αν δοθεί το *sep*, οι διαδοχικά οριοθέτες δεν ομαδοποιούνται μαζί και θεωρείται ότι οριοθετούν κενές συμβολοσειρές (strings) (για παράδειγμα, το ``'1,,2'.split(',')`` επιστρέφει ``['1', '', '2']``). Το όρισμα *sep* μπορεί να αποτελείται από πολλούς χαρακτήρες ως μεμονωμένο οριοθέτη (για διαχωρισμό με πολλαπλούς οριοθέτες, χρησιμοποιήστε την :func:`re.split`). Ο διαχωρισμός μιας κενής συμβολοσειράς με ένα καθορισμένο διαχωριστικό επιστρέφει το ``['']``.

source: For example::
el: Για παράδειγμα::

source: If *sep* is not specified or is ``None``, a different splitting algorithm is applied: runs of consecutive whitespace are regarded as a single separator, and the result will contain no empty strings at the start or end if the string has leading or trailing whitespace. Consequently, splitting an empty string or a string consisting of just whitespace with a ``None`` separator returns ``[]``.
el: Αν το *sep* καθοριστεί ή είναι ``None``, εφαρμόζεται ένας διαφορετικός αλγόριθμος διαχωρισμού: οι εμφανίσεις διαδοχικών κενών θεωρούνται ως ένα ενιαίο διαχωριστικό, και το αποτέλεσμα δεν θα περιέχει κενές συμβολοσειρές (strings) στην αρχή ή στο τέλος, αν η συμβολοσειρά έχει κενό διάστημα στην αρχή ή στο τέλος. Κατά συνέπεια, η διάσπαση μιας κενής συμβολοσειράς ή μιας συμβολοσειράς που αποτελείται μόνο από κενά διαστήματα με ένα ``None`` ως διαχωριστικό επιστρέφει ``[]``.

source: Return a list of the lines in the string, breaking at line boundaries. Line breaks are not included in the resulting list unless *keepends* is given and true.
el: Επιστρέφει μια λίστα με τις γραμμές της συμβολοσειράς (string), διαχωρίζοντας στα όρια των γραμμών. Τα διαχωριστικά των γραμμών δεν περιλαμβάνονται στην νέα λίστα, εκτός αν δοθεί το *keepends* και είναι true.

source: This method splits on the following line boundaries. In particular, the boundaries are a superset of :term:`universal newlines`.
el: Αυτή η μέθοδος διαχωρίζει στα ακόλουθα όρια γραμμών. Πιο συγκεκριμένα, τα όρια είναι ένα υπερσύνολο του :term:`universal newlines`.

source: Representation
el: Αναπαράσταση

source: Description
el: Περιγραφή

source: File Separator
el: Διαχωριστής Αρχείου

source: Group Separator
el: Διαχωριστής Group

source: Record Separator
el: Διαχωριστής Εγγραφών

source: Next Line (C1 Control Code)
el: Επόμενη Γραμμή (C1 Control Code)

source: Line Separator
el: Διαχωριστής Γραμμής

source: Paragraph Separator
el: Διαχωριστής Παραγράφου

source: ``\v`` and ``\f`` added to list of line boundaries.
el: Τα ``\v`` και ``\f`` προστίθενται στην λίστα ορίων των γραμμών.

source: Unlike :meth:`~str.split` when a delimiter string *sep* is given, this method returns an empty list for the empty string, and a terminal line break does not result in an extra line::
el: Σε αντίθεση με την :meth:`~str.split` όταν δίνεται μια συμβολοσειρά (string) οριοθέτησης *sep*, αυτή η μέθοδος επιστρέφει μια κενή λίστα για το κενό αλφαριθμητικό, και μια τερματικό break γραμμής δεν οδηγεί σε μια επιπλέον γραμμή::

source: For comparison, ``split('\n')`` gives::
el: Συγκριτικά, η ``split('\n')`` δίνει::

source: Return ``True`` if string starts with the *prefix*, otherwise return ``False``. *prefix* can also be a tuple of prefixes to look for. With optional *start*, test string beginning at that position. With optional *end*, stop comparing string at that position.
el: Επιστρέφει ``True`` αν η συμβολοσειρά (string) αρχίζει με το *prefix*, αλλιώς επιστρέφει ``False``. Το *prefix* μπορεί επίσης να είναι μια πλειάδα (tuple) prefix προς αναζήτηση. Με το προαιρετικό *start*, ελέγχεται το αλφαριθμητικό που αρχίζει από τη συγκεκριμένη θέση. Με το προαιρετικό *end*, σταματά η σύγκριση της συμβολοσειράς σε αυτή τη θέση.

source: Return a copy of the string with the leading and trailing characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a prefix or suffix; rather, all combinations of its values are stripped::
el: Επιστρέφει ένα αντίγραφο της συμβολοσειράς (string) με τους πρώτους και τους τελευταίους χαρακτήρες να έχουν αφαιρεθεί. Το όρισμα *chars* είναι μια συμβολοσειρά που καθορίζει το σύνολο των χαρακτήρων που πρέπει να αφαιρεθούν. Εάν παραλειφθεί ή είναι ``None``, το όρισμα *chars* έχει ως default την αφαίρεση των κενών διαστημάτων. Το όρισμα *chars* δεν είναι prefix ή suffix· μάλλον, όλοι οι συνδυασμοί των τιμών του αφαιρούνται::

source: The outermost leading and trailing *chars* argument values are stripped from the string. Characters are removed from the leading end until reaching a string character that is not contained in the set of characters in *chars*. A similar action takes place on the trailing end. For example::
el: Οι ακραίες αρχικές και τελικές τιμές του ορίσματος *chars* αφαιρούνται από τη συμβολοσειρά (string). Οι χαρακτήρες αφαιρούνται από το μπροστινό άκρο μέχρι να φτάσουν στο χαρακτήρα της συμβολοσειράς (string) που δεν περιέχεται στο σύνολο χαρακτήρων του *chars*. Μια παρόμοια ενέργεια λαμβάνει χώρα στο τέλος της ουράς. Για παράδειγμα:

source: Return a copy of the string with uppercase characters converted to lowercase and vice versa. Note that it is not necessarily true that ``s.swapcase().swapcase() == s``.
el: Επιστρέφει ένα αντίγραφο της συμβολοσειράς (string) με κεφαλαίους χαρακτήρες που έχουν μετατραπεί σε πεζούς και αντίστροφα. Σημειώστε ότι δεν είναι απαραίτητα αληθές ότι ``s.swapcase().swapcase() == s``.

source: Return a titlecased version of the string where words start with an uppercase character and the remaining characters are lowercase.
el: Επιστρέφει μια titlecased έκδοση της συμβολοσειράς, όπου οι λέξεις ξεκινούν με ένα κεφαλαίο χαρακτήρα και οι υπόλοιποι χαρακτήρες είναι πεζοί.

source: The algorithm uses a simple language-independent definition of a word as groups of consecutive letters. The definition works in many contexts but it means that apostrophes in contractions and possessives form word boundaries, which may not be the desired result::
el: Ο αλγόριθμος χρησιμοποιεί έναν απλό, ανεξάρτητο από τη γλώσσα, ορισμό μιας λέξης ως group διαδοχικών γραμμάτων. Ο ορισμός λειτουργεί σε πολλά contexts, αλλά σημαίνει ότι οι απόστροφοι σε συναιρέσεις και κτητικές λέξεις αποτελούν όρια λέξεων, που μπορεί να μην είναι το επιθυμητό αποτέλεσμα::

source: The :func:`string.capwords` function does not have this problem, as it splits words on spaces only.
el: Η συνάρτηση :func:`string.capwords` δεν έχει αυτό το πρόβλημα, καθώς χωρίζει τις λέξεις μόνο σε κενά.

source: Alternatively, a workaround for apostrophes can be constructed using regular expressions::
el: Εναλλακτικά, μπορεί να κατασκευαστεί μια λύση για τις αποστρόφους χρησιμοποιώντας κανονικές εκφράσεις::

source: Return a copy of the string in which each character has been mapped through the given translation table. The table must be an object that implements indexing via :meth:`~object.__getitem__`, typically a :term:`mapping` or :term:`sequence`. When indexed by a Unicode ordinal (an integer), the table object can do any of the following: return a Unicode ordinal or a string, to map the character to one or more other characters; return ``None``, to delete the character from the return string; or raise a :exc:`LookupError` exception, to map the character to itself.
el: Επιστρέφει ένα αντίγραφο της συμβολοσειράς (string) στο οποίο κάθε χαρακτήρας έχει αντιστοιχιστεί μέσω του πίνακα μετάφρασης. Ο πίνακας πρέπει να είναι ένα αντικείμενο που υλοποιεί ευρετηριοποίηση μέσω της :meth:`~object.__getitem__`, συνήθως ένα :term:`mapping` ή ένα :term:`sequence`. Όταν το indexing γίνεται με ένα Unicode ordinal (ένας ακέραιος), το αντικείμενο του πίνακα μπορεί να κάνει οποιοδήποτε από τα ακόλουθα: να επιστρέψει ένα Unicode ordinal ή μια συμβολοσειρά (string), να αντιστοιχίσει τον χαρακτήρα σε έναν ή περισσότερους άλλους χαρακτήρες· να επιστρέψει ``None``, για να διαγράψει τον χαρακτήρα από τη συμβολοσειρά που επιστρέφεται· ή να κάνει raise ένα :exc:`LookupError`, για να αντιστοιχίσει τον χαρακτήρα στον εαυτό του.

source: You can use :meth:`str.maketrans` to create a translation map from character-to-character mappings in different formats.
el: Μπορείτε να χρησιμοποιήσετε το :meth:`str.maketrans` για να δημιουργήσετε ένα χάρτη μετάφρασης αντιστοίχισης από χαρακτήρα-σε-χαρακτήρα σε διαφορετικές μορφές.

source: See also the :mod:`codecs` module for a more flexible approach to custom character mappings.
el: Δείτε επίσης την ενότητα :mod:`codecs` για μια πιο ευέλικτη προσέγγιση σε προσαρμοσμένα mappings χαρακτήρων.

source: Return a copy of the string with all the cased characters [4]_ converted to uppercase. Note that ``s.upper().isupper()`` might be ``False`` if ``s`` contains uncased characters or if the Unicode category of the resulting character(s) is not "Lu" (Letter, uppercase), but e.g. "Lt" (Letter, titlecase).
el: Επιστρέφει ένα αντίγραφο της συμβολοσειράς (string) με όλους τους χαρακτήρες [4]_ που έχουν μετατραπεί σε κεφαλαία. Σημειώστε ότι το ``s.upper().isupper()`` μπορεί να είναι ``False`` αν το ``s`` περιέχει χαρακτήρες χωρίς πεζά γράμματα ή αν η κατηγορία Unicode του προκύπτοντος χαρακτήρα(ων) δεν είναι "Lu" (Γράμμα, κεφαλαίο), αλλά π.χ. "Lt" (Γράμμα, titlecase).

source: The uppercasing algorithm used is `described in section 3.13 'Default Case Folding' of the Unicode Standard <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-3/#G33992>`__.
el: Ο αλγόριθμος που κάνει τα γράμματα κεφαλαία που χρησιμοποιείται `περιγράφεται στην ενότητα 3.13 'Default Case Folding' του προτύπου Unicode <https://www.unicode.org/versions/Unicode16.0.0/core-spec/chapter-3/#G33992>`__.

source: Return a copy of the string left filled with ASCII ``'0'`` digits to make a string of length *width*. A leading sign prefix (``'+'``/``'-'``) is handled by inserting the padding *after* the sign character rather than before. The original string is returned if *width* is less than or equal to ``len(s)``.
el: Επιστρέφει ένα αντίγραφο της συμβολοσειράς (string) που έμεινε γεμάτη με ψηφία ASCII ``'0'``` για να δημιουργήσει μία συμβολοσειρά μήκους *width*. Χειρίζεται ένα leading sign prefix (``'+'``/``'-'``) εισάγοντας την συμπλήρωση *μετά* τον χαρακτήρα sign αντί για πριν. Η αρχική συμβολοσειρά επιστρέφεται εάν το *width* είναι μικρότερο ή ίσο με ``len(s)``.

source: Formatted String Literals (f-strings)
el: Διαμορφωμένες Κυριολεκτικές Συμβολοσειρές (f-strings)

source: The :keyword:`await` and :keyword:`async for` can be used in expressions within f-strings.
el: Τα :keyword:`await` και :keyword:`async for` μπορούν να χρησιμοποιηθούν σε εκφράσεις μέσα σε f-strings.

source: Added the debugging operator (``=``)
el: Προστέθηκε ο τελεστής αποσφαλμάτωσης (``=``)

source: Many restrictions on expressions within f-strings have been removed. Notably, nested strings, comments, and backslashes are now permitted.
el: Πολλοί περιορισμοί στις εκφράσεις μέσα σε f-strings έχουν αφαιρεθεί. Ιδιαίτερα, πλέον επιτρέπονται οι εμφωλευμένες συμβολοσειρές, τα σχόλια και οι κάθετοι.

source: An :dfn:`f-string` (formally a :dfn:`formatted string literal`) is a string literal that is prefixed with ``f`` or ``F``. This type of string literal allows embedding arbitrary Python expressions within *replacement fields*, which are delimited by curly brackets (``{}``). These expressions are evaluated at runtime, similarly to :meth:`str.format`, and are converted into regular :class:`str` objects. For example:
el: Ένα :dfn:`f-string` (επίσημα ένα :dfn:`formatted string literal`) είναι μια κυριολεκτική συμβολοσειρά που προεξέχει με ``f`` ή ``F``. Αυτός ο τύπος κυριολεκτικής συμβολοσειράς επιτρέπει την ενσωμάτωση αυθαίρετων εκφράσεων Python μέσα σε *πεδία αντικατάστασης*, τα οποία περιβάλλονται από αγκύλες (``{}``). Αυτές οι εκφράσεις αξιολογούνται κατά την εκτέλεση, με παρόμοιο τρόπο όπως η μέθοδος :meth:`str.format`, και μετατρέπονται σε κανονικά αντικείμενα τύπου :class:`str`. Για παράδειγμα:

source: It is also possible to use a multi line f-string:
el: Είναι επίσης δυνατό να χρησιμοποιηθεί μια f-string πολλών γραμμών:

source: A single opening curly bracket, ``'{'``, marks a *replacement field* that can contain any Python expression:
el: Ένα μόνο άνοιγμα αγκύλης, ``'{'``, δηλώνει ένα *πεδίο αντικατάστασης* που μπορεί να περιέχει οποιαδήποτε έκφραση Python:

source: To include a literal ``{`` or ``}``, use a double bracket:
el: Για να συμπεριλάβετε μια κυριολεξία ``{`` ή ``}``, χρησιμοποιήστε διπλή αγκύλη:

source: Functions can also be used, and :ref:`format specifiers <formatstrings>`:
el: Μπορούν επίσης να χρησιμοποιηθούν συναρτήσεις καθώς και :ref:`format specifiers <formatstrings>`:

source: Any non-string expression is converted using :func:`str`, by default:
el: Κάθε έκφραση μη-συμβολοσειράς μετατρέπεται χρησιμοποιώντας τη :func:`str`, από προεπιλογή:

source: To use an explicit conversion, use the ``!`` (exclamation mark) operator, followed by any of the valid formats, which are:
el: Για να χρησιμοποιήσετε ρητή μετατροπή, χρησιμοποιήστε τον τελεστή ``!`` (θαυμαστικό), ακολουθούμενο από οποιεσδήποτε από τις έγκυρες μορφές, τα οποία είναι:

source: Conversion
el: Μετατροπή

source: For example:
el: Για παράδειγμα:

source: While debugging it may be helpful to see both the expression and its value, by using the equals sign (``=``) after the expression. This preserves spaces within the brackets, and can be used with a converter. By default, the debugging operator uses the :func:`repr` (``!r``) conversion. For example:
el: Κατά την αποσφαλμάτωση, μπορεί να είναι χρήσιμο να βλέπουμε τόσο την έκφραση όσο και την τιμή της, χρησιμοποιώντας το σύμβολο του ίσου (``=``) μετά την έκφραση. Αυτό διατηρεί τα κενά μέσα στις αγκύλες και μπορείς να χρησιμοποιηθεί με έναν μετατροπέα. Από προεπιλογή, ο χειριστής αποσφαλμάτωσης χρησιμοποιεί τη μετατροπή :func:`repr` (``!r``). Για παράδειγμα:
