Repository: thepetk/python-docs-gr
Catalog: library/stdtypes.po
Languages: el

source: Return a copy of the sequence with specified trailing bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a suffix; rather, all combinations of its values are stripped::
el: Επιστρέφει ένα αντίγραφο της ακολουθίας με τα καθορισμένα δευτερεύοντα byte που έχουν αφαιρεθεί. Το όρισμα *chars* είναι μια δυαδική ακολουθία που καθορίζει το σύνολο των τιμών byte που πρέπει να αφαιρεθούν - το όνομα αναφέρεται στο γεγονός ότι αυτή η μέθοδος χρησιμοποιείται συνήθως με χαρακτήρες ASCII. Εάν παραληφθεί ή είναι ``None``, το όρισμα *chars* έχει ως προεπιλογή την αφαίρεση του κενού διαστήματος ASCII. Το όρισμα *chars* δεν είναι επίθημα, αλλά αφαιρούνται όλοι οι συνδυασμοί των τιμών του::

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`. See :meth:`~bytes.removesuffix` for a method that will remove a single suffix string rather than all of a set of characters. For example::
el: Η δυαδική ακολουθία τιμών byte προς κατάργηση μπορεί να είναι οποιοδήποτε :term:`bytes-like object`. Βλέπε τη :meth:`~bytes.removesuffix` για μια μέθοδο που θα αφαιρέσει μια συμβολοσειρά επιθέματος και όχι όλο το σύνολο χαρακτήρων. Για παράδειγμα:

source: Split the binary sequence into subsequences of the same type, using *sep* as the delimiter string. If *maxsplit* is given and non-negative, at most *maxsplit* splits are done (thus, the list will have at most ``maxsplit+1`` elements). If *maxsplit* is not specified or is ``-1``, then there is no limit on the number of splits (all possible splits are made).
el: Διαχωρίζει την δυαδική ακολουθία σε υποακολουθίες του ίδιου τύπου, χρησιμοποιώντας το *sep* ως συμβολοσειρά οριοθέτησης Εάν δοθεί *maxsplit* και μη αρνητικό, γίνονται το πολύ *maxsplit* διαχωρισμοί (άρα, η λίστα θα έχε το πολύ ``maxsplit+1`` στοιχεία). Εάν το *maxsplit* δεν έχει καθοριστεί ή είναι ``-1``, τότε δεν υπάρχει όριο στον αριθμό των διαχωρισμών (όλες οι πιθανές διασπάσεις γίνονται).

source: If *sep* is given, consecutive delimiters are not grouped together and are deemed to delimit empty subsequences (for example, ``b'1,,2'.split(b',')`` returns ``[b'1', b'', b'2']``). The *sep* argument may consist of a multibyte sequence as a single delimiter. Splitting an empty sequence with a specified separator returns ``[b'']`` or ``[bytearray(b'')]`` depending on the type of object being split. The *sep* argument may be any :term:`bytes-like object`.
el: Αν δοθεί το *sep*, οι διαδοχικοί οριοθέτες δεν ομαδοποιούνται και θεωρείται ότι οριοθετούν κενές υποακολουθίες (για παράδειγμα, ``b'1,,2'.split(b',')`` επιστρέφει το ``[b'1', b'', b'2']``). Το όρισμα *sep* μπορεί να αποτελείται από μια ακολουθία πολλών byte ως μεμονωμένο οριοθέτη. Ο διαχωρισμός μιας κενής ακολουθίας με ένα καθορισμένο διαχωριστικό επιστρέφει το ``[b'']`` ή το ``[bytearray(b'')]`` ανάλογα με τον τύπο του αντικειμένου που χωρίζεται. Το όρισμα *sep* μπορεί να είναι οποιοδήποτε :term:`bytes-like object`.

source: If *sep* is not specified or is ``None``, a different splitting algorithm is applied: runs of consecutive ASCII whitespace are regarded as a single separator, and the result will contain no empty strings at the start or end if the sequence has leading or trailing whitespace. Consequently, splitting an empty sequence or a sequence consisting solely of ASCII whitespace without a specified separator returns ``[]``.
el: Εάν το *sep* δεν έχει καθοριστεί ή είναι ``None``, εφαρμόζεται ένας διαφορετικός αλγόριθμος διαχωρισμού: οι εκτελέσεις διαδοχικών κενών διαστημάτων ASCII θεωρούνται ως ένα ενιαίο διαχωριστικό, και το αποτέλεσμα δεν θα περιέχει κενές συμβολοσειρές στην αρχή ή στο τέλος, εάν η ακολουθία έχει κενό που έπεται ή προηγείται. Κατά συνέπεια, ο διαχωρισμός μιας κενής ακολουθίας ή μιας ακολουθίας που αποτελείται αποκλειστικά από κενό διάστημα ASCII χωρίς καθορισμένο διαχωριστικό επιστρέφει το ``[]``.

source: Return a copy of the sequence with specified leading and trailing bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a prefix or suffix; rather, all combinations of its values are stripped::
el: Επιστρέφει ένα αντίγραφο της ακολουθίας με τα καθορισμένα bytes που προηγούνται και τα bytes που έπονται. Το όρισμα *chars* είναι μια δυαδική ακολουθία που καθορίζει το σύνολο των τιμών byte που πρέπει να αφαιρεθούν - το όνομα αναφέρεται στο γεγονός ότι αυτή η μέθοδος χρησιμοποιείται συνήθως με χαρακτήρες ASCII. Εάν παραλείπεται ή είναι ``None``, το όρισμα *chars* από προεπιλογή αφαιρεί το ASCII λευκό διάστημα. To όρισμα *chars* δεν είναι πρόθεμα ή επίθημα, αλλά αφαιρούνται όλοι οι συνδυασμοί των τιμών του:

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`.
el: Η δυαδική ακολουθία τιμών byte προς αφαίρεση μπορεί να είναι οποιοδήποτε :term:`bytes-like object`.

source: The following methods on bytes and bytearray objects assume the use of ASCII compatible binary formats and should not be applied to arbitrary binary data. Note that all of the bytearray methods in this section do *not* operate in place, and instead produce new objects.
el: Οι ακόλουθες μέθοδοι σε byte και αντικείμενα bytearray προϋποθέτουν τη χρήση δυαδικών μορφών συμβατών με ASCII και δεν πρέπει να εφαρμόζονται σε αυθαίρετα δυαδικά δεδομένα. Σημειώστε ότι όλες οι μέθοδοι bytearray σε αυτήν την ενότητα *δεν* λειτουργούν στη θέση τους και αντ' αυτού παράγουν νέα αντικείμενα.

source: Return a copy of the sequence with each byte interpreted as an ASCII character, and the first byte capitalized and the rest lowercased. Non-ASCII byte values are passed through unchanged.
el: Επιστρέφει ένα αντίγραφο της ακολουθίας με κάθε byte να ερμηνεύεται ως ένας χαρακτήρας ASCII, και το πρώτο byte γραμμένο με κεφαλαία και το υπόλοιπο με πεζά. Οι τιμές των byte που δεν είναι ASCII μεταβιβάζονται αμετάβλητες.

source: Return a copy of the sequence where all ASCII tab characters are replaced by one or more ASCII spaces, depending on the current column and the given tab size. Tab positions occur every *tabsize* bytes (default is 8, giving tab positions at columns 0, 8, 16 and so on). To expand the sequence, the current column is set to zero and the sequence is examined byte by byte. If the byte is an ASCII tab character (``b'\t'``), one or more space characters are inserted in the result until the current column is equal to the next tab position. (The tab character itself is not copied.) If the current byte is an ASCII newline (``b'\n'``) or carriage return (``b'\r'``), it is copied and the current column is reset to zero. Any other byte value is copied unchanged and the current column is incremented by one regardless of how the byte value is represented when printed::
el: Επιστρέφει ένα αντίγραφο της ακολουθίας όπου όλοι οι tab χαρακτήρες ASCII αντικαθίστανται από ένα ή περισσότερα κενά ASCII, ανάλογα με την τρέχουσα στήλη και το δεδομένο μέγεθος tab. Οι θέσεις των tab εμφανίζονται κάθε *tabsize* bytes (η προεπιλογή είναι 8, δίνοντας θέσεις καρτελών στις στήλες 0, 8, 16 και ούτω καθεξής). Για την επέκταση της ακολουθίας, η τρέχουσα στήλη ορίζεται στο μηδέν και η ακολουθία εξετάζεται byte προς byte. Εάν το byte είναι tab χαρακτήρας ASCII (``b'\t'``), ένας ή περισσότεροι χαρακτήρες διαστήματος εισάγονται στο αποτέλεσμα έως ότου η τρέχουσα στήλη ισούται με την επόμενη θέση tab. (Ο ίδιος tab χαρακτήρας δεν αντιγράφεται.) Εάν το τρέχον byte είναι μια νέα γραμμή ASCII (``b'\n'``), αντιγράφεται και η τρέχουσα στήλη επαναφέρεται στο μηδέν. Οποιαδήποτε άλλη τιμή byte αντιγράφεται αμετάβλητη και η τρέχουσα στήλη προσαυξάνεται κατά ένα, ανεξάρτητα από το πώς αναπαρίσταται η τιμή byte όταν εκτυπώνεται::

source: Return ``True`` if all bytes in the sequence are alphabetical ASCII characters or ASCII decimal digits and the sequence is not empty, ``False`` otherwise. Alphabetic ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``. ASCII decimal digits are those byte values in the sequence ``b'0123456789'``.
el: Επιστρέφει ``True`` εάν όλα τα byte της ακολουθίας είναι αλφαβητικοί χαρακτήρες ASCII ή ASCII δεκαδικά ψηφία και η ακολουθία δεν είναι κενή, ``False`` διαφορετικά. Οι αλφαβητικοί χαρακτήρες ASCII είναι εκείνες οι τιμές byte στην ακολουθία ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``. Τα δεκαδικά ψηφία ASCII είναι αυτές οι τιμές byte στην ακολουθία ``b'0123456789'``.

source: Return ``True`` if all bytes in the sequence are alphabetic ASCII characters and the sequence is not empty, ``False`` otherwise. Alphabetic ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``.
el: Επιστρέφει ``True`` εάν όλα τα bytes της ακολουθίας είναι αλφαβητικοί χαρακτήρες ASCII και η ακολουθία δεν είναι κενή, ``False`` διαφορετικά. Οι αλφαβητικοί χαρακτήρες ASCII είναι εκείνες οι τιμές bytes στην ακολουθία ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``.

source: Return ``True`` if the sequence is empty or all bytes in the sequence are ASCII, ``False`` otherwise. ASCII bytes are in the range 0-0x7F.
el: Επιστρέφει ``True`` εάν η ακολουθία είναι κενή ή όλα τα byte της ακολουθίας είναι ASCII, ``False`` διαφορετικά. Τα bytes ASCII βρίσκονται στο εύρος 0-0x7F.

source: Return ``True`` if all bytes in the sequence are ASCII decimal digits and the sequence is not empty, ``False`` otherwise. ASCII decimal digits are those byte values in the sequence ``b'0123456789'``.
el: Επιστρέφει ``True`` εάν όλα τα bytes στην ακολουθία είναι δεκαδικά ψηφία ASCII και η ακολουθία δεν είναι κενή, ``False`` διαφορετικά. Τα δεκαδικά ψηφία ASCII είναι αυτές οι τιμές byte στην ακολουθία ``b'0123456789'``.

source: Return ``True`` if there is at least one lowercase ASCII character in the sequence and no uppercase ASCII characters, ``False`` otherwise.
el: Επιστρέφει ``True`` εάν υπάρχει τουλάχιστον ένας πεζός χαρακτήρας ASCII στην ακολουθία και κανένας κεφαλαίος χαρακτήρας ASCII, ``False`` διαφορετικά.

source: Lowercase ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyz'``. Uppercase ASCII characters are those byte values in the sequence ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``.
el: Οι πεζοί χαρακτήρες ASCII είναι αυτές οι τιμές byte στην ακολουθία ``b'abcdefghijklmnopqrstuvwxyz'``. Οι κεφαλαίοι χαρακτήρες ASCII είναι αυτές οι τιμές byte στην ακολουθία ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``.

source: Return ``True`` if all bytes in the sequence are ASCII whitespace and the sequence is not empty, ``False`` otherwise. ASCII whitespace characters are those byte values in the sequence ``b' \t\n\r\x0b\f'`` (space, tab, newline, carriage return, vertical tab, form feed).
el: Επιστρέφει ``True`` εάν όλα τα byte στην ακολουθία είναι κενά ASCII και η ακολουθία δεν είναι κενή, ``False`` διαφορετικά. Οι χαρακτήρες κενού διαστήματος ASCII είναι αυτές οι τιμές byte στην ακολουθία ``b' \t\n\r\x0b\f'`` (κενό, tab, νέα γραμμή, επιστροφή μεταφοράς, κάθετο tab, μορφή ροής).

source: Return ``True`` if the sequence is ASCII titlecase and the sequence is not empty, ``False`` otherwise. See :meth:`bytes.title` for more details on the definition of "titlecase".
el: Επιστρέφει ``True`` εάν η ακολουθία είναι ASCII κεφαλαία τίτλου (δηλαδή τα πρώτα γράμματα των λέξεων κεφαλαία) και η ακολουθία δεν είναι κενή, ``False`` διαφορετικά. Δείτε :meth:`bytes.title` για περισσότερες λεπτομέρειες σχετικά με τον ορισμό του "titlecase".

source: Return ``True`` if there is at least one uppercase alphabetic ASCII character in the sequence and no lowercase ASCII characters, ``False`` otherwise.
el: Επιστρέφει ``True`` εάν υπάρχει τουλάχιστον ένας κεφαλαίος αλφαβητικός χαρακτήρας ASCII στην ακολουθία και κανένας πεζός χαρακτήρας ASCII, διαφορετικά ``False``.

source: Return a copy of the sequence with all the uppercase ASCII characters converted to their corresponding lowercase counterpart.
el: Επιστρέφει ένα αντίγραφο της ακολουθίας με όλους τους κεφαλαίους χαρακτήρες ASCII να έχουν μετατραπεί στα ισοδύναμα πεζά.

source: Return a list of the lines in the binary sequence, breaking at ASCII line boundaries. This method uses the :term:`universal newlines` approach to splitting lines. Line breaks are not included in the resulting list unless *keepends* is given and true.
el: Επιστρέφει μια λίστα με τις γραμμές στη δυαδική ακολουθία, σπάζοντας τα όρια γραμμής του ASCII. Αυτή η μέθοδος χρησιμοποιεί την προσέγγιση :term:`universal newlines` για τον διαχωρισμό των γραμμών. Οι αλλαγές γραμμής δεν περιλαμβάνονται στη λίστα που προκύπτει εκτός εάν δοθεί *keepends* και είναι αληθής.

source: Unlike :meth:`~bytes.split` when a delimiter string *sep* is given, this method returns an empty list for the empty string, and a terminal line break does not result in an extra line::
el: Σε αντίθεση με το :meth:`~bytes.split` όταν δίνεται μια οριοθετημένη συμβολοσειρά *sep*, αυτή η μέθοδος επιστρέφει μια κενή λίστα για την κενή συμβολοσειρά και μια αλλαγή γραμμής τερματικού δεν οδηγεί σε μια επιπλέον γραμμή::

source: Return a copy of the sequence with all the lowercase ASCII characters converted to their corresponding uppercase counterpart and vice-versa.
el: Επιστρέφει ένα αντίγραφο της ακολουθίας με όλους τους πεζούς χαρακτήρες ASCII να έχουν μετατραπεί στο αντίστοιχο ισοδύναμο κεφαλαίο και αντίστροφα.

source: Unlike :func:`str.swapcase`, it is always the case that ``bin.swapcase().swapcase() == bin`` for the binary versions. Case conversions are symmetrical in ASCII, even though that is not generally true for arbitrary Unicode code points.
el: Σε αντίθεση με το :func:`str.swapcase`, συμβαίνει πάντα ότι ``bin.swapcase().swapcase() == bin`` για τις δυαδικές εκδόσεις. Οι μετατροπές κεφαλαίων είναι συμμετρικές στο ASCII, παρόλο που αυτό δεν ισχύει γενικά για αυθαίρετα σημεία Unicode κώδικα.

source: Return a titlecased version of the binary sequence where words start with an uppercase ASCII character and the remaining characters are lowercase. Uncased byte values are left unmodified.
el: Επιστρέφει μια έκδοση με κεφαλαία τίτλου (δηλαδή τα πρώτα γράμματα των λέξεων κεφαλαία) της δυαδικής ακολουθίας όπου οι λέξεις ξεκινούν με κεφαλαίο χαρακτήρα ASCII και οι υπόλοιποι χαρακτήρες είναι πεζοί. Οι τιμές byte χωρίς κεφαλαία γράμματα παραμένουν χωρίς τροποποίηση.

source: Lowercase ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyz'``. Uppercase ASCII characters are those byte values in the sequence ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``. All other byte values are uncased.
el: Οι πεζοί χαρακτήρες ASCII είναι εκείνες οι τιμές byte στην ακολουθία ``b'abcdefghijklmnopqrstuvwxyz'``. Οι κεφαλαίο χαρακτήρες ASCII είναι εκείνες οι τιμές byte στην ακολουθία ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``. Όλες οι άλλες τιμές byte είναι χωρίς κεφαλαία.

source: A workaround for apostrophes can be constructed using regular expressions::
el: Μια λύση για αποστρόφους μπορεί να δημιουργηθεί χρησιμοποιώντας κανονικές εκφράσεις::

source: Return a copy of the sequence with all the lowercase ASCII characters converted to their corresponding uppercase counterpart.
el: Επιστρέφει ένα αντίγραφο της ακολουθίας με όλους τους πεζούς χαρακτήρες ASCII να έχουν μετατραπεί στο αντίστοιχο ισοδύναμο κεφαλαίο.

source: Return a copy of the sequence left filled with ASCII ``b'0'`` digits to make a sequence of length *width*. A leading sign prefix (``b'+'``/ ``b'-'``) is handled by inserting the padding *after* the sign character rather than before. For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(seq)``.
el: Επιστρέφει ένα αντίγραφο της ακολουθίας που έχει απομείνει γεμάτο με ψηφία ASCII ``b'0'`` για να δημιουργήσετε μια ακολουθία μήκους *width*. Ένα πρόθεμα προπορευόμενου σήματος (``b'+'``/ ``b'-'``) αντιμετωπίζεται με την εισαγωγή της συμπλήρωσης του *after* χαρακτήρα προσήμου και όχι πριν. Για αντικείμενα :class:`bytes`, η αρχική ακολουθία επιστρέφεται εάν το *width* είναι μικρότερο ή ίσο με ``len(seq)``.

source: ``printf``-style Bytes Formatting
el: Μορφοποίηση Bytes τύπου ``printf``

source: The formatting operations described here exhibit a variety of quirks that lead to a number of common errors (such as failing to display tuples and dictionaries correctly). If the value being printed may be a tuple or dictionary, wrap it in a tuple.
el: Οι λειτουργίες μορφοποίησης που περιγράφονται εδώ παρουσιάζουν μια ποικιλία ιδιορρυθμιών που οδηγούν σε μια σειρά από κοινά σφάλματα (όπως η αποτυχία εμφάνισης των πλειάδων και των λεξικών σωστά). Εάν η τιμή που εκτυπώνεται μπορεί να είναι πλειάδα ή λεξικό, κάντε το wrap σε μια πλειάδα.

source: Bytes objects (``bytes``/``bytearray``) have one unique built-in operation: the ``%`` operator (modulo). This is also known as the bytes *formatting* or *interpolation* operator. Given ``format % values`` (where *format* is a bytes object), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. The effect is similar to using the :c:func:`sprintf` in the C language.
el: Τα αντικείμενα bytes (``bytes``/``bytearray``) έχουν μια μοναδική ενσωματωμένη λειτουργία: τον τελεστή ``%`` (modulo). Αυτό είναι επίσης γνωστό ως τελεστής bytes *formatting* ή *interpolation*. Δεδομένων των ``format % values`` (όπου το *format* είναι αντικείμενο bytes), οι προδιαγραφές μετατροπής ``%`` σε *format* αντικαθιστά με μηδέν ή περισσότερα στοιχεία *values*. Το αποτέλεσμα είναι παρόμοιο με τη χρήση του :c:func:`sprintf` στη γλώσσας C.

source: If *format* requires a single argument, *values* may be a single non-tuple object. [5]_ Otherwise, *values* must be a tuple with exactly the number of items specified by the format bytes object, or a single mapping object (for example, a dictionary).
el: Εάν το *format* απαιτεί ένα μεμονωμένο όρισμα, το *values* μπορεί να είναι ένα μεμονωμένο μη πολλαπλό αντικείμενο. [5]_ Διαφορετικά, το *values* πρέπει να είναι πλειάδα με ακριβώς τον αριθμό των στοιχείων που καθορίζονται από το αντικείμενο μορφής bytes ή μεμονωμένο mapping αντικείμενο (για παράδειγμα, ένα λεξικό).

source: When the right argument is a dictionary (or other mapping type), then the formats in the bytes object *must* include a parenthesised mapping key into that dictionary inserted immediately after the ``'%'`` character. The mapping key selects the value to be formatted from the mapping. For example:
el: Όταν το σωστό όρισμα είναι ένα λεξικό (ή άλλος τύπος αντιστοίχισης), τότε οι μορφές στο αντικείμενο bytes *πρέπει* να περιλαμβάνουν ένα κλειδί αντιστοίχισης σε παρένθεση σε αυτό το λεξικό που έχει εισαχθεί αμέσως μετά τον χαρακτήρα ``'%'``. Το κλειδί αντιστοίχισης επιλέγει την τιμή που θα μορφοποιηθεί από την αντιστοίχιση. Για παράδειγμα:

source: Single byte (accepts integer or single byte objects).
el: Μονό byte (δέχεται ακέραια ή μεμονωμένα byte αντικείμενα).

source: Bytes (any object that follows the :ref:`buffer protocol <bufferobjects>` or has :meth:`~object.__bytes__`).
el: Bytes (κάθε αντικείμενο που ακολουθεί το :ref:`buffer protocol <bufferobjects>` ή έχει :meth:`~object.__bytes__`).

source: ``'s'`` is an alias for ``'b'`` and should only be used for Python2/3 code bases.
el: Το ``'s'`` είναι ένα ψευδώνυμο για το ``'b'`` και θα πρέπει να χρησιμοποιείται μόνο για κώδικα βάσει Python2/3.

source: Bytes (converts any Python object using ``repr(obj).encode('ascii', 'backslashreplace')``).
el: Bytes (μετατρέπει οποιοδήποτε αντικείμενο Python χρησιμοποιώντας ``repr(obj).encode('ascii', 'backslashreplace')``).

source: ``'r'`` is an alias for ``'a'`` and should only be used for Python2/3 code bases.
el: Το ``'r'`` είναι ένα ψευδώνυμο για ``'a'`` και θα πρέπει να χρησιμοποιείται μόνο για βάσεις κώδικα Python2/3.

source: ``b'%s'`` is deprecated, but will not be removed during the 3.x series.
el: Το ``b'%s'`` έχει καταργηθεί, αλλά δεν θα αφαιρεθεί κατά τη διάρκεια της σειράς 3.x.

source: ``b'%r'`` is deprecated, but will not be removed during the 3.x series.
el: Το ``b'%r'`` έχει καταργηθεί, αλλά δεν θα αφαιρεθεί κατά τη διάρκεια της σειράς 3.x.

source: :pep:`461` - Adding % formatting to bytes and bytearray
el: :pep:`461` - Προσθήκη % για μορφοποίηση σε bytes και bytearray

source: Memory Views
el: Όψεις Μνήμης

source: :class:`memoryview` objects allow Python code to access the internal data of an object that supports the :ref:`buffer protocol <bufferobjects>` without copying.
el: Τα αντικείμενα :class:`memoryview` επιτρέπουν στον κώδικα Python να έχει πρόσβαση στα εσωτερικά δεδομένα ενός αντικειμένου που υποστηρίζει το πρωτόκολλο :ref:`buffer protocol <bufferobjects>` χωρίς αντιγραφή.

source: Create a :class:`memoryview` that references *object*. *object* must support the buffer protocol. Built-in objects that support the buffer protocol include :class:`bytes` and :class:`bytearray`.
el: Δημιουργεί μια :class:`memoryview` που αναφέρεται στο *object*. Το *object* πρέπει να υποστηρίζει το πρωτόκολλο buffer. Τα ενσωματωμένα αντικείμενα που υποστηρίζουν το πρωτόκολλο buffer περιλαμβάνουν :class:`bytes` και :class:`bytearray`.

source: A :class:`memoryview` has the notion of an *element*, which is the atomic memory unit handled by the originating *object*. For many simple types such as :class:`bytes` and :class:`bytearray`, an element is a single byte, but other types such as :class:`array.array` may have bigger elements.
el: Μια :class:`memoryview` έχει την έννοια ενός *στοιχείου*, το οποίο είναι η μονάδα ατομικής μνήμης που χειρίζεται το αρχικό *object*. Για πολλούς απλούς τύπους όπως :class:`bytes` και :class:`bytearray`, ένα στοιχείο είναι ένα μεμονωμένο byte, αλλά άλλοι τύποι όπως :class:`array.array` μπορεί να έχουν μεγαλύτερα στοιχεία.

source: ``len(view)`` is equal to the length of :class:`~memoryview.tolist`, which is the nested list representation of the view. If ``view.ndim = 1``, this is equal to the number of elements in the view.
el: Το ``len(view)`` ισούται με το μήκος του :class:`~memoryview.tolist`, το οποίο είναι η ένθετη αναπαράσταση κατά την προβολή της λίστας. Εάν ``view.ndim = 1``, αυτό ισούται με τον αριθμό των στοιχείων για την προβολή.

source: If ``view.ndim == 0``, ``len(view)`` now raises :exc:`TypeError` instead of returning 1.
el: Εάν ``view.ndim == 0``, το ``len(view)`` τώρα κάνει raise μια :exc:`TypeError` αντί να επιστρέψει 1.

source: The :class:`~memoryview.itemsize` attribute will give you the number of bytes in a single element.
el: Το χαρακτηριστικό :class:`~memoryview.itemsize` θα σας δώσει τον αριθμό των byte σε ένα μόνο στοιχείο.

source: A :class:`memoryview` supports slicing and indexing to expose its data. One-dimensional slicing will result in a subview::
el: Μια :class:`memoryview` υποστηρίζει λειτουργίες τμηματοποίησης και πρόσβαση μέσω ευρετηρίου στα δεδομένα του. Μια μονοδιάστατη τμηματοποίηση θα έχει ως αποτέλεσμα μια δευτερεύουσα προβολή::
