Repository: thepetk/python-docs-gr
Catalog: library/stdtypes.po
Languages: el

source: The *byteorder* argument determines the byte order used to represent the integer, and defaults to ``"big"``. If *byteorder* is ``"big"``, the most significant byte is at the beginning of the byte array. If *byteorder* is ``"little"``, the most significant byte is at the end of the byte array.
el: Το όρισμα *byteorder* καθορίζει τη σειρά των byte που χρησιμοποιούνται για την αναπαράσταση του ακέραιου αριθμού, και έχουν προεπιλεγμένη τιμή (default) ``"big"``. Εάν το *byteorder* είναι ``"big"``, το πιο σημαντικό byte βρίσκεται στην αρχή του πίνακα των bytes. Εάν το *byteorder* είναι ``"little"``, το πιο σημαντικό byte βρίσκεται στο τέλος του πίνακα των bytes.

source: The *signed* argument determines whether two's complement is used to represent the integer. If *signed* is ``False`` and a negative integer is given, an :exc:`OverflowError` is raised. The default value for *signed* is ``False``.
el: Το όρισμα *signed* καθορίζει εάν το συμπλήρωμα ως προς δύο χρησιμοποιείται για να αντιπροσωπεύσει τον ακέραιο. Εάν το *signed* είναι ``False`` και έχει δοθεί ένας αρνητικός ακέραιος, γίνεται raise ένα :exc:`OverflowError`. Η προεπιλεγμένη τιμή (default) για το *signed* είναι ``False``.

source: The default values can be used to conveniently turn an integer into a single byte object::
el: Οι προεπιλεγμένες τιμές (defaults) μπορούν να χρησιμοποιηθούν για να μετατρέψουν βολικά έναν ακέραιο σε ένα μόνο byte αντικείμενο::

source: However, when using the default arguments, don't try to convert a value greater than 255 or you'll get an :exc:`OverflowError`.
el: Ωστόσο, όταν χρησιμοποιείτε προεπιλεγμένα ορίσματα, μην προσπαθήσετε να μετατρέψετε μια τιμή μεγαλύτερη από 255 ή διαφορετικά θα λάβετε ένα :exc:`OverflowError`.

source: Added default argument values for ``length`` and ``byteorder``.
el: Προστιθέμενες προεπιλεγμένες τιμές (defaults) ορίσματος για ``length`` και ``byteorder``.

source: Return the integer represented by the given array of bytes.
el: Επιστρέφει έναν ακέραιο που αναπαρίσταται από τον δοσμένο πίνακα των bytes.

source: The argument *bytes* must either be a :term:`bytes-like object` or an iterable producing bytes.
el: Το όρισμα *bytes* πρέπει είτε να είναι ένα :term:`bytes-like object` είτε ένα iterable που παράγει bytes.

source: The *byteorder* argument determines the byte order used to represent the integer, and defaults to ``"big"``. If *byteorder* is ``"big"``, the most significant byte is at the beginning of the byte array. If *byteorder* is ``"little"``, the most significant byte is at the end of the byte array. To request the native byte order of the host system, use :data:`sys.byteorder` as the byte order value.
el: Το όρισμα *byteorder* καθορίζει τη σειρά byte που χρησιμοποιείται για την αναπαράσταση του ακέραιου αριθμού, και η προεπιλεγμένη τιμή (default) είναι ``"big"``. Εάν το *byteorder* είναι ``"big"``, το το πιο σημαντικό byte βρίσκεται στην αρχή του πίνακα των bytes. Εάν το *byteorder* είναι ``"little"``, το πιο σημαντικό byte βρίσκεται στο τέλος του πίνακα των bytes. Για να ζητήσετε την εγγενή σειρά των bytes του host συστήματος, χρησιμοποιήστε το :data:`sys.byteorder` ως τιμή της σειράς byte.

source: The *signed* argument indicates whether two's complement is used to represent the integer.
el: Το όρισμα *signed* υποδεικνύει εάν το συμπλήρωμα ως προς δύο χρησιμοποιείται για να αντιπροσωπεύσει τον ακέραιο.

source: Added default argument value for ``byteorder``.
el: Προστιθέμενη προεπιλεγμένη τιμή (default) ορίσματος για το ``byteorder``.

source: Return a pair of integers whose ratio is equal to the original integer and has a positive denominator. The integer ratio of integers (whole numbers) is always the integer as the numerator and ``1`` as the denominator.
el: Επιστρέφει ένα ζεύγος ακεραίων των οποίων η αναλογία είναι ίση με τον αρχικό ακέραιο και έχει θετικό παρονομαστή. Ο ακέραιος λόγος ακεραίων (ολόκληρων αριθμών) είναι πάντα ο ακέραιος αριθμός ως αριθμητής και το ``1`` ως παρονομαστής.

source: Returns ``True``. Exists for duck type compatibility with :meth:`float.is_integer`.
el: Επιστρέφει ``True``. Υπάρχει για συμβατότητα τύπου duck με :meth:`float.is_integer`.

source: Additional Methods on Float
el: Περαιτέρω Μέθοδοι για Float

source: The float type implements the :class:`numbers.Real` :term:`abstract base class`. float also has the following additional methods.
el: Ο τύπος float (κινητής υποδιαστολής) υλοποιεί την :class:`numbers.Real` :term:`abstract base class`. Ο float έχει επίσης τις ακόλουθες πρόσθετες μεθόδους.

source: Class method to return a floating-point number constructed from a number *x*.
el: Μέθοδος κλάσης για την επιστροφή ενός αριθμού κινητής υποδιαστολής που κατασκευάζεται από έναν αριθμό *x*.

source: If the argument is an integer or a floating-point number, a floating-point number with the same value (within Python's floating-point precision) is returned. If the argument is outside the range of a Python float, an :exc:`OverflowError` will be raised.
el: Εάν το όρισμα είναι ακέραιος ή αριθμός κινητής υποδιαστολής, επιστρέφεται ένας αριθμός κινητής υποδιαστολής με την ίδια τιμή (εντός της ακρίβειας κινητής υποδιαστολής της Python). Εάν το όρισμα βρίσκεται εκτός του εύρους ενός Python float, θα κάνει raise μια :exc:`OverflowError`.

source: For a general Python object ``x``, ``float.from_number(x)`` delegates to ``x.__float__()``. If :meth:`~object.__float__` is not defined then it falls back to :meth:`~object.__index__`.
el: Για ένα γενικό αντικείμενο Python ``x``, ``float.from_number(x)`` ανατίθεται στο ``x.__float__()``. Εάν η :meth:`~object.__float__` δεν έχει οριστεί, τότε επιστρέφει στη :meth:`~object.__index__`.

source: Return a pair of integers whose ratio is exactly equal to the original float. The ratio is in lowest terms and has a positive denominator. Raises :exc:`OverflowError` on infinities and a :exc:`ValueError` on NaNs.
el: Επιστρέφει ένα ζεύγος ακεραίων των οποίων η αναλογία είναι ακριβώς ίση με το αρχικό float. Ο λόγος είναι στο χαμηλότερο επίπεδο και έχει θετικό παρονομαστή. Κάνει raise :exc:`OverflowError` στα άπειρα και ένα :exc:`ValueError` για NaNs.

source: Return ``True`` if the float instance is finite with integral value, and ``False`` otherwise::
el: Επιστρέφει ``True`` εάν το float instance είναι πεπερασμένο με ακέραια τιμή και ``False`` διαφορετικά::

source: Two methods support conversion to and from hexadecimal strings. Since Python's floats are stored internally as binary numbers, converting a float to or from a *decimal* string usually involves a small rounding error. In contrast, hexadecimal strings allow exact representation and specification of floating-point numbers. This can be useful when debugging, and in numerical work.
el: Δύο μέθοδοι υποστηρίζουν τη μετατροπή από και προς δεκαεξαδικές συμβολοσειρές (strings). Αφού τα floats της Python αποθηκεύονται εσωτερικά ως δυαδικοί αριθμοί, η μετατροπή ενός float προς ή από μια *δεκαδική* συμβολοσειρά συνήθως περιλαμβάνει ένα μικρό σφάλμα στρογγυλοποίησης. Αντιθέτως, οι δεκαεξαδικές συμβολοσειρές επιτρέπουν ακριβή αναπαράσταση και συγκεκριμενοποίηση των αριθμών κινητής υποδιαστολής. Αυτό μπορεί να είναι χρήσιμο κατά το debugging και στην αριθμητική.

source: Return a representation of a floating-point number as a hexadecimal string. For finite floating-point numbers, this representation will always include a leading ``0x`` and a trailing ``p`` and exponent.
el: Επιστρέφει μια αναπαράσταση ενός αριθμού κινητής υποδιαστολής ως δεκαεξαδική συμβολοσειρά (string). Για πεπερασμένους αριθμούς κινητής υποδιαστολής, αυτή η αναπαράσταση θα περιλαμβάνει πάντα ένα προπορευόμενο ``0x`` και ένα τελευταίο ``p`` και εκθέτη.

source: Class method to return the float represented by a hexadecimal string *s*. The string *s* may have leading and trailing whitespace.
el: Μέθοδος κλάσης για την επιστροφή του float που αντιπροσωπεύεται από μια δεκαεξαδική συμβολοσειρά (string) *s*. Η συμβολοσειρά *s* μπορεί να έχει κενό διάστημα που στην αρχή ή το τέλος.

source: Note that :meth:`float.hex` is an instance method, while :meth:`float.fromhex` is a class method.
el: Σημειώστε ότι το :meth:`float.hex` είναι ένα instance method, ενώ το :meth:`float.fromhex` είναι μια μέθοδος κλάσης.

source: A hexadecimal string takes the form::
el: Μια δεκαεξαδική συμβολοσειρά (string) έχει τη μορφή::

source: where the optional ``sign`` may by either ``+`` or ``-``, ``integer`` and ``fraction`` are strings of hexadecimal digits, and ``exponent`` is a decimal integer with an optional leading sign. Case is not significant, and there must be at least one hexadecimal digit in either the integer or the fraction. This syntax is similar to the syntax specified in section 6.4.4.2 of the C99 standard, and also to the syntax used in Java 1.5 onwards. In particular, the output of :meth:`float.hex` is usable as a hexadecimal floating-point literal in C or Java code, and hexadecimal strings produced by C's ``%a`` format character or Java's ``Double.toHexString`` are accepted by :meth:`float.fromhex`.
el: όπου το προαιρετικό ``sign`` μπορεί να είναι είτε ``+`` ή ``-``, ``integer`` και ``fraction`` είναι συμβολοσειρές (strings) δεκαεξαδικών ψηφίων και ο ``exponent`` (εκθέτης) είναι ένας δεκαδικός ακέραιος με προαιρετικό πρόσημο. Τα πεζά ή κεφαλαία δεν είναι σημαντικά και πρέπει να υπάρχει τουλάχιστον ένα δεκαεξαδικό ψηφίο είτε στον ακέραιο είτε στο κλάσμα. Αυτή η σύνταξη είναι παρόμοια με τη σύνταξη που καθορίζεται στην ενότητα 6.4.4.2 του προτύπου C99, καθώς και στη σύνταξη που χρησιμοποιείται στην Java 1.5 και μετά. Ιδιαίτερα, η έξοδος του :meth:`float.hex` μπορεί να χρησιμοποιηθεί ως δεκαεξαδικό Κυριολεκτική κινητής υποδιαστολής σε κώδικα C ή Java, και παράχθηκαν δεκαεξαδικές συμβολοσειρές με τον χαρακτήρα μορφής ``%a`` της C ή το `Double.toHexString` της Java είναι αποδεκτά από το :meth:`float.fromhex`.

source: Note that the exponent is written in decimal rather than hexadecimal, and that it gives the power of 2 by which to multiply the coefficient. For example, the hexadecimal string ``0x3.a7p10`` represents the floating-point number ``(3 + 10./16 + 7./16**2) * 2.0**10``, or ``3740.0``::
el: Σημειώστε ότι ο εκθέτης είναι γραμμένος με δεκαδικό και όχι δεκαεξαδικό και ότι δίνει τη δύναμη του 2 με την οποία πολλαπλασιάζεται ο συντελεστής. Για παράδειγμα, η δεκαεξαδική συμβολοσειρά (string) ``0x3.a7p10`` αντιπροσωπεύει τον αριθμό κινητής υποδιαστολής ``(3 + 10./16 + 7./16**2) * 2,0**10``, ή ``3740,0``::

source: Applying the reverse conversion to ``3740.0`` gives a different hexadecimal string representing the same number::
el: Η εφαρμογή της αντίστροφης μετατροπής σε ``3740.0`` δίνει μία διαφορετική δεκαεξαδική συμβολοσειρά (string) που αντιπροσωπεύει τον ίδιο αριθμό::

source: Additional Methods on Complex
el: Περαιτέρω Μέθοδοι για Μιγαδικούς

source: The :class:`!complex` type implements the :class:`numbers.Complex` :term:`abstract base class`. :class:`!complex` also has the following additional methods.
el: Ο τύπος :class:`!complex` υλοποιεί την :class:`numbers.Complex` :term:`abstract base class`. Η :class:`!complex` έχει επίσης τις ακόλουθες πρόσθετε μεθόδους.

source: Class method to convert a number to a complex number.
el: Μέθοδος κλάσης για τη μετατροπή ενός αριθμούς σε ένα μιγαδικό αριθμός.

source: For a general Python object ``x``, ``complex.from_number(x)`` delegates to ``x.__complex__()``. If :meth:`~object.__complex__` is not defined then it falls back to :meth:`~object.__float__`. If :meth:`!__float__` is not defined then it falls back to :meth:`~object.__index__`.
el: Για ένα γενικό αντικείμενο Python ``x``, ``complex.from_number(x)`` ανατίθεται στο ``x.__complex__()``. Εάν η :meth:`~object.__complex__` δεν έχει οριστεί, τότε επιστρέφει :meth:`~object.__float__`. Εάν η :meth:`!__float__` δεν έχει οριστεί, τότε επιστρέφει στη :meth:`~object.__index__`.

source: Hashing of numeric types
el: Κατακερματισμός των αριθμητικών τύπων

source: For numbers ``x`` and ``y``, possibly of different types, it's a requirement that ``hash(x) == hash(y)`` whenever ``x == y`` (see the :meth:`~object.__hash__` method documentation for more details). For ease of implementation and efficiency across a variety of numeric types (including :class:`int`, :class:`float`, :class:`decimal.Decimal` and :class:`fractions.Fraction`) Python's hash for numeric types is based on a single mathematical function that's defined for any rational number, and hence applies to all instances of :class:`int` and :class:`fractions.Fraction`, and all finite instances of :class:`float` and :class:`decimal.Decimal`. Essentially, this function is given by reduction modulo ``P`` for a fixed prime ``P``. The value of ``P`` is made available to Python as the :attr:`~sys.hash_info.modulus` attribute of :data:`sys.hash_info`.
el: Για αριθμούς ``x`` και ``y``, πιθανώς διαφορετικών τύπων, είναι προαπαιτούμενο ότι ``hash(x) == hash(y)`` όποτε ``x == y`` (δείτε την τεκμηρίωση για την μέθοδο :meth:`~object.__hash__` για περισσότερες λεπτομέρειες). Για την ευκολότερη εφαρμογή και αποτελεσματικότητα σε ένα εύρος αριθμητικών τύπων (συμπεριλαμβανομένων των :class:`int`, :class:`float`, :class:`decimal.Decimal` και :class:`fractions.Fracion`) o κατακερματισμός της Python για αριθμητικούς τύπους βασίζεται σε μία μόνο μαθηματική συνάρτηση που ορίζεται για οποιονδήποτε ρητό αριθμό, και ως εκ τούτου ισχύει για όλα τα instances :class:`int` και :class:`fractions.Fraction` και όλα πεπερασμένα instances :class:`float` και :class:`decimal.Decimal`. Ουσιαστικά, αυτή η συνάρτηση δίνεται από το modulo μείωσης ``P`` για ένα σταθερό πρώτο ``P``. Η τιμή του ``P`` διατίθεται στην Python ως χαρακτηριστικό :attr:`~sys.hash_info.modulus` του :data:`sys.hash_info`.

source: Currently, the prime used is ``P = 2**31 - 1`` on machines with 32-bit C longs and ``P = 2**61 - 1`` on machines with 64-bit C longs.
el: Αυτή τη στιγμή, ο πρώτος που χρησιμοποιείται είναι ``P = 2**31 - 1`` σε μηχανήματα με μήκους 32-bit C και ``P = 2**61 - 1`` σε μηχανήματα με μήκους 64-bit C.

source: Here are the rules in detail:
el: Εδώ οι κανόνες λεπτομερώς:

source: If ``x = m / n`` is a nonnegative rational number and ``n`` is not divisible by ``P``, define ``hash(x)`` as ``m * invmod(n, P) % P``, where ``invmod(n, P)`` gives the inverse of ``n`` modulo ``P``.
el: Αν το ``x = m / n`` είναι ένας μη αρνητικός ρητός αριθμός και το ``n`` δεν διαιρείται από ``P``, ορίστε το ``hash(x)`` ως ``m * invmod(n, P) % P``, όπου το ``invmod(n, P)`` μας δίνει το αντίστροφο του modulo ``n`` ``P``.

source: If ``x = m / n`` is a nonnegative rational number and ``n`` is divisible by ``P`` (but ``m`` is not) then ``n`` has no inverse modulo ``P`` and the rule above doesn't apply; in this case define ``hash(x)`` to be the constant value ``sys.hash_info.inf``.
el: Αν το ``x = m / n`` είναι ένας μη αρνητικός ρητός αριθμός και το ``n`` διαιρείται με το ``P`` (αλλά το ``m`` όχι) τότε το ``n`` δεν έχει αντίστροφο modulo ``P`` και ο κανόνας παραπάνω δεν ισχύει. Σε αυτήν την περίπτωση ορίστε το ``hash(x)`` ως σταθερή τιμή ``sys.hash_info.inf``.

source: If ``x = m / n`` is a negative rational number define ``hash(x)`` as ``-hash(-x)``. If the resulting hash is ``-1``, replace it with ``-2``.
el: Αν ``x = m / n`` είναι ένας αρνητικός ρητός αριθμός τότε το ``hash(x)`` ορίζεται ως ``-hash(-x)``. Αν το hash που προκύπτει είναι ``-1``, αντικαθίσταται με ``-2``.

source: The particular values ``sys.hash_info.inf`` and ``-sys.hash_info.inf`` are used as hash values for positive infinity or negative infinity (respectively).
el: Οι συγκεκριμένες τιμές των ``sys.hash_info.inf`` και ``-sys.hash_info.inf`` χρησιμοποιούνται ως τιμές κατακερματισμού για το θετικό άπειρο ή το αρνητικό άπειρο (αντίστοιχα).

source: For a :class:`complex` number ``z``, the hash values of the real and imaginary parts are combined by computing ``hash(z.real) + sys.hash_info.imag * hash(z.imag)``, reduced modulo ``2**sys.hash_info.width`` so that it lies in ``range(-2**(sys.hash_info.width - 1), 2**(sys.hash_info.width - 1))``. Again, if the result is ``-1``, it's replaced with ``-2``.
el: Για έναν :class:`complex` αριθμό ``z``, οι τιμές κατακερματισμού των πραγματικών και φανταστικών μερών συνδυάζονται με τον υπολογισμό ``hash(z.real) + sys.hash_info.imag * hash(z.imag)``, μειωμένο modulo ``2**sys.hash_info.width`` έτσι ώστε να βρίσκεται στο ``range(-2**(sys.hash_info.width - 1), 2**(sys.hash_info.width - 1))``. Και πάλι, αν το αποτέλεσμα είναι ``-1``, αντικαθίσταται με ``-2``.

source: To clarify the above rules, here's some example Python code, equivalent to the built-in hash, for computing the hash of a rational number, :class:`float`, or :class:`complex`::
el: Για να αποσαφηνίσουμε τους παραπάνω κανόνες, εδώ είναι ένα παράδειγμα κώδικα της Python, ισοδύναμο με το built-in hash, για τον υπολογισμό του hash ενός ρητού αριθμού, :class:`float`, ή :class:`complex`::

source: Boolean Type - :class:`bool`
el: Τύπος Boolean - :class`bool`

source: Booleans represent truth values. The :class:`bool` type has exactly two constant instances: ``True`` and ``False``.
el: Οι λογικές τιμές (Booleans) αντιπροσωπεύουν τιμές αλήθειας. Ο τύπος :class:`bool` έχει ακριβώς δύο σταθερές τιμές: ``True`` και ``False``.

source: The built-in function :func:`bool` converts any value to a boolean, if the value can be interpreted as a truth value (see section :ref:`truth` above).
el: Η ενσωματωμένη συνάρτηση :func:`bool` μετατρέπει οποιαδήποτε τιμή σε λογική (boolean), αν η τιμή μπορεί να ερμηνευτεί ως τιμή αλήθειας (βλέπε παραπάνω ενότητα :ref:`truth`).

source: For logical operations, use the :ref:`boolean operators <boolean>` ``and``, ``or`` and ``not``. When applying the bitwise operators ``&``, ``|``, ``^`` to two booleans, they return a bool equivalent to the logical operations "and", "or", "xor". However, the logical operators ``and``, ``or`` and ``!=`` should be preferred over ``&``, ``|`` and ``^``.
el: Για λογικές πράξεις, χρησιμοποιήστε τους τελεστές :ref:`boolean <boolean>` ``and``, ``or`` και ``not``. Κατά την εφαρμογή των bitwise τελεστών ``&``, ``|``, ``^`` σε δύο booleans, επιστρέφουν ένα bool ισοδύναμο με τις λογικές πράξεις "and", "or", "xor". Ωστόσο, οι λογικοί τελεστές ``and``, ``or`` και ``!=`` θα πρέπει να προτιμώνται έναντι των ``&``, ``|`` και ``^``.

source: The use of the bitwise inversion operator ``~`` is deprecated and will raise an error in Python 3.16.
el: Η χρήση του bitwise inversion τελεστή ``~`` είναι ξεπερασμένη και κάνει raise ένα σφάλμα στην Python 3.16.

source: :class:`bool` is a subclass of :class:`int` (see :ref:`typesnumeric`). In many numeric contexts, ``False`` and ``True`` behave like the integers 0 and 1, respectively. However, relying on this is discouraged; explicitly convert using :func:`int` instead.
el: Η :class:`bool` είναι υποκλάση της :class:`int` (βλέπε :ref:`typesnumeric`). Σε πολλά αριθμητικά περιβάλλοντα, τα ``False`` και ``True`` συμπεριφέρονται όπως οι ακέραιοι αριθμοί 0 και 1, αντίστοιχα. Ωστόσο, δεν συνιστάται να βασίζεστε σε αυτό· πιο αναλυτικά κάντε μετατροπή χρησιμοποιώντας τη :func:`int` αντ' αυτού.

source: Iterator Types
el: Τύποι Iterator

source: Python supports a concept of iteration over containers. This is implemented using two distinct methods; these are used to allow user-defined classes to support iteration. Sequences, described below in more detail, always support the iteration methods.
el: Η Python υποστηρίζει την έννοια της επανάληψης σε containers. Αυτό υλοποιείται χρησιμοποιώντας δύο διαφορετικές μεθόδους· αυτές χρησιμοποιούνται για να επιτρέψουν σε κλάσεις που ορίζονται από το χρήστη να να υποστηρίζουν την επανάληψη. Οι ακολουθίες (sequences), που περιγράφονται παρακάτω με περισσότερες λεπτομέρειες, πάντα υποστηρίζουν τις μεθόδους επανάληψης.

source: One method needs to be defined for container objects to provide :term:`iterable` support:
el: Μια μέθοδος πρέπει να οριστεί για τα container αντικείμενα ώστε να παρέχει :term:`iterable` υποστήριξη:

source: Return an :term:`iterator` object. The object is required to support the iterator protocol described below. If a container supports different types of iteration, additional methods can be provided to specifically request iterators for those iteration types. (An example of an object supporting multiple forms of iteration would be a tree structure which supports both breadth-first and depth-first traversal.) This method corresponds to the :c:member:`~PyTypeObject.tp_iter` slot of the type structure for Python objects in the Python/C API.
el: Επιστρέφει ένα αντικείμενο :term:`iterator`. Το αντικείμενο απαιτείται να υποστηρίζει το πρωτόκολλο επαναλήψεων που περιγράφεται παρακάτω. Εάν ένας container υποστηρίζει διαφορετικούς τύπους της επανάληψης, μπορούν να παρασχεθούν πρόσθετες μέθοδοι για να ζητηθούν συγκεκριμένοι iterators για αυτούς τους τύπους επανάληψης. (Ένα παράδειγμα αντικειμένου που υποστηρίζει πολλαπλές μορφές επανάληψης θα ήταν μια δενδρική δομή που υποστηρίζει και αμφότερες τις breadth-first και depth-first μορφές). Αυτή η μέθοδος αντιστοιχεί στη μέθοδο :c:member:`~PyTypeObject.tp_iter` της δομής τύπου για αντικείμενα Python στο API της Python/C.

source: The iterator objects themselves are required to support the following two methods, which together form the :dfn:`iterator protocol`:
el: Τα ίδια τα αντικείμενα επαναλήψεων απαιτείται να υποστηρίζουν τις ακόλουθες δύο μεθόδους, οι οποίες από κοινού αποτελούν το :dfn:`iterator protocol`:

source: Return the :term:`iterator` object itself. This is required to allow both containers and iterators to be used with the :keyword:`for` and :keyword:`in` statements. This method corresponds to the :c:member:`~PyTypeObject.tp_iter` slot of the type structure for Python objects in the Python/C API.
el: Επιστρέφει το ίδιο το αντικείμενο :term:`iterator`. Αυτό απαιτείται ώστε να επιτραπεί η χρησιμοποίηση τόσο των containers, όσο και των iterators με τα statements :keyword:`for` και :keyword:`in`. Αυτή η μέθοδος αντιστοιχεί στη δομή :c:member:`~PyTypeObject.tp_iter` των αντικειμένων της Python στο Python/C API.

source: Return the next item from the :term:`iterator`. If there are no further items, raise the :exc:`StopIteration` exception. This method corresponds to the :c:member:`~PyTypeObject.tp_iternext` slot of the type structure for Python objects in the Python/C API.
el: Επιστρέφει το επόμενο στοιχείο από τον :term:`iterator`. Εάν δεν υπάρχουν άλλα στοιχεία, κάνει raise την εξαίρεση :exc:`StopIteration`. Αυτή η μέθοδος αντιστοιχεί στην δομή :c:member:`~PyTypeObject.tp_iternext` των αντικειμένων της Python στο API της Python/C.

source: Python defines several iterator objects to support iteration over general and specific sequence types, dictionaries, and other more specialized forms. The specific types are not important beyond their implementation of the iterator protocol.
el: Η Python ορίζει διάφορα αντικείμενα iterator για την υποστήριξη της επανάληψης πάνω σε γενικούς και συγκεκριμένους τύπους ακολουθιών (sequences), λεξικά (dictionaries) και άλλες πιο εξειδικευμένες μορφές. Οι συγκεκριμένοι τύποι δεν είναι σημαντικοί πέρα από την υλοποίησή του iterator πρωτοκόλλου.

source: Once an iterator's :meth:`~iterator.__next__` method raises :exc:`StopIteration`, it must continue to do so on subsequent calls. Implementations that do not obey this property are deemed broken.
el: Μόλις η μέθοδος :meth:`~iterator.__next__` ενός iterator κάνει raise ένα :exc:`StopIteration`, πρέπει να συνεχίσει να το κάνει σε επόμενες κλήσεις. Υλοποιήσεις που δεν υπακούν σε αυτή την ιδιότητα θεωρούνται εσφαλμένες.

source: Generator Types
el: Τύποι Generator
