Repository: thepetk/python-docs-gr
Catalog: library/stdtypes.po
Languages: el

source: Once the output has been evaluated, it can be formatted using a :ref:`format specifier <formatstrings>` following a colon (``':'``). After the expression has been evaluated, and possibly converted to a string, the :meth:`!__format__` method of the result is called with the format specifier, or the empty string if no format specifier is given. The formatted result is then used as the final value for the replacement field. For example:
el: Μόλις η έξοδος έχει αξιολογηθεί, μπορεί να μορφοποιηθεί χρησιμοποιώντας ένα :ref:`format specifier <formatstrings>` που ακολουθείται από άνω και κάτω τελεία (``':'``). Αφού η έκφραση έχει αξιολογηθεί και, πιθανώς μετατραπεί σε συμβολοσειρά, καλείται η μέθοδος :meth:`!__format__` του αποτελέσματος με τον καθοριστή μορφοποίησης, ή η κενή συμβολοσειρά αν δεν έχει δοθεί καθοριστής μορφοποίησης. Το μορφοποιημένο αποτέλεσμα χρησιμοποιείται στη συνέχεια ως η τελική τιμή για το πεδίο αντικατάστασης. Για παράδειγμα:

source: The formatting operations described here exhibit a variety of quirks that lead to a number of common errors (such as failing to display tuples and dictionaries correctly). Using the newer :ref:`formatted string literals <f-strings>`, the :meth:`str.format` interface, or :ref:`template strings <template-strings>` may help avoid these errors. Each of these alternatives provides their own trade-offs and benefits of simplicity, flexibility, and/or extensibility.
el: Οι λειτουργίες μορφοποίησης που περιγράφονται εδώ παρουσιάζουν μια ποικιλία ιδιορρυθμιών που οδηγούν σε έναν αριθμό κοινών σφαλμάτων (όπως η αποτυχία εμφάνισης tuple και σωστών λεξικών). Χρησιμοποιώντας τα νεότερα :ref:`formatted string literals <f-strings>`, το :meth:`str.format` interface ή το :ref:`template strings <template-strings>` μπορεί να βοηθήσει στην αποφυγή αυτών των σφαλμάτων. Κάθε μία από αυτές τις εναλλακτικές παρέχει τους δικούς τις συμβιβασμούς και τα οφέλη της απλότητας, ευελιξίας και/ή επεκτασιμότητας.

source: String objects have one unique built-in operation: the ``%`` operator (modulo). This is also known as the string *formatting* or *interpolation* operator. Given ``format % values`` (where *format* is a string), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. The effect is similar to using the :c:func:`sprintf` function in the C language. For example:
el: Τα αντικείμενα string έχουν μια μοναδική ενσωματωμένη λειτουργία: τον τελεστή ``%`` (modulo). Αυτός είναι επίσης γνωστός ως τελεστής *formatting* ή * interpolation*. Δεδομένων των ``format % values`` (όπου *format* είναι μία συμβολοσειρά), ``%`` οι προδιαγραφές μετατροπής στο *format* αντικαθίστανται από μηδέν ή περισσότερα στοιχεία των *values*. Το αποτέλεσμα είναι παρόμοιο με τη χρήση του :c:func:`sprintf` στη γλώσσα C. Για παράδειγμα:

source: If *format* requires a single argument, *values* may be a single non-tuple object. [5]_ Otherwise, *values* must be a tuple with exactly the number of items specified by the format string, or a single mapping object (for example, a dictionary).
el: Εάν το *format* απαιτεί ένα μεμονωμένο όρισμα, το *values* μπορεί να είναι ένα μεμονωμένο non-tuple αντικείμενο. [5]_ Διαφορετικά, τα *values* πρέπει να είναι ένα tuple με ακριβώς τον ίδιο αριθμό των στοιχείων που καθορίζονται από το format string ή ένα μεμονωμένο αντικείμενο αντιστοίχισης (για παράδειγμα, ένα λεξικό).

source: A conversion specifier contains two or more characters and has the following components, which must occur in this order:
el: Ένας προσδιοριστής μετατροπής περιέχει δύο ή περισσότερους χαρακτήρες και έχει τους εξής components, οι οποίοι πρέπει να εμφανίζονται με αυτή τη σειρά:

source: The ``'%'`` character, which marks the start of the specifier.
el: Ο χαρακτήρας ```%''``, που σηματοδοτεί την αρχή του προσδιοριστή.

source: Mapping key (optional), consisting of a parenthesised sequence of characters (for example, ``(somename)``).
el: Κλειδί mapping (προαιρετικό), που αποτελείται από μια ακολουθία χαρακτήρων σε παρένθεση (για παράδειγμα, ``(somename)``).

source: Conversion flags (optional), which affect the result of some conversion types.
el: Δείκτες μετατροπής (προαιρετικό), που επηρεάζουν το αποτέλεσμα κάποιων τύπων μετατροπής.

source: Minimum field width (optional). If specified as an ``'*'`` (asterisk), the actual width is read from the next element of the tuple in *values*, and the object to convert comes after the minimum field width and optional precision.
el: Ελάχιστο πλάτος πεδίου (προαιρετικό). Εάν ορίζεται ως ``'*'`` (αστερίσκος), το πραγματικό πλάτος διαβάζεται από το επόμενο στοιχείο του tuple στα *values*, και το αντικείμενο προς μετατροπή έρχεται μετά από το ελάχιστο πλάτος πεδίου και το προαιρετικό precision.

source: Precision (optional), given as a ``'.'`` (dot) followed by the precision. If specified as ``'*'`` (an asterisk), the actual precision is read from the next element of the tuple in *values*, and the value to convert comes after the precision.
el: Ακρίβεια (προαιρετικό), δίνεται ως ``'.'`` (τελεία) ακολουθούμενη από το precision.Εάν ορίζεται ως ``'*'`` (αστερίσκος), το πραγματικό precision διαβάζεται από το επόμενο στοιχείο του tuple στα *values*, και η τιμή προς μετατροπή έρχεται μετά το precision.

source: Length modifier (optional).
el: Μετατροπέας του length (προαιρετικό).

source: Conversion type.
el: Τύπος conversion.

source: When the right argument is a dictionary (or other mapping type), then the formats in the string *must* include a parenthesised mapping key into that dictionary inserted immediately after the ``'%'`` character. The mapping key selects the value to be formatted from the mapping. For example:
el: Όταν το σωστό όρισμα είναι ένα λεξικό (ή άλλος τύπος αντιστοίχισης), τότε οι μορφές στη συμβολοσειρά *πρέπει* να περιλαμβάνουν ένα κλειδί αντιστοίχισης σε παρένθεση σε αυτό το λεξικό που εισήχθη αμέσως μετά τον χαρακτήρα ``'%'``. Το κλειδί αντιστοίχισης επιλέγει την τιμή που θα μορφοποιηθεί από την αντιστοίχιση. Για παράδειγμα:

source: In this case no ``*`` specifiers may occur in a format (since they require a sequential parameter list).
el: Σε αυτήν την περίπτωση δεν μπορεί να υπάρχουν προσδιοριστές ``*`` σε μια μορφή (καθώς απαιτούν μια διαδοχική λίστα παραμέτρων).

source: The conversion flag characters are:
el: Οι δείκτες μετατροπής είναι:

source: The value conversion will use the "alternate form" (where defined below).
el: Οι μετατροπή τιμής θα χρησιμοποιήσει την "εναλλακτική φόρμα" (όπου ορίζεται παρακάτω).

source: The conversion will be zero padded for numeric values.
el: Η μετατροπή θα έχει μηδενική συμπλήρωση για αριθμητικές τιμές.

source: The converted value is left adjusted (overrides the ``'0'`` conversion if both are given).
el: Η τιμή μετατροπής αφήνεται προσαρμοσμένη (παρακάμπτει τη μετατροπή ``'0'`` εάν δίνονται και τα δύο).

source: (a space) A blank should be left before a positive number (or empty string) produced by a signed conversion.
el: (ένα κενό) Πρέπει να προστεθεί ένα κενό πριν από έναν θετικό αριθμό (ή κενή συμβολοσειρά) που παράγεται από μια υπογεγραμμένη μετατροπή.

source: A sign character (``'+'`` or ``'-'``) will precede the conversion (overrides a "space" flag).
el: Ένα χαρακτήρας προσήμου (``'+'`` ή ``'-'``) θα προηγείται της μετατροπής (παρακάμπτει ένα "κενό" δείκτη).

source: A length modifier (``h``, ``l``, or ``L``) may be present, but is ignored as it is not necessary for Python -- so e.g. ``%ld`` is identical to ``%d``.
el: Ένας τροποποιητής μήκους (``h``, ``l``, or ``L``) μπορεί να υπάρχει, αλλά αγνοείται καθώς δεν είναι απαραίτητος για την Python -- οπότε π.χ. ``%ld`` είναι πανομοιότυπο σε ``%d``.

source: The conversion types are:
el: Οι τύποι μετατροπής είναι:

source: Signed integer decimal.
el: Υπογεγραμμένος δεκαδικός ακέραιος.

source: Signed octal value.
el: Υπογεγραμμένη οκταδική τιμή.

source: Obsolete type -- it is identical to ``'d'``.
el: Απαρχαιωμένος τύπος -- είναι πανομοιότυπος με το ``'d'``.

source: Signed hexadecimal (lowercase).
el: Υπογεγραμμένο δεκαεξαδικό (πεζά).

source: Signed hexadecimal (uppercase).
el: Υπογεγραμμένο δεκαεξαδικό (κεφαλαίο).

source: Floating-point exponential format (lowercase).
el: Εκθετική μορφή κινητής υποδιαστολής (πεζά)

source: Floating-point exponential format (uppercase).
el: Εκθετική μορφή κινητής υποδιαστολής (κεφαλαία)

source: Floating-point decimal format.
el: Δεκαδική μορφή κινητής υποδιαστολής.

source: Floating-point format. Uses lowercase exponential format if exponent is less than -4 or not less than precision, decimal format otherwise.
el: Μορφή κινητής υποδιαστολής. Χρησιμοποιεί εκθετική μορφή πεζών αν ο εκθέτης είναι μικρότερος από -4 ή όχι μικρότερος από την ακρίβεια, διαφορετικά χρησιμοποιεί δεκαδική μορφή.

source: Floating-point format. Uses uppercase exponential format if exponent is less than -4 or not less than precision, decimal format otherwise.
el: Μορφή κινητής υποδιαστολής. Χρησιμοποιεί εκθετική μορφή κεφαλαίων εάν ο εκθέτης είναι μικρότερος από -4 ή όχι μικρότερος από την ακρίβεια, διαφορετικά χρησιμοποιεί δεκαδική μορφή.

source: Single character (accepts integer or single character string).
el: Μεμονωμένος χαρακτήρας (δέχεται ακέραιο ή μονό χαρακτήρα συμβολοσειράς).

source: String (converts any Python object using :func:`repr`).
el: Συμβολοσειρά (μετατρέπει οποιοδήποτε αντικείμενο Python χρησιμοποιώντας :func:`repr`).

source: String (converts any Python object using :func:`str`).
el: Συμβολοσειρά (μετατρέπει οποιοδήποτε αντικείμενο Python χρησιμοποιώντας :func:`str`).

source: String (converts any Python object using :func:`ascii`).
el: Συμβολοσειρά (μετατρέπει οποιοδήποτε αντικείμενο Python χρησιμοποιώντας :func:`ascii`).

source: No argument is converted, results in a ``'%'`` character in the result.
el: Κανένα όρισμα δεν μετατρέπεται, έχει ως αποτέλεσμα έναν χαρακτήρα ``'%'`` το αποτέλεσμα.

source: The alternate form causes a leading octal specifier (``'0o'``) to be inserted before the first digit.
el: Η εναλλακτική μορφή προκαλεί την εισαγωγή ενός πρώτου οκταδικού προσδιοριστή (``'0o'``) πριν από το πρώτο ψηφίο.

source: The alternate form causes a leading ``'0x'`` or ``'0X'`` (depending on whether the ``'x'`` or ``'X'`` format was used) to be inserted before the first digit.
el: Η εναλλακτική φόρμα προκαλεί την εισαγωγή ενός αρχικού ``'0x'`` ή ``'0X'`` (ανάλογα με το εάν χρησιμοποιήθηκε η μορφή ``'x'`` ή ``'X'``) πριν το πρώτο ψηφίο.

source: The alternate form causes the result to always contain a decimal point, even if no digits follow it.
el: Η εναλλακτική μορφή κάνει το αποτέλεσμα να περιέχει πάντα μια υποδιαστολή, ακόμα κι αν δεν ακολουθούν ψηφία.

source: The precision determines the number of digits after the decimal point and defaults to 6.
el: Η ακρίβεια καθορίζει τον αριθμό των ψηφίων μετά την υποδιαστολή και ορίζεται από προεπιλογή ως 6.

source: The alternate form causes the result to always contain a decimal point, and trailing zeroes are not removed as they would otherwise be.
el: Η εναλλακτική μορφή κάνει το αποτέλεσμα να περιέχει πάντα μια υποδιαστολή και τα μηδενικά στο τέλος δεν αφαιρούνται όπως θα ήταν διαφορετικά.

source: The precision determines the number of significant digits before and after the decimal point and defaults to 6.
el: Η ακρίβεια καθορίζει τον αριθμό των σημαντικών ψηφίων πριν και μετά την υποδιαστολή και ορίζει το 6.

source: If precision is ``N``, the output is truncated to ``N`` characters.
el: Εάν η ακρίβεια είναι``N``, η έξοδος περικόπτεται σε ``N`` χαρακτήρες.

source: See :pep:`237`.
el: Βλέπε :pep:`237`.

source: Since Python strings have an explicit length, ``%s`` conversions do not assume that ``'\0'`` is the end of the string.
el: Δεδομένου ότι οι συμβολοσειρές Python έχουν ρητό μήκος, οι ``%s`` μετατροπές δεν υποθέτουν ότι το ``'\0'`` είναι το τέλος της συμβολοσειράς.

source: ``%f`` conversions for numbers whose absolute value is over 1e50 are no longer replaced by ``%g`` conversions.
el: Οι μετατροπείς ``%f`` για αριθμούς των οποίων η απόλυτη τιμή είναι μεγαλύτερη από 1e50 δεν αντικαθίστανται πλέον από μετατροπές ``%g``.

source: Binary Sequence Types --- :class:`bytes`, :class:`bytearray`, :class:`memoryview`
el: Τύποι δυαδικής ακολουθίας --- :class:`bytes`, :class:`bytearray`, :class:`memoryview`

source: The core built-in types for manipulating binary data are :class:`bytes` and :class:`bytearray`. They are supported by :class:`memoryview` which uses the :ref:`buffer protocol <bufferobjects>` to access the memory of other binary objects without needing to make a copy.
el: Οι βασικοί ενσωματωμένοι (built-in) τύποι για τον χειρισμό δυαδικών δεδομένων είναι :class:`bytes` και :class:`bytearray`. Υποστηρίζονται από τη :class:`memoryview` που χρησιμοποιεί το πρωτόκολλο :ref:`buffer protocol <bufferobjects>` για την πρόσβαση στη μνήμη άλλων δυαδικών αντικειμένων χωρίς να χρειάζεται η δημιουργία αντιγράφου.

source: The :mod:`array` module supports efficient storage of basic data types like 32-bit integers and IEEE754 double-precision floating values.
el: Το module :mod:`array` υποστηρίζει αποδοτική αποθήκευση για βασικούς τύπους δεδομένων όπως 32-bit ακέραιους και IEEE754 διπλής ακρίβειας κινητής υποδιαστολής τιμές.

source: Bytes Objects
el: Αντικείμενα Bytes

source: Bytes objects are immutable sequences of single bytes. Since many major binary protocols are based on the ASCII text encoding, bytes objects offer several methods that are only valid when working with ASCII compatible data and are closely related to string objects in a variety of other ways.
el: Τα αντικείμενα bytes είναι αμετάβλητες ακολουθίες μεμονωμένων bytes. Δεδομένου ότι πολλά κύρια δυαδικά πρωτόκολλα βασίζονται στην κωδικοποίηση κειμένου ASCII, τα αντικείμενα bytes προσφέρουν διάφορες μεθόδους που ισχύουν μόνο όταν εργάζονται με δεδομένα συμβατά με ASCII και σχετίζονται στενά με αντικείμενα συμβολοσειρών σε μια ποικιλία διαφόρων τρόπων.

source: Firstly, the syntax for bytes literals is largely the same as that for string literals, except that a ``b`` prefix is added:
el: Πρώτον, η σύνταξη για τα bytes literals είναι σε μεγάλο βαθμό η ίδια με αυτή για τα literals συμβολοσειρών, με τη διαφορά ότι προστίθεται ένα πρόθεμα ``b``::

source: Single quotes: ``b'still allows embedded "double" quotes'``
el: Μονά εισαγωγικά: ``b'ακόμα επιτρέπει ενσωματωμένα "διπλά" εισαγωγικά'``

source: Double quotes: ``b"still allows embedded 'single' quotes"``
el: Διπλά εισαγωγικά: ``b"εξακολουθεί να επιτρέπει ενσωματωμένα 'μονά' εισαγωγικά"``

source: Triple quoted: ``b'''3 single quotes'''``, ``b"""3 double quotes"""``
el: Τριπλά εισαγωγικά: ``b'''3 μονά εισαγωγικά'''``, ``b"""3 διπλά εισαγωγικά"""``

source: Only ASCII characters are permitted in bytes literals (regardless of the declared source code encoding). Any binary values over 127 must be entered into bytes literals using the appropriate escape sequence.
el: Επιτρέπονται μόνο χαρακτήρες ASCII σε bytes literals (ανεξάρτητα από τη δηλωμένη κωδικοποίηση του πηγαίου κώδικα). Τυχόν δυαδικές τιμές, πάνω από 127, πρέπει να εισαχθούν σε bytes literals χρησιμοποιώντας την κατάλληλη ακολουθία διαφυγής χαρακτήρων.

source: As with string literals, bytes literals may also use a ``r`` prefix to disable processing of escape sequences. See :ref:`strings` for more about the various forms of bytes literal, including supported escape sequences.
el: Όπως και με τα literals συμβολοσειρών, τα bytes literals μπορούν επίσης να χρησιμοποιήσουν ένα πρόθεμα ``r`` για να απενεργοποιήσουν την επεξεργασία των ακολουθιών διαφυγής χαρακτήρων. Βλέπε :ref:`strings` για περισσότερες πληροφορίες σχετικά με τις διάφορες μορφές bytes literal, συμπεριλαμβανομένων των υποστηριζόμενων ακολουθιών διαφυγής χαρακτήρων.

source: While bytes literals and representations are based on ASCII text, bytes objects actually behave like immutable sequences of integers, with each value in the sequence restricted such that ``0 <= x < 256`` (attempts to violate this restriction will trigger :exc:`ValueError`). This is done deliberately to emphasise that while many binary formats include ASCII based elements and can be usefully manipulated with some text-oriented algorithms, this is not generally the case for arbitrary binary data (blindly applying text processing algorithms to binary data formats that are not ASCII compatible will usually lead to data corruption).
el: Ενώ τα bytes literals και οι αναπαραστάσεις βασίζονται σε κείμενο ASCII, τα αντικείμενα bytes συμπεριφέρονται στην πραγματικότητα σαν αμετάβλητες ακολουθίες ακεραίων με κάθε τιμή στην ακολουθία περιορισμένη έτσι ώστε ``0 <= x < 256`` (προσπάθειες παραβίασης αυτού του περιορισμού θα κάνουν raise την :exc:`ValueError`). Αυτό γίνεται σκόπιμα για να τονιστεί ότι, ενώ πολλές δυαδικές μορφές περιλαμβάνουν στοιχεία που βασίζονται σε ASCII και μπορούν να χρησιμοποιηθούν χρήσιμα με ορισμένους αλγορίθμους προσανατολισμένους στο κείμενο, αυτό δεν ισχύει γενικά για αυθαίρετα δυαδικά δεδομένα (τυφλή εφαρμογή αλγορίθμων επεξεργασίας κειμένου σε δυαδικές μορφές δεδομένων που δεν είναι συμβατές με ASCII συνήθως οδηγεί σε καταστροφή δεδομένων).

source: In addition to the literal forms, bytes objects can be created in a number of other ways:
el: Εκτός από τις literal μορφές, τα αντικείμενα bytes μπορούν να δημιουργηθούν με πολλούς άλλους τρόπους:

source: A zero-filled bytes object of a specified length: ``bytes(10)``
el: Ένα μηδενικό αντικείμενο bytes με καθορισμένο μήκος: ``bytes(10)``

source: From an iterable of integers: ``bytes(range(20))``
el: Από ένα iterable ακεραίων αριθμών: ``bytes(range(20))``

source: Copying existing binary data via the buffer protocol: ``bytes(obj)``
el: Αντιγραφή υπαρχόντων δυαδικών δεδομένων μέσω του πρωτοκόλλου buffer: ``bytes(obj)``

source: Also see the :ref:`bytes <func-bytes>` built-in.
el: Δείτε επίσης το ενσωματωμένο :ref:`bytes <func-bytes>`.

source: Since 2 hexadecimal digits correspond precisely to a single byte, hexadecimal numbers are a commonly used format for describing binary data. Accordingly, the bytes type has an additional class method to read data in that format:
el: Δεδομένου ότι 2 δεκαεξαδικά ψηφία αντιστοιχούν ακριβώς σε ένα μόνο byte, οι δεκαεξαδικοί αριθμοί είναι μια συνήθως χρησιμοποιούμενη μορφή για την περιγραφή δυαδικών δεδομένων. Συνεπώς, ο τύπος bytes έχει μια πρόσθετη μέθοδο κλάσης για την ανάγνωση δεδομένων σε αυτήν την μορφή:

source: This :class:`bytes` class method returns a bytes object, decoding the given string object. The string must contain two hexadecimal digits per byte, with ASCII whitespace being ignored.
el: Αυτή η μέθοδος κλάσης :class:`bytes` επιστρέφει ένα αντικείμενο bytes, αποκωδικοποιώντας το δεδομένο αντικείμενο συμβολοσειράς. Η συμβολοσειρά πρέπει να περιέχει δύο δεκαεξαδικά ψηφία ανά byte, με το κενό διάστημα ASCII να αγνοείται.

source: :meth:`bytes.fromhex` now skips all ASCII whitespace in the string, not just spaces.
el: Το :meth:`bytes.fromhex` παρακάμπτει πλέον όλα τα κενά ASCII στη συμβολοσειρά, όχι μόνο τα κενά.

source: :meth:`bytes.fromhex` now accepts ASCII :class:`bytes` and :term:`bytes-like objects <bytes-like object>` as input.
el: Η :meth:`bytes.fromhex` δέχεται πλέον ASCII :class:`bytes` και :term:`bytes-like objects <bytes-like object>` ως είσοδο.

source: A reverse conversion function exists to transform a bytes object into its hexadecimal representation.
el: Υπάρχει μια συνάρτηση αντίστροφης μετατροπής για τη μετατροπή ενός αντικειμένου bytes στην δεκαεξαδική του αναπαράσταση.

source: Return a string object containing two hexadecimal digits for each byte in the instance.
el: Επιστρέφετε ένα αντικείμενο συμβολοσειράς που περιέχει δύο δεκαεξαδικά ψηφία για κάθε byte στο στιγμιότυπο.

source: If you want to make the hex string easier to read, you can specify a single character separator *sep* parameter to include in the output. By default, this separator will be included between each byte. A second optional *bytes_per_sep* parameter controls the spacing. Positive values calculate the separator position from the right, negative values from the left.
el: Εάν θέλετε να κάνετε τη δεκαεξαδική συμβολοσειρά πιο ευανάγνωστη, μπορείτε να καθορίσετε μια παράμετρο διαχωρισμού χαρακτήρων *sep* που θα συμπεριληφθεί στην έξοδο. Από προεπιλογή, αυτό το διαχωριστικό θα περιλαμβάνεται μεταξύ κάθε byte. Μια δεύτερη προαιρετική παράμετρος *bytes_per_sep* ελέγχει τα διαστήματα. Οι θετικές τιμές υπολογίζουν τη θέση του διαχωριστή από τα δεξιά, οι αρνητικές τιμές από τα αριστερά.

source: :meth:`bytes.hex` now supports optional *sep* and *bytes_per_sep* parameters to insert separators between bytes in the hex output.
el: Η :meth:`bytes.hex` υποστηρίζει πλέον προαιρετικές παραμέτρους *sep* και *bytes_per_sep* για την εισαγωγή διαχωριστικών μεταξύ των byte στην έξοδο δεκαεξαδικού.

source: Since bytes objects are sequences of integers (akin to a tuple), for a bytes object *b*, ``b[0]`` will be an integer, while ``b[0:1]`` will be a bytes object of length 1. (This contrasts with text strings, where both indexing and slicing will produce a string of length 1)
el: Δεδομένου ότι τα αντικείμενα bytes είναι ακολουθίες ακεραίων αριθμών (όμοια με μια πλειάδα (tuple)), για ένα αντικείμενο bytes *b*, το ``b[0]`` θα είναι ένας ακέραιος αριθμός, ενώ το ``b[0:1]`` θα είναι ένα αντικείμενο bytes μήκους 1. (Αυτό έρχεται σε αντίθεση με τις συμβολοσειρές κειμένου, όπου τόσο η λειτουργία πρόσβασης ως ευρετήριο όσο και η λειτουργία τμηματοποίησης θα παράγουν μια συμβολοσειρά μήκους 1)

source: The representation of bytes objects uses the literal format (``b'...'``) since it is often more useful than e.g. ``bytes([46, 46, 46])``. You can always convert a bytes object into a list of integers using ``list(b)``.
el: Η αναπαράσταση αντικειμένων bytes χρησιμοποιεί την literal μορφή (``b'...'``) , καθώς είναι συχνά πιο χρήσιμη από π.χ. ``bytes([46, 46, 46])``. Μπορείτε πάντα να μετατρέψετε ένα αντικείμενο bytes σε μια λίστα ακέραιων αριθμών που χρησιμοποιούν ``list(b)``.

source: Bytearray Objects
el: Αντικείμενα Bytearray

source: :class:`bytearray` objects are a mutable counterpart to :class:`bytes` objects.
el: Τα αντικείμενα :class:`bytearray` είναι ένα μεταβλητό, αντίστοιχο, των αντικειμένων :class:`bytes`.

source: There is no dedicated literal syntax for bytearray objects, instead they are always created by calling the constructor:
el: Δεν υπάρχει αποκλειστική literal σύνταξη για αντικείμενα bytearray, αντίθετα δημιουργούνται πάντα καλώντας τον constructor:

source: Creating an empty instance: ``bytearray()``
el: Δημιουργία ενός κενού στιγμιοτύπου: ``bytearray()``

source: Creating a zero-filled instance with a given length: ``bytearray(10)``
el: Δημιουργία μηδενικού στιγμιοτύπου με δεδομένο μήκος: ``bytearray(10)``

source: From an iterable of integers: ``bytearray(range(20))``
el: Από έναν iterable αριθμό ακεραίων: ``bytearray(range(20))``

source: Copying existing binary data via the buffer protocol: ``bytearray(b'Hi!')``
el: Αντιγραφή υπαρχόντων δυαδικών δεδομένων μέσω του πρωτοκόλλου buffer: ``bytearray(b'Hi!')``

source: As bytearray objects are mutable, they support the :ref:`mutable <typesseq-mutable>` sequence operations in addition to the common bytes and bytearray operations described in :ref:`bytes-methods`.
el: Καθώς τα αντικείμενα του bytearray είναι μεταβλητά, υποστηρίζουν τις λειτουργίες της ακολουθίας :ref:`mutable <typesseq-mutable>` επιπλέον των κοινών λειτουργιών bytes και bytearray που περιγράφονται στο :ref:`bytes-methods`.

source: Also see the :ref:`bytearray <func-bytearray>` built-in.
el: Δείτε επίσης το ενσωματωμένο :ref:`bytearray <func-bytearray>`.
