Repository: thepetk/python-docs-gr
Catalog: library/stdtypes.po
Languages: el

source: If :class:`~memoryview.format` is one of the native format specifiers from the :mod:`struct` module, indexing with an integer or a tuple of integers is also supported and returns a single *element* with the correct type. One-dimensional memoryviews can be indexed with an integer or a one-integer tuple. Multi-dimensional memoryviews can be indexed with tuples of exactly *ndim* integers where *ndim* is the number of dimensions. Zero-dimensional memoryviews can be indexed with the empty tuple.
el: Εάν το :class:`~memoryview.format` είναι ένας από τους προσδιοριστές εγγενούς μορφής από το module :mod:`struct`, η πρόσβαση μέσω ευρετηρίου με έναν ακέραιο ή μια πλειάδα (tuple) ακεραίων υποστηρίζεται επίσης και επιστρέφει ένα μεμονωμένο *στοιχείο* με το σωστό τύπο. Τα μονοδιάστατα memoryviews μπορούν να γίνουν indexed με έναν ακέραιο ή έναν ακέραιο πλειάδα (tuple). Τα πολυδιάστατα memoryviews μπορούν αν γίνουν indexed με πλειάδες (tuples) ακριβώς *ndim* ακεραίων όπου *ndim* είναι ο αριθμός των διαστάσεων. Τα μηδενικών διαστάσεων memoryviews μπορούν να γίνουν indexed με την κενή πλειάδα (tuple).

source: Here is an example with a non-byte format::
el: Ακολουθεί ένα παράδειγμα με μη-byte μορφή::

source: If the underlying object is writable, the memoryview supports one-dimensional slice assignment. Resizing is not allowed::
el: Εάν το βασικό αντικείμενο είναι εγγράψιμο, το memoryview υποστηρίζει μονοδιάστατη εκχώρηση τμηματοποίησης. Δεν επιτρέπεται η αλλαγή μεγέθους::

source: One-dimensional memoryviews of :term:`hashable` (read-only) types with formats 'B', 'b' or 'c' are also hashable. The hash is defined as ``hash(m) == hash(m.tobytes())``::
el: Τα μονοδιάστατα memoryviews των τύπων :term:`hashable` (μόνο για ανάγνωση) με μορφές 'B', 'b' ή 'c' μπορούν επίσης να κατακερματιστούν. Ο κατακερματισμός ορίζεται ως ``hash(m) == hash(m.tobytes())``::

source: One-dimensional memoryviews can now be sliced. One-dimensional memoryviews with formats 'B', 'b' or 'c' are now :term:`hashable`.
el: Τα μονοδιάστατα memoryviews μπορούν πλέον να τμηματοποιηθούν. Τα μονοδιάστατα memoryviews με μορφές 'B', 'b' ή 'c' είναι πλέον :term:`hashable`.

source: memoryview is now registered automatically with :class:`collections.abc.Sequence`
el: το memoryview εγγράφεται πλέον αυτόματα με :class:`collections.abc.Sequence`

source: memoryviews can now be indexed with tuple of integers.
el: τα memoryviews μπορούν τώρα να γίνουν ευρετηριοποίηση με πλειάδα (tuple) ακεραίων.

source: memoryview is now a :term:`generic type`.
el: Το memoryview είναι πλέον ένα :term:`generic type`.

source: :class:`memoryview` has several methods:
el: το :class:`memoryview` έχει διάφορες μεθόδους:

source: A memoryview and a :pep:`3118` exporter are equal if their shapes are equivalent and if all corresponding values are equal when the operands' respective format codes are interpreted using :mod:`struct` syntax.
el: Ένα memoryview και ένας εξαγωγέας :pep:`3118` είναι ίσοι εάν τα σχήματα τους είναι ισοδύναμα και εάν όλες οι αντίστοιχες τιμές είναι ίσες όταν οι αντίστοιχοι κωδικοί μορφής των τελεστών ερμηνεύονται χρησιμοποιώντας τη σύνταξη :mod:`struct`.

source: For the subset of :mod:`struct` format strings currently supported by :meth:`tolist`, ``v`` and ``w`` are equal if ``v.tolist() == w.tolist()``::
el: Για το υποσύνολο του :mod:`struct` οι συμβολοσειρές μορφής που υποστηρίζονται αυτή τη στιγμή από το :meth:`tolist`, ``v`` και ``w`` είναι ίσες εάν ``v.tolist() == w.tolist()``::

source: If either format string is not supported by the :mod:`struct` module, then the objects will always compare as unequal (even if the format strings and buffer contents are identical)::
el: Εάν καμία συμβολοσειρά μορφής δεν υποστηρίζεται από το module :mod:`struct`, τότε τα αντικείμενα θα συγκρίνονται πάντα ως άνισα (ακόμα και αν οι συμβολοσειρές μορφοποίησης και τα περιεχόμενα της προσωρινής μνήμης είναι πανομοιότυπα)::

source: Note that, as with floating-point numbers, ``v is w`` does *not* imply ``v == w`` for memoryview objects.
el: Λάβετε υπόψη ότι, όπως και με τους αριθμούς κινητής υποδιαστολής, ``v is w`` *δεν* σημαίνει ``v == w`` για αντικείμενα memoryview.

source: Previous versions compared the raw memory disregarding the item format and the logical array structure.
el: Οι προηγούμενες εκδόσεις συνέκριναν την ακατέργαστη μνήμη αγνοώντας τη μορφή του στοιχείου και τη δομή του λογικού πίνακα.

source: Return the data in the buffer as a bytestring. This is equivalent to calling the :class:`bytes` constructor on the memoryview. ::
el: Επιστρέφει τα δεδομένα στο buffer ως ένα bytestring. Αυτό ισοδυναμεί με την κλήση του κατασκευαστή :class:`bytes` στο memoryview. ::

source: For non-contiguous arrays the result is equal to the flattened list representation with all elements converted to bytes. :meth:`tobytes` supports all format strings, including those that are not in :mod:`struct` module syntax.
el: Για μη συνεχόμενους πίνακες, το αποτέλεσμα είναι ίσο με την αναπαράσταση της ισοπεδωμένης λίστας με όλα τα στοιχεία να μετατρέπονται σε bytes. Η :meth:`tobytes` υποστηρίζει όλες τις συμβολοσειρές μορφής, συμπεριλαμβανομένων εκείνων που δεν είναι στη σύνταξη του module :mod:`struct`.

source: *order* can be {'C', 'F', 'A'}. When *order* is 'C' or 'F', the data of the original array is converted to C or Fortran order. For contiguous views, 'A' returns an exact copy of the physical memory. In particular, in-memory Fortran order is preserved. For non-contiguous views, the data is converted to C first. *order=None* is the same as *order='C'*.
el: Το *order* μπορεί να είναι {'C', 'F', 'A'}. Όταν το *order* είναι 'C' ή 'F', τα δεδομένα του αρχικού πίνακα μετατρέπονται σε C ή σε σειρά Fortran. Για συνεχόμενες όψεις, το 'A' επιστρέφει ένα ακριβές αντίγραφο της φυσικής μνήμης. Συγκεκριμένα, διατηρείται σειρά Fortran στη μνήμη. Για μη συνεχόμενες προβολές, τα δεδομένα μετατρέπονται πρώτα σε C. Το *order=None* είναι το ίδιο με το *order='C'*.

source: Return a string object containing two hexadecimal digits for each byte in the buffer. ::
el: Επιστρέφει ένα αντικείμενο συμβολοσειράς που περιέχει δύο δεκαεξαδικά ψηφία για κάθε byte στο buffer. ::

source: Similar to :meth:`bytes.hex`, :meth:`memoryview.hex` now supports optional *sep* and *bytes_per_sep* parameters to insert separators between bytes in the hex output.
el: Παρόμοιο με το :meth:`bytes.hex`, το :meth:`memoryview.hex` τώρα υποστηρίζει προαιρετικές παραμέτρους *sep* και *bytes_per_sep* για να εισάγετε διαχωριστικά μεταξύ των byte στην εξαγωγή δεκαεξαδικού.

source: Return the data in the buffer as a list of elements. ::
el: Επιστρέψτε τα δεδομένα στο buffer ως λίστα στοιχείων. ::

source: :meth:`tolist` now supports all single character native formats in :mod:`struct` module syntax as well as multi-dimensional representations.
el: Η :meth:`tolist` υποστηρίζει πλέον όλες τις εγγενείς μορφές μεμονωμένων χαρακτήρων στη σύνταξη του :mod:`struct`, καθώς και πολυδιάστατες αναπαραστάσεις.

source: Return a readonly version of the memoryview object. The original memoryview object is unchanged. ::
el: Επιστρέφει μια έκδοση μόνο για ανάγνωση του αντικειμένου memoryview. Το αρχικό αντικείμενο memoryview είναι αμετάβλητο. ::

source: Release the underlying buffer exposed by the memoryview object. Many objects take special actions when a view is held on them (for example, a :class:`bytearray` would temporarily forbid resizing); therefore, calling release() is handy to remove these restrictions (and free any dangling resources) as soon as possible.
el: Απελευθερώνει το υποκείμενο buffer που εκτίθεται από το αντικείμενο memoryview. Πολλά αντικείμενα πραγματοποιούν ειδικές ενέργειες όταν διατηρείται μια προβολή σε αυτά (για παράδειγμα, μια :class:`bytearray` θα απαγόρευε προσωρινά την αλλαγή μεγέθους)· επομένως, η κλήση της release() είναι βολική για την κατάργηση αυτών των περιορισμών (και απελευθερώνει οποιουσδήποτε αιωρούμενους πόρους) το συντομότερο δυνατό.

source: After this method has been called, any further operation on the view raises a :class:`ValueError` (except :meth:`release` itself which can be called multiple times)::
el: Μετά την κλήση αυτής της μεθόδου, οποιαδήποτε περαιτέρω λειτουργία στην προβολή δημιουργεί μια :class:`ValueError` (εκτός από την ίδια την :meth:`release` που μπορεί να κληθεί πολλές φορές)::

source: The context management protocol can be used for a similar effect, using the ``with`` statement::
el: Το πρωτόκολλο διαχείρισης περιεχομένου μπορεί να χρησιμοποιηθεί για παρόμοιο αποτέλεσμα, χρησιμοποιώντας τη δήλωση ``with``::

source: Cast a memoryview to a new format or shape. *shape* defaults to ``[byte_length//new_itemsize]``, which means that the result view will be one-dimensional. The return value is a new memoryview, but the buffer itself is not copied. Supported casts are 1D -> C-:term:`contiguous` and C-contiguous -> 1D.
el: Μορφοποιεί ένα memoryview σε νέα μορφή ή σχήμα. Το *shape* είναι από προεπιλογή ``[byte_length//new_itemsize]``, που σημαίνει ότι η προβολή αποτελέσματος θα είναι μονοδιάστατη. Η επιστρεφόμενη τιμή είναι ένα νέο memoryview, αλλά το ίδιο το buffer δεν αντιγράφεται. Οι υποστηριζόμενες μετατροπές είναι 1D -> C-:term:`contiguous` και C-contiguous -> 1D.

source: The destination format is restricted to a single element native format in :mod:`struct` syntax. One of the formats must be a byte format ('B', 'b' or 'c'). The byte length of the result must be the same as the original length. Note that all byte lengths may depend on the operating system.
el: Η μορφή προορισμού περιορίζεται σε μια εγγενή μορφή μεμονωμένου στοιχείου στη σύνταξη :mod:`struct`. Μία από τις μορφές πρέπει να είναι μορφή byte ('B', 'b' ή 'c'). Το μήκος byte του αποτελέσματος πρέπει να είναι το ίδιο με το αρχικό μήκος. Σημειώστε ότι όλα τα μήκη byte μπορεί να εξαρτώνται από το λειτουργικό σύστημα.

source: Cast 1D/long to 1D/unsigned bytes::
el: Μορφοποίηση από 1D/long σε 1D/unsigned bytes::

source: Cast 1D/unsigned bytes to 1D/char::
el: Μορφοποίηση από 1D/unsigned bytes σε 1D/char::

source: Cast 1D/bytes to 3D/ints to 1D/signed char::
el: Μορφοποίηση από 1D/bytes σε 3D/ints σε 1D/signed char::

source: Cast 1D/unsigned long to 2D/unsigned long::
el: Μορφοποίηση από 1D/unsigned long σε 2D/unsigned long::

source: The source format is no longer restricted when casting to a byte view.
el: Η πηγαία μορφή δεν είναι πλέον περιορισμένη κατά τη μορφοποίηση σε μια όψη byte.

source: Count the number of occurrences of *value*.
el: Μετράει τον αριθμό των εμφανίσεων του *value*.

source: Return the index of the first occurrence of *value* (at or after index *start* and before index *stop*).
el: Επιστρέφει τον δείκτη της πρώτης εμφάνισης του *value* (στην ή μετά τον δείκτη *start* και πριν από τον δείκτη *stop*).

source: Raises a :exc:`ValueError` if *value* cannot be found.
el: Κάνει raise μια :exc:`ValueError` αν δεν μπορεί να βρεθεί η τιμή *value*.

source: There are also several readonly attributes available:
el: Υπάρχουν επίσης αρκετά διαθέσιμα χαρακτηριστικά μόνο για ανάγνωση:

source: The underlying object of the memoryview::
el: Το βασικό αντικείμενο του memoryview::

source: ``nbytes == product(shape) * itemsize == len(m.tobytes())``. This is the amount of space in bytes that the array would use in a contiguous representation. It is not necessarily equal to ``len(m)``::
el: ``nbytes == product(shape) * itemsize == len(m.tobytes())``. Αυτή είναι η ποσότητα χώρου σε byte που θα χρησιμοποιούσε ο πίνακας σε μια συνεχόμενη αναπαράσταση. Δεν ισούται απαραίτητα με ``len(m)``::

source: Multi-dimensional arrays::
el: Πολυδιάστατοι πίνακες::

source: A bool indicating whether the memory is read only.
el: Ένα bool που υποδεικνύει εάν η μνήμη είναι μόνο για ανάγνωση.

source: A string containing the format (in :mod:`struct` module style) for each element in the view. A memoryview can be created from exporters with arbitrary format strings, but some methods (e.g. :meth:`tolist`) are restricted to native single element formats.
el: Μια συμβολοσειρά που περιέχει τη μορφή (σε module style :mod:`struct`) για κάθε στοιχείο σε μια όψη. Μπορεί να δημιουργηθεί ένα memoryview από εξαγωγείς με συμβολοσειρές αυθαίρετης μορφής, αλλά ορισμένες μέθοδοι (π.χ. :meth:`tolist`) είναι περιορισμένες σε εγγενείς μορφές ενός στοιχείου.

source: format ``'B'`` is now handled according to the struct module syntax. This means that ``memoryview(b'abc')[0] == b'abc'[0] == 97``.
el: η μορφή ``'B'`` αντιμετωπίζεται πλέον σύμφωνα με τη σύνταξη ενός struct module. Αυτό σημαίνει ότι ``memoryview(b'abc')[0] == b'abc'[0] == 97``.

source: The size in bytes of each element of the memoryview::
el: Το μέγεθος σε bytes κάθε στοιχείου στο memoryview::

source: An integer indicating how many dimensions of a multi-dimensional array the memory represents.
el: Ένα ακέραιος αριθμός που δείχνει πόσες διαστάσεις ενός πολυδιάστατου πίνακα αντιπροσωπεύει η μνήμη.

source: A tuple of integers the length of :attr:`ndim` giving the shape of the memory as an N-dimensional array.
el: Μια πλειάδα (tuple) ακεραίων με μήκος :attr:`ndim` δίνοντας το σχήμα της μνήμης ως πίνακα N-διαστάσεων.

source: An empty tuple instead of ``None`` when ndim = 0.
el: Μια κενή πλειάδα (tuple) αντί για ``None`` όταν ndim = 0.

source: A tuple of integers the length of :attr:`ndim` giving the size in bytes to access each element for each dimension of the array.
el: Μια πλειάδα ακεραίων με μήκος :attr:`ndim` που δίνει το μέγεθος σε bytes για την πρόσβαση σε κάθε στοιχείο για κάθε διάσταση του πίνακα.

source: Used internally for PIL-style arrays. The value is informational only.
el: Χρησιμοποιείται εσωτερικά για συστοιχίες τύπου PIL. Η τιμή είναι μόνο ενημερωτική.

source: A bool indicating whether the memory is C-:term:`contiguous`.
el: Ένα bool που υποδεικνύει εάν η μνήμη είναι C-:term:`contiguous`.

source: A bool indicating whether the memory is Fortran :term:`contiguous`.
el: Ένα bool που υποδεικνύει εάν η μνήμη είναι Fortran :term:`contiguous`.

source: A bool indicating whether the memory is :term:`contiguous`.
el: Ένα bool που υποδεικνύει εάν η μνήμη είναι :term:`contiguous`.

source: Set Types --- :class:`set`, :class:`frozenset`
el: Τύποι Συνόλου (Set) --- :class:`set`, :class:`frozenset`

source: A :dfn:`set` object is an unordered collection of distinct :term:`hashable` objects. Common uses include membership testing, removing duplicates from a sequence, and computing mathematical operations such as intersection, union, difference, and symmetric difference. (For other containers see the built-in :class:`dict`, :class:`list`, and :class:`tuple` classes, and the :mod:`collections` module.)
el: Ένα αντικείμενο :dfn:`set` είναι μια μη ταξινομημένη συλλογή από διακριτά αντικείμενα :term:`hashable`. Οι συνήθεις χρήσεις περιλαμβάνουν τη δοκιμή ιδιότητας μέλους, την αφαίρεση διπλότυπων από μια ακολουθία και τον υπολογισμό μαθηματικών πράξεων όπως τομή, ένωση, διαφορά, και συμμετρική διαφορά. (Για άλλα containers, δείτε τις ενσωματωμένες κλάσεις :class:`dict`, :class:`list`, και :class:`tuple` και το module :mod:`collections`).

source: Like other collections, sets support ``x in set``, ``len(set)``, and ``for x in set``. Being an unordered collection, sets do not record element position or order of insertion. Accordingly, sets do not support indexing, slicing, or other sequence-like behavior.
el: Όπως και άλλες συλλογές, τα σύνολα (sets) υποστηρίζουν ``x in set``, ``len(set)``, και ``for x in set``. Όντως μια μη ταξινομημένη συλλογή, τα σύνολα δεν καταγράφουν τη θέση του στοιχείου ή τη σειρά εισαγωγής. Συνεπώς, τα σύνολα (sets) δεν υποστηρίζουν λειτουργίες ευρετηριοποίησης, τμηματοποίησης ή άλλη συμπεριφορά ακολουθίας.

source: There are currently two built-in set types, :class:`set` and :class:`frozenset`. The :class:`set` type is mutable --- the contents can be changed using methods like :meth:`~set.add` and :meth:`~set.remove`. Since it is mutable, it has no hash value and cannot be used as either a dictionary key or as an element of another set. The :class:`frozenset` type is immutable and :term:`hashable` --- its contents cannot be altered after it is created; it can therefore be used as a dictionary key or as an element of another set.
el: Υπάρχουν αυτή τη στιγμή δύο ενσωματωμένοι τύποι συνόλου, :class:`set` και :class:`frozenset`. Ο τύπος :class:`set` είναι ευμετάβλητος --- τα περιεχόμενα του μπορούν να αλλάξουν χρησιμοποιώντας μεθόδους όπως :meth:`~set.add` και :meth:`~set.remove`. Δεδομένου ότι είναι ευμετάβλητο, δεν έχει τιμή κατακερματισμού και δεν μπορεί να χρησιμοποιηθεί ούτε ως κλειδί λεξικού ούτε ως στοιχείο ενός άλλου συνόλου (set). Ο τύπος :class:`frozenset` είναι αμετάβλητος και :term:`hashable` --- το περιεχόμενό του δεν μπορεί να αλλάξει μετά τη δημιουργία του· μπορεί επομένως να χρησιμοποιηθεί ως κλειδί λεξικού ή ως στοιχείο άλλου συνόλου (set).

source: Non-empty sets (not frozensets) can be created by placing a comma-separated list of elements within braces, for example: ``{'jack', 'sjoerd'}``, in addition to the :class:`set` constructor.
el: Μπορούν να δημιουργηθούν μη κενά σύνολα (όχι παγωμένα σύνολα (frozensets)) τοποθετώντας μια λίστα στοιχείων διαχωρισμένων με κόμμα μέσα σε αγκύλες, για παράδειγμα: ``{'jack', 'sjoerd'}``, επιπλέον με τη χρήση του constructor του :class:`set`.

source: The constructors for both classes work the same:
el: Οι constructors και για τις δύο κλάσεις λειτουργούν το ίδιο:

source: Return a new set or frozenset object whose elements are taken from *iterable*. The elements of a set must be :term:`hashable`. To represent sets of sets, the inner sets must be :class:`frozenset` objects. If *iterable* is not specified, a new empty set is returned.
el: Επιστρέφει ένα νέο σύνολο (set) ή ένα παγωμένο σύνολο (frozenset) των οποίων τα στοιχεία έχουν ληφθεί από το *iterable*. Τα στοιχεία ενός συνόλου πρέπει να είναι :term:`hashable`. Για να αναπαραστήσουν σύνολα συνόλων, τα εσωτερικά σύνολα πρέπει να είναι :class:`frozenset` αντικείμενα. Εάν δεν έχει καθοριστεί το *iterable*, επιστρέφεται ένα νέο κενό σύνολο.

source: Sets can be created by several means:
el: Τα σύνολα μπορούν να δημιουργηθούν με διάφορους τρόπους:

source: Use a comma-separated list of elements within braces: ``{'jack', 'sjoerd'}``
el: Χρησιμοποιώντας μια λίστα στοιχείων διαχωρισμένη με κόμματα: ``{'jack', 'sjoerd'}``

source: Use a set comprehension: ``{c for c in 'abracadabra' if c not in 'abc'}``
el: Χρησιμοποιώντας ένα set comprehension: ``{c for c in 'abracadabra' if c not in 'abc'}``

source: Use the type constructor: ``set()``, ``set('foobar')``, ``set(['a', 'b', 'foo'])``
el: Χρησιμοποιώντας τον τύπο constructor: ``set()``, ``set('foobar')``, ``set(['a', 'b', 'foo'])``

source: Instances of :class:`set` and :class:`frozenset` provide the following operations:
el: Τα στιγμιότυπα των :class:`set` και :class:`frozenset` παρέχουν τις ακόλουθες λειτουργίες:

source: Return the number of elements in set *s* (cardinality of *s*).
el: Επιστρέφει τον αριθμό των στοιχείων στο σύνολο *s* (πληθικότητα του *s*).

source: Test *x* for membership in *s*.
el: Ελέγχει αν το *x* είναι μέρος στο *s*.

source: Test *x* for non-membership in *s*.
el: Ελέγχει αν το *x* δεν είναι μέρος στο *s*.

source: Return ``True`` if the set has no elements in common with *other*. Sets are disjoint if and only if their intersection is the empty set.
el: Επιστρέφει ``True`` εάν το σύνολο δεν έχει κοινά στοιχεία με το *other*. Τα σύνολα είναι ασύνδετα εάν και μόνο εάν η τομή τους είναι το κενό σύνολο.

source: Test whether every element in the set is in *other*.
el: Ελέγχει εάν κάθε στοιχείο στο σύνολο βρίσκεται στο *other*.

source: Test whether the set is a proper subset of *other*, that is, ``set <= other and set != other``.
el: Ελέγχει εάν το σύνολο είναι σωστό υποσύνολο του *other*, δηλαδή, ``set <= other and set != other``.

source: Test whether every element in *other* is in the set.
el: Ελέγχει αν κάθε στοιχείο του *other* είναι στο σύνολο.

source: Test whether the set is a proper superset of *other*, that is, ``set >= other and set != other``.
el: Ελέγχει αν το σύνολο είναι σωστό υπερσύνολο του *other*, δηλαδή, ``set >= other and set != other``.

source: Return a new set with elements from the set and all others.
el: Επιστρέφει ένα νέο σύνολο με στοιχεία από το σύνολο και όλα τα άλλα.

source: Return a new set with elements common to the set and all others.
el: Επιστρέφει ένα νέο σύνολο με στοιχεία κοινά στο σύνολο και σε όλα τα άλλα.

source: Return a new set with elements in the set that are not in the others.
el: Επιστρέφει ένα νέο σύνολο με στοιχεία στο σύνολο που δεν υπάρχουν στα άλλα.

source: Return a new set with elements in either the set or *other* but not both.
el: Επιστρέφει ένα νέο σύνολο με στοιχεία είτε στο σύνολο είτε στο *other* αλλά όχι και στα δύο.

source: Return a shallow copy of the set.
el: Επιστρέφει ένα ρηχό αντίγραφο του συνόλου.

source: Note, the non-operator versions of :meth:`union`, :meth:`intersection`, :meth:`difference`, :meth:`symmetric_difference`, :meth:`issubset`, and :meth:`issuperset` methods will accept any iterable as an argument. In contrast, their operator based counterparts require their arguments to be sets. This precludes error-prone constructions like ``set('abc') & 'cbs'`` in favor of the more readable ``set('abc').intersection('cbs')``.
el: Σημείωση, οι εκδόσεις μη τελεστών των μεθόδων :meth:`union`, :meth:`intersection`, :meth:`difference`, :meth:`symmetric_difference`, :meth:`issubset`, και :meth:`issuperset` θα δεχτούν οποιοδήποτε iterable ως όρισμα. Αντίθετα, οι αντίστοιχοι τελεστές απαιτούν να οριστούν τα ορίσματά τους για να γίνουν σύνολα. Αυτό αποκλείει κατασκευαστές επιρρεπείς σε σφάλματα όπως ``set('abc') & 'cbs'`` υπέρ του πιο ευανάγνωστου ``set('abc').intersection('cbs')``.

source: Both :class:`set` and :class:`frozenset` support set to set comparisons. Two sets are equal if and only if every element of each set is contained in the other (each is a subset of the other). A set is less than another set if and only if the first set is a proper subset of the second set (is a subset, but is not equal). A set is greater than another set if and only if the first set is a proper superset of the second set (is a superset, but is not equal).
el: Τόσο το :class:`set` και :class:`frozenset` υποστηρίζουν τη σύγκριση μεταξύ συνόλων. Δύο σύνολα είναι ίσα εάν και μόνο εάν κάθε στοιχείο κάθε συνόλου περιέχεται στο άλλο (το καθένα είναι υποσύνολο του άλλου). Ένα σύνολο είναι μικρότερο από ένα άλλο σύνολο εάν και μόνο αν το πρώτο σύνολο είναι σωστό υποσύνολο του δεύτερου συνόλου (είναι υποσύνολο, αλλά δεν είναι ίσο), ένα σύνολο είναι μεγαλύτερο από ένα άλλο σύνολο, αν και μόνο αν το πρώτο σύνολο είναι σωστό υπερσύνολο του δεύτερου συνόλου (είναι υπερσύνολο αλλά δεν είναι ίσο).

source: Instances of :class:`set` are compared to instances of :class:`frozenset` based on their members. For example, ``set('abc') == frozenset('abc')`` returns ``True`` and so does ``set('abc') in set([frozenset('abc')])``.
el: Τα στιγμιότυπα της :class:`set` συγκρίνονται με τα στιγμιότυπα της :class:`frozenset` με βάση τα μέλη τους. Για παράδειγμα, το ``set('abc') == frozenset('abc')`` επιστρέφει ``True`` και το ίδιο συμβαίνει και με το ``set('abc') in set([frozenset('abc')])``.

source: The subset and equality comparisons do not generalize to a total ordering function. For example, any two nonempty disjoint sets are not equal and are not subsets of each other, so *all* of the following return ``False``: ``a<b``, ``a==b``, or ``a>b``.
el: Οι συγκρίσεις υποσυνόλου και ισότητας δεν γενικεύονται σε μια συνάρτηση ολικής ταξινόμησης. Για παράδειγμα, οποιαδήποτε δύο μη κενά συνεχή σύνολα δεν είναι ίσα και δεν είναι υποσύνολα το ένα του άλλου, επομένως *όλα* τα ακόλουθα επιστρέφουν ``False``: ``a<b``, ``a==b``, or ``a>b``.
