Repository: thepetk/python-docs-gr
Catalog: library/stdtypes.po
Languages: el

source: Built-in Types
el: Τύποι Built-in

source: The following sections describe the standard types that are built into the interpreter.
el: Οι παρακάτω κατηγορίες περιγράφουν τους standard τύπους που είναι ενσωματωμένοι (built) μέσα στον interpreter.

source: The principal built-in types are numerics, sequences, mappings, classes, instances and exceptions.
el: Οι κύριοι ενσωματωμένοι (built) τύποι είναι αριθμοί, ακολουθίες, αντιστοιχίσεις (mappings), κλάσεις, instances και exceptions.

source: Some collection classes are mutable. The methods that add, subtract, or rearrange their members in place, and don't return a specific item, never return the collection instance itself but ``None``.
el: Ορισμένες collection κλάσεις είναι μεταβλητές (mutable). Οι μέθοδοι που προσθέτουν, αφαιρούν ή αναδιατάσσουν τα μέλη τους και δεν επιστρέφουν ένα συγκεκριμένο αντικείμενο, ποτέ δεν επιστρέφουν το ίδιο collection instance αλλά ``None``.

source: Some operations are supported by several object types; in particular, practically all objects can be compared for equality, tested for truth value, and converted to a string (with the :func:`repr` function or the slightly different :func:`str` function). The latter function is implicitly used when an object is written by the :func:`print` function.
el: Ορισμένες λειτουργίες υποστηρίζονται από διάφορους τύπους αντικειμένων· ειδικότερα, σχεδόν όλα τα αντικείμενα μπορούν να συγκριθούν ως προς την ισότητα, να ελεγχθούν για την έγκυρη τιμή και να μετατραπούν σε συμβολοσειρά (string) (με τη συνάρτηση :func:`repr` ή την ελαφρώς διαφορετική συνάρτηση :func:`str`). Η τελευταία συνάρτηση χρησιμοποιείται έμμεσα όταν ένα αντικείμενο γράφεται από τη συνάρτηση :func:`print`.

source: Truth Value Testing
el: Έλεγχος Έγκυρης Τιμής

source: Any object can be tested for truth value, for use in an :keyword:`if` or :keyword:`while` condition or as operand of the Boolean operations below.
el: Οποιοδήποτε αντικείμενο μπορεί να ελεγχθεί ως προς την εγκυρότητα της τιμής του, για χρήση σε :keyword:`if` ή :keyword:`while` συνθήκη ή ως τελεστής των λογικών πράξεων παρακάτω.

source: By default, an object is considered true unless its class defines either a :meth:`~object.__bool__` method that returns ``False`` or a :meth:`~object.__len__` method that returns zero, when called with the object. [1]_ Here are most of the built-in objects considered false:
el: Ως προεπιλογή, ένα αντικείμενο θεωρείται true εκτός εάν η κλάση του ορίζει μία :meth:`~object.__bool__` μέθοδο που επιστρέφει ``False`` ή μία :meth:`~object.__len__` μέθοδο που επιστρέφει μηδέν, όταν καλείται με το αντικείμενο. [1]_ Εδώ τα περισσότερα από τα ενσωματωμένα (built-in) αντικείμενα θεωρούνται false:

source: constants defined to be false: ``None`` and ``False``
el: σταθερές που έχουν οριστεί ως false: ``None`` και ``False``

source: zero of any numeric type: ``0``, ``0.0``, ``0j``, ``Decimal(0)``, ``Fraction(0, 1)``
el: μηδέν οποιουδήποτε αριθμητικού τύπου: ``0``, ``0,0``, ``0j``, ``Decimanl(0)``, ``Fraction(0, 1)``

source: empty sequences and collections: ``''``, ``()``, ``[]``, ``{}``, ``set()``, ``range(0)``
el: κενές ακολουθίες και collections: ``''``, ``()``, ``[]``, ``{}``, ``set()``, ``range(0)``

source: Operations and built-in functions that have a Boolean result always return ``0`` or ``False`` for false and ``1`` or ``True`` for true, unless otherwise stated. (Important exception: the Boolean operations ``or`` and ``and`` always return one of their operands.)
el: Οι πράξεις και οι ενσωματωμένες (built-in) συναρτήσεις που έχουν αποτέλεσμα Boolean πάντα επιστρέφουν ``0`` ή ``False`` για false και ``1`` ή ``True`` για true, εκτός εάν δηλώνεται διαφορετικά. (Σημαντική εξαίρεση: οι λογικές (Boolean) πράξεις ``or`` και ``and`` επιστρέφουν πάντα έναν από τους τελεστές τους.)

source: Boolean Operations --- :keyword:`!and`, :keyword:`!or`, :keyword:`!not`
el: Λογικές (Boolean) Πράξεις --- :keyword:`!and`, :keyword:`!or`, :keyword:`!not`

source: These are the Boolean operations, ordered by ascending priority:
el: Αυτές είναι οι λογικές (Boolean) πράξεις, ταξινομημένες βάσει προτεραιότητας:

source: Operation
el: Πράξη

source: Result
el: Αποτέλεσμα

source: Notes
el: Σημειώσεις

source: if *x* is true, then *x*, else *y*
el: αν το *x* είναι true, τότε *x*, αλλιώς *y*

source: if *x* is false, then *x*, else *y*
el: αν το *x* είναι false, τότε *x*, αλλιώς *y*

source: if *x* is false, then ``True``, else ``False``
el: if *x* είναι false, τότε ``True``, αλλιώς ``False``

source: Notes:
el: Σημειώσεις:

source: This is a short-circuit operator, so it only evaluates the second argument if the first one is false.
el: Αυτός είναι ένας τελεστής μικρού κυκλώματος, επομένως αξιολογεί μόνο το δεύτερο όρισμα αν το πρώτο είναι false.

source: This is a short-circuit operator, so it only evaluates the second argument if the first one is true.
el: Αυτός είναι ένας τελεστής μικρού κυκλώματος, επομένως αξιολογεί μόνο το δεύτερο όρισμα αν το πρώτο είναι true.

source: ``not`` has a lower priority than non-Boolean operators, so ``not a == b`` is interpreted as ``not (a == b)``, and ``a == not b`` is a syntax error.
el: To ``not`` έχει χαμηλότερη προτεραιότητα από τους μη λογικούς (non-Boolean) τελεστές, οπότε το ``not a == b`` μεταφράζεται σαν ``not (a==b)``, και το ``a == not b`` είναι συντακτικό σφάλμα.

source: Comparisons
el: Συγκρίσεις

source: There are eight comparison operations in Python. They all have the same priority (which is higher than that of the Boolean operations). Comparisons can be chained arbitrarily; for example, ``x < y <= z`` is equivalent to ``x < y and y <= z``, except that *y* is evaluated only once (but in both cases *z* is not evaluated at all when ``x < y`` is found to be false).
el: Υπάρχουν οκτώ πράξεις σύγκρισης στην Python. Όλες έχουν την ίδια προτεραιότητα (η οποία είναι υψηλότερη από αυτή των λογικών (Boolean) πράξεων). Οι συγκρίσεις μπορεί να αλυσοδεθούν αυθαίρετα· για παράδειγμα, το ``x < y <= z`` ισοδυναμεί με ``x < y και y <= z``, εκτός από το ότι το *y* αξιολογείται μόνο μία φορά (αλλά και στις δύο περιπτώσεις το *z* δεν αξιολογείται καθόλου όταν το ``x < y`` είναι false).

source: This table summarizes the comparison operations:
el: Αυτός ο πίνακας συνοψίζει τις πράξεις σύγκρισης:

source: Meaning
el: Έννοια

source: strictly less than
el: αυστηρά μικρότερο από

source: less than or equal
el: μικρότερο από ή ίσο

source: strictly greater than
el: αυστηρά μεγαλύτερο από

source: greater than or equal
el: μεγαλύτερο από ή ίσο

source: equal
el: ίσο

source: not equal
el: διάφορο

source: object identity
el: ταυτότητα αντικειμένου

source: negated object identity
el: αρνητική ταυτότητα αντικειμένου

source: Objects of different types, except different numeric types, never compare equal. The ``==`` operator is always defined but for some object types (for example, class objects) is equivalent to :keyword:`is`. The ``<``, ``<=``, ``>`` and ``>=`` operators are only defined where they make sense; for example, they raise a :exc:`TypeError` exception when one of the arguments is a complex number.
el: Αντικείμενα διαφορετικών τύπων, εκτός από διαφορετικούς αριθμητικούς τύπους, δεν συγκρίνονται ποτέ ως ίσα. Ο τελεστής ``==`` ορίζεται πάντα αλλά για ορισμένους τύπους αντικειμένων (για παράδειγμα, αντικείμενα κλάσης) ισοδυναμεί με :keyword:`is`. Οι τελεστές ``<``, ``<=``, ``>`` και ``>=`` ορίζονται μόνο όπου έχουν νόημα· για παράδειγμα, δημιουργούν μια εξαίρεση :exc:`TypeError` όταν ένα από τα ορίσματα είναι μιγαδικός αριθμός.

source: Non-identical instances of a class normally compare as non-equal unless the class defines the :meth:`~object.__eq__` method.
el: Μη πανομοιότυπα instances μιας κλάσης συνήθως συγκρίνονται ως μη ίσα εκτός εάν το η κλάση ορίζει τη μέθοδο :meth:`~object.__eq__`.

source: Instances of a class cannot be ordered with respect to other instances of the same class, or other types of object, unless the class defines enough of the methods :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__`, and :meth:`~object.__ge__` (in general, :meth:`~object.__lt__` and :meth:`~object.__eq__` are sufficient, if you want the conventional meanings of the comparison operators).
el: Τα instances μιας κλάσης δεν μπορούν να ταξινομηθούν σε σχέση με άλλα instances της ίδιας κλάσης, ή άλλους τύπους του αντικειμένου, εκτός εάν η κλάση ορίζει αρκετές από τις μεθόδους :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__`, και :meth:`~object.__ge__` (γενικά, :meth:`~object.__lt__` και :meth:`~object.__eq__` είναι αρκετά, αν θέλετε τις συμβατικές έννοιες των τελεστών σύγκρισης).

source: The behavior of the :keyword:`is` and :keyword:`is not` operators cannot be customized; also they can be applied to any two objects and never raise an exception.
el: Η συμπεριφορά των τελεστών :keyword:`is` και :keyword:`is not` δεν μπορεί να είναι προσαρμοσμένη· επίσης, μπορούν να εφαρμοστούν σε οποιαδήποτε δύο αντικείμενα και ποτέ να μην δημιουργήσουν μία εξαίρεση.

source: Two more operations with the same syntactic priority, :keyword:`in` and :keyword:`not in`, are supported by types that are :term:`iterable` or implement the :meth:`~object.__contains__` method.
el: Δύο ακόμη πράξεις με την ίδια συντακτική προτεραιότητα, :keyword:`in` και :keyword:`not in`, υποστηρίζονται από τύπους που είναι :term:`Iterable` ή υλοποιούν τη μέθοδο :meth:`~object.__contains__`.

source: Numeric Types --- :class:`int`, :class:`float`, :class:`complex`
el: Αριμθητικοί Τύποι --- :class:`int`, :class:`float`, :class:`complex`

source: There are three distinct numeric types: :dfn:`integers`, :dfn:`floating-point numbers`, and :dfn:`complex numbers`. In addition, Booleans are a subtype of integers. Integers have unlimited precision. Floating-point numbers are usually implemented using :c:expr:`double` in C; information about the precision and internal representation of floating-point numbers for the machine on which your program is running is available in :data:`sys.float_info`. Complex numbers have a real and imaginary part, which are each a floating-point number. To extract these parts from a complex number *z*, use ``z.real`` and ``z.imag``. (The standard library includes the additional numeric types :mod:`fractions.Fraction`, for rationals, and :mod:`decimal.Decimal`, for floating-point numbers with user-definable precision.)
el: Υπάρχουν τρεις διαφορετικοί αριθμητικοί τύποι: :dfn:`integers`, :dfn:`floating point numbers` και :dfn:`complex numbers`. Επιπλέον, τα Booleans είναι υπό-τύπος ακεραίων (integers). Οι ακέραιοι αριθμοί έχουν απεριόριστη ακρίβεια. Οι Αριθμοί κινητής υποδιαστολής (floating point numbers) συνήθως υλοποιούνται χρησιμοποιώντας το :c:expr:`double` στη C· πληροφορίες σχετικά με την ακρίβεια και την εσωτερική αναπαράσταση αριθμών κινητής υποδιαστολής για το μηχάνημα στο οποίο εκτελείται το πρόγραμμά σας είναι διαθέσιμο στο :data:`sys.float_info`. Οι μιγαδικοί αριθμοί (complex numbers) έχουν ένα πραγματικό και φανταστικό μέρος, κάθε ένα από τα οποία ένας αριθμός κινητής υποδιαστολής. Για να εξαγάγετε αυτά τα μέρη από έναν μιγαδικό αριθμό *z*, χρησιμοποιήστε ``z.real`` και ``z.imag``. (Η standard βιβλιοθήκη περιλαμβάνει τους πρόσθετους αριθμητικούς τύπους :mod:`fractions.Fraction`, για ορθολογικούς, και :mod:`decimal.Decimal`, για αριθμούς κινητής υποδιαστολής με ακρίβεια που ορίζει ο χρήστης.)

source: Numbers are created by numeric literals or as the result of built-in functions and operators. Unadorned integer literals (including hex, octal and binary numbers) yield integers. Numeric literals containing a decimal point or an exponent sign yield floating-point numbers. Appending ``'j'`` or ``'J'`` to a numeric literal yields an imaginary number (a complex number with a zero real part) which you can add to an integer or float to get a complex number with real and imaginary parts.
el: Οι αριθμοί δημιουργούνται με αριθμητικά γράμματα ή ως αποτέλεσμα ενσωματωμένων (built-in) συναρτήσεων και τελεστών. Ακέραιοι αριθμοί (συμπεριλαμβανομένων του εξαδικού, του οκταδικού και των δυαδικοί αριθμών) αποδίδουν ακέραιους αριθμούς. Αριθμητικά που περιέχουν δεκαδικό ή εκθέτη παράγουν αριθμούς κινητής υποδιαστολής. Η προσάρτηση του ``'j'`` ή του ``'J'`` σε ένα αριθμητικό παράγει έναν φανταστικό αριθμό (έναν μιγαδικό αριθμό με μηδενικό πραγματικό μέρος) το οποίο μπορείτε να προσθέσετε σε έναν ακέραιο ή κινητής υποδιαστολής για να πάρετε έναν μιγαδικό αριθμό με πραγματικό και φανταστικό μέρος.

source: The constructors :func:`int`, :func:`float`, and :func:`complex` can be used to produce numbers of a specific type.
el: Μπορούν να χρησιμοποιηθούν οι κατασκευαστές :func:`int`, :func:`float` και :func:`complex` για να παράγουν αριθμούς συγκεκριμένου τύπου.

source: Python fully supports mixed arithmetic: when a binary arithmetic operator has operands of different numeric types, the operand with the "narrower" type is widened to that of the other, where integer is narrower than floating point. Arithmetic with complex and real operands is defined by the usual mathematical formula, for example::
el: Η Python υποστηρίζει πλήρως τα μικτά αριθμητικά: όταν ένας δυαδικός αριθμητικός τελεστής έχει τελεστές διαφορετικών αριθμητικών τύπων, ο τελεστής με το "στενότερο" τύπο διευρύνεται σε αυτόν του άλλου, όπου ένας ακέραιος αριθμός είναι στενότερος από έναν με κινητή υποδιαστολή. Η αριθμητική με μιγαδικούς και πραγματικούς τελεστές ορίζεται από τον συνήθη μαθηματικό τύπο, για παράδειγμα::

source: A comparison between numbers of different types behaves as though the exact values of those numbers were being compared. [2]_
el: Μια σύγκριση μεταξύ αριθμών διαφορετικών τύπων συμπεριφέρεται σαν να συγκρίνονται οι ακριβείς τιμές αυτών των αριθμών. [2]_

source: All numeric types (except complex) support the following operations (for priorities of the operations, see :ref:`operator-summary`):
el: Όλοι οι αριθμητικοί τύποι (εκτός των μιγαδικών) υποστηρίζουν τις ακόλουθες πράξεις (για προτεραιότητες των πράξεων, βλέπε :ref:`operator-summary`):

source: Full documentation
el: Ολόκληρη τεκμηρίωση

source: sum of *x* and *y*
el: άθροισμα του *x* και *y*

source: difference of *x* and *y*
el: διαφορά του *x* και *y*

source: product of *x* and *y*
el: γινόμενο των *x* και *y*

source: quotient of *x* and *y*
el: πηλίκο των *x* και *y*

source: floored quotient of *x* and *y*
el: ακέραιο μέρος του πηλίκου των *x* και *y*

source: remainder of ``x / y``
el: υπόλοιπο του ``x / y``

source: *x* negated
el: *x* αρνητικό

source: *x* unchanged
el: *x* αμετάβλητο

source: absolute value or magnitude of *x*
el: απόλυτη τιμή ή μέγεθος του *x*

source: *x* converted to integer
el: μετατροπή του *x* σε ακέραιο

source: *x* converted to floating point
el: μετατροπή του *x* σε κινητής υποδιαστολής

source: a complex number with real part *re*, imaginary part *im*. *im* defaults to zero.
el: ένας μιγαδικός αριθμός με πραγματικό μέρος *re*, φανταστικό μέρος *im*. Το *im* μετατρέπεται αυτόματα σε μηδέν.

source: conjugate of the complex number *c*
el: συζυγές του μιγαδικού αριθμού *c*

source: the pair ``(x // y, x % y)``
el: το ζευγάρι ``(x // y, x % y)``

source: *x* to the power *y*
el: *x* σε δύναμη του *y*

source: Also referred to as integer division. For operands of type :class:`int`, the result has type :class:`int`. For operands of type :class:`float`, the result has type :class:`float`. In general, the result is a whole integer, though the result's type is not necessarily :class:`int`. The result is always rounded towards minus infinity: ``1//2`` is ``0``, ``(-1)//2`` is ``-1``, ``1//(-2)`` is ``-1``, and ``(-1)//(-2)`` is ``0``.
el: Αναφέρεται επίσης ως διαίρεση ακέραιου αριθμού. Για τελεστές τύπου :class:`int`, το αποτέλεσμα έχει τύπο :class:`int`. Για τελεστές τύπου :class:`float`, το αποτέλεσμα έχει τύπο :class:`float`. Γενικά, το αποτέλεσμα είναι ένας ολόκληρος ακέραιος αριθμός, αν και ο τύπος του αποτελέσματος δεν είναι απαραίτητα :class:`int`. Το αποτέλεσμα είναι πάντα στρογγυλεμένο προς το μείον άπειρο: ``1//2`` είναι ``0``, ``(-1)//2`` είναι ``-1``, ``1//(-2)`` είναι ``-1``, και ``(-1)//(-2)`` είναι ``0``.

source: Not for complex numbers. Instead convert to floats using :func:`abs` if appropriate.
el: Όχι για μιγαδικούς αριθμούς. Αντίθετα μετατρέψτε σε float χρησιμοποιώντας :func:`abs` εάν είναι εφαρμόσιμο.

source: Conversion from :class:`float` to :class:`int` truncates, discarding the fractional part. See functions :func:`math.floor` and :func:`math.ceil` for alternative conversions.
el: Η μετατροπή από :class:`float` σε :class:`int` περικόπτει, απορρίπτοντας το κλασματικό μέρος. Δείτε τις συναρτήσεις :func:`math.floor` και :func:`math.ceil` για εναλλακτικές μετατροπές.

source: float also accepts the strings "nan" and "inf" with an optional prefix "+" or "-" for Not a Number (NaN) and positive or negative infinity.
el: το float δέχεται επίσης τις συμβολοσειρές (strings) "nan" και "inf" με ένα προαιρετικό πρόθεμα "+" ή "-" για το Not a Number (NaN - Όχι αριθμός) και θετικό ή αρνητικό άπειρο.

source: Python defines ``pow(0, 0)`` and ``0 ** 0`` to be ``1``, as is common for programming languages.
el: Η Python ορίζει το ``pow(0, 0)`` και το ``0 ** 0`` ως ``1``, όπως συνηθίζεται για τις γλώσσες προγραμματισμού.

source: The numeric literals accepted include the digits ``0`` to ``9`` or any Unicode equivalent (code points with the ``Nd`` property).
el: Τα αριθμητικά κυριολεκτικά (numeric literals) που γίνονται δεκτά περιλαμβάνουν τα ψηφία ``0`` έως ``9`` ή οποιοδήποτε ισοδύναμο Unicode (σημεία κώδικα με την ιδιότητα ``Nd``).

source: See `the Unicode Standard <https://unicode.org/Public/UNIDATA/extracted/DerivedNumericType.txt>`_ for a complete list of code points with the ``Nd`` property.
el: Δείτε το `Thε Unicode Standard <https://unicode.org/Public/UNIDATA/extracted/DerivedNumericType.txt>`_ για μια πλήρη λίστα σημείων κώδικα με το ``Nd`` property.

source: All :class:`numbers.Real` types (:class:`int` and :class:`float`) also include the following operations:
el: Όλοι οι τύποι :class:`numbers.Real` (:class:`int` και :class:`float`) επίσης περιλαμβάνουν τις ακόλουθες λειτουργίες:

source: *x* truncated to :class:`~numbers.Integral`
el: *x* μετατρέπεται σε :class:`~numbers.Integral`

source: *x* rounded to *n* digits, rounding half to even. If *n* is omitted, it defaults to 0.
el: *x* στρογγυλοποιημένο σε *n* ψηφία, στρογγυλοποιώντας το μισό σε ζυγό. Εάν το *n* παραλειφθεί, το default του είναι το 0.

source: the greatest :class:`~numbers.Integral` <= *x*
el: το μεγαλύτερο :class:`~numbers.Integral` <= *x*

source: the least :class:`~numbers.Integral` >= *x*
el: το μικρότερο :class:`~numbers.Integral` >= *x*

source: For additional numeric operations see the :mod:`math` and :mod:`cmath` modules.
el: Για περαιτέρω αριθμητικές πράξεις δείτε τα modules :mod:`math` και :mod:`cmath`.

source: Bitwise Operations on Integer Types
el: Bitwise Πράξεις σε Ακέραιους Τύπους

source: Bitwise operations only make sense for integers. The result of bitwise operations is calculated as though carried out in two's complement with an infinite number of sign bits.
el: Οι πράξεις bitwise έχουν νόημα μόνο για ακέραιους αριθμούς. Το αποτέλεσμα των bitwise πράξεων υπολογίζεται σαν να εκτελείται σε συμπλήρωμα ως προς δύο με άπειρο αριθμό bits πρόσημου.

source: The priorities of the binary bitwise operations are all lower than the numeric operations and higher than the comparisons; the unary operation ``~`` has the same priority as the other unary numeric operations (``+`` and ``-``).
el: Οι προτεραιότητες των δυαδικών πράξεων bitwise είναι όλες χαμηλότερες από τις αριθμητικές πράξεις και υψηλότερες από τις συγκρίσεις· η μοναδιαία πράξη ``~`` έχει την ίδια προτεραιότητα με τις άλλες μοναδιαίες αριθμητικές πράξεις (``+`` και ``-``).

source: This table lists the bitwise operations sorted in ascending priority:
el: Αυτός ο πίνακας παραθέτει όλες τις bitwise πράξεις ταξινομημένες σε αύξουσα σειρά:

source: bitwise :dfn:`or` of *x* and *y*
el: bitwise :dfn:`or` των *x* και *y*

source: bitwise :dfn:`exclusive or` of *x* and *y*
el: bitwise :dfn:`exclusive or` των *x* και *y*

source: bitwise :dfn:`and` of *x* and *y*
el: bitwise :dfn:`and` των *x* και *y*

source: *x* shifted left by *n* bits
el: *x* ολισθημένο (shifted) αριστερά κατά *n* bits

source: *x* shifted right by *n* bits
el: *x* ολισθημένο (shifted) δεξιά κατά *n* bits

source: the bits of *x* inverted
el: τα bits του *x* αντιστραμμένα

source: Negative shift counts are illegal and cause a :exc:`ValueError` to be raised.
el: Οι μετρήσεις αρνητικών ολισθήσεων (negative shift) είναι άκυρες και κάνουν raise :exc:`ValueError`.

source: A left shift by *n* bits is equivalent to multiplication by ``pow(2, n)``.
el: Μια αριστερή ολίσθηση (shift) κατά *n* bits ισοδυναμεί με πολλαπλασιασμό με ``pow(2, n)``.

source: A right shift by *n* bits is equivalent to floor division by ``pow(2, n)``.
el: Μια δεξιά ολίσθηση (shift) κατά *n* bits ισοδυναμεί με διαίρεση πατώματος με ``pow(2, n)``.

source: Performing these calculations with at least one extra sign extension bit in a finite two's complement representation (a working bit-width of ``1 + max(x.bit_length(), y.bit_length())`` or more) is sufficient to get the same result as if there were an infinite number of sign bits.
el: Η εκτέλεση αυτών των υπολογισμών με τουλάχιστον ένα επιπλέον bit επέκτασης πρόσημου σε μια αναπαράσταση ενός πεπερασμένου συμπληρώματος ως προς δύο (ένα ωφέλιμο bit-width ``1 + max(x.bit_length(), y.bit_length())`` ή περισσότερο) είναι αρκετό για να πάρει το ίδιο αποτέλεσμα σαν να υπήρχε ένας άπειρος αριθμός bits πρόσημου.

source: Additional Methods on Integer Types
el: Περαιτέρω Μέθοδοι των Ακέραιων Τύπων

source: The int type implements the :class:`numbers.Integral` :term:`abstract base class`. In addition, it provides a few more methods:
el: Ο τύπος int υλοποιεί την :class:`numbers.Integral` :term:`abstract base class`. Επιπλέον, παρέχει μερικές ακόμη μεθόδους:

source: Return the number of bits necessary to represent an integer in binary, excluding the sign and leading zeros::
el: Επιστρέφει τον αριθμό των bits που είναι απαραίτητος για να αναπαραστήσει έναν ακέραιο σε δυαδικό, αποκλείοντας το πρόσημο και τα αρχικά μηδέν::

source: More precisely, if ``x`` is nonzero, then ``x.bit_length()`` is the unique positive integer ``k`` such that ``2**(k-1) <= abs(x) < 2**k``. Equivalently, when ``abs(x)`` is small enough to have a correctly rounded logarithm, then ``k = 1 + int(log(abs(x), 2))``. If ``x`` is zero, then ``x.bit_length()`` returns ``0``.
el: Πιο συγκεκριμένα, εάν το ``x`` είναι μη μηδενικό, τότε το ``x.bit_length()`` είναι μοναδικός θετικός αριθμός ``k`` έτσι ώστε ``2**(k-1) <= abs(x) < 2**k``. Ισοδύναμα, όταν το ``abs(x)`` είναι αρκετά μικρό για να έχει ένα σωστά στρογγυλοποιημένο λογάριθμο, τότε ``k = 1 + int(log(abs(x), 2))``. Εάν το ``x`` είναι μηδέν, τότε το ``x.bit_length()`` επιστρέφει ``0``.

source: Equivalent to::
el: Ισοδύναμο με::

source: Return the number of ones in the binary representation of the absolute value of the integer. This is also known as the population count. Example::
el: Επιστρέφει τον αριθμό των μονάδων στην δυαδική αναπαράσταση της απόλυτης τιμής του ακεραίου. Αυτό είναι επίσης γνωστό ως το μέτρημα πληθυσμού (population count). Παράδειγμα::

source: Return an array of bytes representing an integer.
el: Επιστρέφει ένα πίνακα από bytes που αναπαριστούν έναν ακέραιο.

source: The integer is represented using *length* bytes, and defaults to 1. An :exc:`OverflowError` is raised if the integer is not representable with the given number of bytes.
el: Ο ακέραιος αναπαρίσταται χρησιμοποιώντας *length* bytes και η προεπιλεγμένη του τιμή (default) είναι 1. Ένα :exc:`OverflowError` γίνεται raise αν ο ακέραιος αριθμός δεν δύναται να αναπαρασταθεί με τον αριθμό bytes που δόθηκε.
