Repository: thepetk/python-docs-gr
Catalog: library/stdtypes.po
Languages: el

source: Test your application thoroughly if you use a low limit. Ensure your tests run with the limit set early via the environment or flag so that it applies during startup and even during any installation step that may invoke Python to precompile ``.py`` sources to ``.pyc`` files.
el: Δοκιμάστε σχολαστικά την εφαρμογή σας εάν χρησιμοποιείτε χαμηλό όριο. Βεβαιωθείτε ότι οι δοκιμές σας εκτελούνται με το όριο που έχει οριστεί νωρίς μέσω του περιβάλλοντος ή του δείκτη, ώστε να ισχύει κατά την εκκίνηση και ακόμη και κατά τη διάρκεια οποιουδήποτε βήματος εγκατάστασης που μπορεί να καλέσει την Python για να μεταγλωττίσει εκ των προτέρων το ``.py`` πηγαίο σε αρχεία ``.pyc``.

source: Recommended configuration
el: Προτεινόμενη διαμόρφωση

source: The default :data:`sys.int_info.default_max_str_digits` is expected to be reasonable for most applications. If your application requires a different limit, set it from your main entry point using Python version agnostic code as these APIs were added in security patch releases in versions before 3.12.
el: Το προεπιλεγμένο :data:`sys.int_info.default_max_str_digits` αναμένεται να είναι λογικό για τις περισσότερες εφαρμογές. Εάν η εφαρμογή σας απαιτεί διαφορετικό όριο, ορίστε το από το κύριο σημείο εισόδου σας χρησιμοποιώντας τον συμβατό με τον κώδικα της έκδοσης Python, καθώς αυτά τα API προστέθηκαν στην ενημερωμένη έκδοση κώδικα ασφαλείας σε εκδόσεις πριν από την 3.12.

source: Example::
el: Παράδειγμα::

source: If you need to disable it entirely, set it to ``0``.
el: Εάν πρέπει να το απενεργοποιήσετε εντελώς, ορίστε το σε ``0``.

source: Footnotes
el: Υποσημειώσεις

source: Additional information on these special methods may be found in the Python Reference Manual (:ref:`customization`).
el: Πρόσθετε πληροφορίες σχετικά με αυτές τις ειδικές μεθόδους μπορείτε να βρείτε στο Εγχειρίδιο Αναφοράς Python (:ref:`customization`).

source: As a consequence, the list ``[1, 2]`` is considered equal to ``[1.0, 2.0]``, and similarly for tuples.
el: Σαν συνέπεια, η λίστα ``[1, 2]`` θεωρείται ίση με ``[1.0, 2.0]``, και ομοίως για πλειάδες (tuples).

source: They must have since the parser can't tell the type of the operands.
el: Πρέπει να έχουν, αφού ο parser δεν μπορεί να ξεχωρίσει τον τύπο των τελεστών.

source: Cased characters are those with general category property being one of "Lu" (Letter, uppercase), "Ll" (Letter, lowercase), or "Lt" (Letter, titlecase).
el: Οι χαρακτήρες με πεζά είναι αυτοί με την ιδιότητα γενικής κατηγορίας να είναι ένας από τους "Lu" (Γράμμα, κεφαλαίο), "Ll" (Γράμμα, πεζά), ή "Lt" (Γράμμα, κεφαλαία).

source: To format only a tuple you should therefore provide a singleton tuple whose only element is the tuple to be formatted.
el: Για να μορφοποιήσετε μόνο μια πλειάδα (tuple) θα πρέπει επομένως να παρέχετε μια πλειάδα singleton της οποίας το μόνο στοιχείο είναι η πλειάδα που πρόκειται να μορφοποιηθεί.

source: built-in
el: ενσωματωμένοι (built-in) τύποι

source: types
el: τύποι

source: truth
el: αληθές

source: value
el: τιμή

source: operations
el: λειτουργίες

source: None (Built-in object)
el: None (Ενσωματωμένο (Built-in) αντικείμενο)

source: False (Built-in object)
el: False (Ενσωματωμένο (Built-in) αντικείμενο)

source: operator
el: τελεστής

source: chaining
el: αλυσίδα

source: comparisons
el: συγκρίσεις

source: comparison
el: σύγκριση

source: < (less)
el: < (μικρότερο)

source: > (greater)
el: > (μεγαλύτερο)

source: object
el: αντικείμενο

source: numeric
el: αριθμητικό

source: objects
el: αντικείμενα

source: comparing
el: συγκρίνοντας

source: __eq__() (instance method)
el: __eq__() (μέθοδος στιγμιοτύπου)

source: __ne__() (instance method)
el: __ne__() (μέθοδος στιγμιοτύπου)

source: __lt__() (instance method)
el: __lt__() (μέθοδος στιγμιοτύπου)

source: __le__() (instance method)
el: __le__() (μέθοδος στιγμιοτύπου)

source: __gt__() (instance method)
el: __gt__() (μέθοδος στιγμιοτύπου)

source: __ge__() (instance method)
el: __ge__() (μέθοδος στιγμιοτύπου)

source: integer
el: ακέραιος

source: floating-point
el: κινητής υποδιαστολής

source: complex number
el: μιγαδικός αριθμός

source: language
el: γλώσσα

source: hexadecimal
el: δεκαεξαδικό

source: octal
el: οκταδικό

source: binary
el: δυαδικό

source: arithmetic
el: αριθμητικό

source: built-in function
el: ενσωματωμένες (built-in) συναρτήσεις

source: + (plus)
el: + (συν)

source: unary operator
el: τελεστής unary

source: binary operator
el: δυαδικός τελεστής

source: - (minus)
el: - (πλην)

source: * (asterisk)
el: * (αστερίσκος)

source: / (slash)
el: / (κάθετος)

source: % (percent)
el: % (τοις εκατό)

source: operations on
el: λειτουργίες on

source: conjugate() (complex number method)
el: conjugate() (μέθοδος μιγαδικών αριθμών)

source: floor() (in module math)
el: floor() (στο module math)

source: ceil() (in module math)
el: ceil() (στο module math)

source: trunc() (in module math)
el: trunc() (στο module math)

source: conversions
el: μετατροπές

source: bitwise
el: δυαδικά

source: shifting
el: μετατόπιση (shifting)

source: masking
el: συγκάλυψη (masking)

source: | (vertical bar)
el: | (κάθετη μπάρα)

source: ~ (tilde)
el: ~ (περισπωμένη)

source: values
el: τιμές

source: iterator protocol
el: πρωτόκολλο iterator

source: protocol
el: πρωτόκολλο

source: operation
el: λειτουργία

source: repetition
el: επανάληψη

source: count() (sequence method)
el: count() (μέθοδος ακολουθίας)

source: index() (sequence method)
el: index() (μέθοδος ακολουθίας)

source: over mutable sequence
el: πάνω από μεταβλητή ακολουθίας

source: mutable sequence
el: μεταβλητή ακολουθίας

source: immutable
el: αμετάβλητο

source: tuple
el: πλειάδα (tuple)

source: mutable
el: ευμετάβλητο

source: list
el: λίστα

source: type
el: τύπος

source: assignment
el: εκχώρηση

source: append() (sequence method)
el: append() (μέθοδος ακολουθίας)

source: clear() (sequence method)
el: clear() (μέθοδος ακολουθίας)

source: copy() (sequence method)
el: copy() (μέθοδος ακολουθίας)

source: extend() (sequence method)
el: extend() (μέθοδος ακολουθίας)

source: insert() (sequence method)
el: insert() (μέθοδος ακολουθίας)

source: pop() (sequence method)
el: pop() (μέθοδος ακολουθίας)

source: remove() (sequence method)
el: remove() (μέθοδος ακολουθίας)

source: reverse() (sequence method)
el: reverse() (μέθοδος ακολουθίας)

source: text sequence type
el: τύπος ακολουθίας κειμένου

source: str (built-in class)
el: str (ενσωματωμένη (built-in) κλάση)

source: (see also string)
el: (βλ. επίσης string)

source: buffer protocol
el: πρωτόκολλο buffer

source: methods
el: μέθοδοι

source: universal newlines
el: καθολικές νέες γραμμές

source: str.splitlines method
el: μέθοδος str.splitlines

source: ! formatted string literal
el: ! μορφοποιημένη συμβολοσειρά κυριολεκτικής μορφής

source: formatted string literals
el: μορφοποιημένες συμβολοσειρές κυριολεξίας

source: f-strings
el: string

source: interpolated string literal
el: συμβολοσειρά κυριολεξίας με παρεμβολή

source: formatted literal
el: μορφοποιημένη κυριολεξία

source: interpolated literal
el: κυριολεκτικό με παρεμβολή

source: {} (curly brackets)
el: {} (αγκύλες)

source: in formatted string literal
el: μέσα σε μορφοποιημένη συμβολοσειρά

source: ! (exclamation mark)
el: ! (Θαυμαστικό)

source: : (colon)
el: : (άνω κάτω τελεία)

source: = (equals)
el: = (ίσο)

source: for help in debugging using string literals
el: για βοήθεια στην αποσφαλμάτωση μέσω κυριολεκτικών συμβολοσειρών

source: formatting, string (%)
el: μορφοποίηση, string (%)

source: interpolation, string (%)
el: παρεμβολή, string (%)

source: formatting, printf
el: μορφοποίηση, printf

source: interpolation, printf
el: παρεμβολή, printf

source: printf-style formatting
el: μορφοποίηση σε στυλ printf

source: sprintf-style formatting
el: μορφοποίηση σε στυλ sprintf

source: () (parentheses)
el: () (παρενθέσεις)

source: in printf-style formatting
el: σε μορφοποίηση σε στυλ printf

source: . (dot)
el: . (τελεία)

source: # (hash)
el: # (δίεση)

source: space
el: διάστημα

source: binary sequence types
el: τύπος δυαδικών ακολουθιών

source: array
el: πίνακας

source: bytes.splitlines method
el: bytes.splitlines μέθοδος

source: bytearray.splitlines method
el: bytearray.splitlines μέθοδος

source: formatting
el: μορφοποίηση

source: interpolation
el: μεταβολή

source: mapping
el: αντιστοίχιση

source: dictionary
el: λεξικό

source: context manager
el: διαχειριστής περιεχομένου

source: context management protocol
el: πρωτόκολλο διαχειριστή περιεχομένου

source: context management
el: διαχείριση περιεχομένου

source: Union
el: Ένωση

source: union
el: ένωση

source: method
el: μέθοδος

source: code
el: κώδικας

source: code object
el: αντικείμενο κώδικα

source: __code__ (function object attribute)
el: __code__ (χαρακτηριστικό αντικείμενου συνάρτησης)
