Repository: thepetk/python-docs-gr
Catalog: library/stdtypes.po
Languages: el

source: Keys views are set-like since their entries are unique and :term:`hashable`. Items views also have set-like operations since the (key, value) pairs are unique and the keys are hashable. If all values in an items view are hashable as well, then the items view can interoperate with other sets. (Values views are not treated as set-like since the entries are generally not unique.) For set-like views, all of the operations defined for the abstract base class :class:`collections.abc.Set` are available (for example, ``==``, ``<``, or ``^``). While using set operators, set-like views accept any iterable as the other operand, unlike sets which only accept sets as the input.
el: Οι όψεις κλειδιών μοιάζουν με σύνολο καθώς οι καταχωρίσεις τους είναι μοναδικές και :term:`hashable`. Οι όψεις στοιχείων έχουν επίσης λειτουργίες που μοιάζουν με σύνολο, καθώς τα ζεύγη (κλειδί, τιμή) είναι μοναδικά και τα κλειδιά μπορούν να κατακερματιστούν. Εάν όλες οι τιμές σε μία όψη στοιχείων μπορούν επίσης να κατακερματιστούν, τότε η όψη στοιχείων μπορεί να διαλειτουργήσει με άλλα σύνολα. (Οι όψεις τιμών δεν αντιμετωπίζονται ως σύνολο, καθώς οι καταχωρίσεις δεν είναι γενικά μοναδικές.) Για όψεις που μοιάζουν με σύνολο, όλες οι λειτουργίες που ορίζονται για την αφηρημένη βασική κλάση :class:`collections.abc.Set` είναι διαθέσιμες (για παράδειγμα, )``==``, ``<``, or ``^``). Κατά τη χρήση τελεστών συνόλου, οι όψεις που μοιάζουν με σύνολο δέχονται οποιοδήποτε iterable ως άλλο τελεστή, σε αντίθεση με τα σύνολα που δέχονται μόνο σύνολα ως είσοδο.

source: An example of dictionary view usage::
el: Ένα παράδειγμα χρήσης όψης λεξικού::

source: Context Manager Types
el: Τύποι Διαχείρισης Περιεχομένου

source: Python's :keyword:`with` statement supports the concept of a runtime context defined by a context manager. This is implemented using a pair of methods that allow user-defined classes to define a runtime context that is entered before the statement body is executed and exited when the statement ends:
el: Η δήλωση :keyword:`with` της Python υποστηρίζει την έννοια ενός περιεχομένου χρόνου εκτέλεσης που ορίζεται από έναν διαχειριστή περιεχομένου. Αυτό υλοποιείται χρησιμοποιώντας ένα ζεύγος μεθόδων που επιτρέπουν σε κλάσεις που ορίζονται από το χρήστη να ορίζουν περιεχόμενο χρόνου εκτέλεσης που εισάγεται πριν από την εκτέλεση του σώματος της δήλωσης και να κάνει έξοδο όταν τερματιστεί η δήλωση:

source: Enter the runtime context and return either this object or another object related to the runtime context. The value returned by this method is bound to the identifier in the :keyword:`!as` clause of :keyword:`with` statements using this context manager.
el: Εισάγει το περιεχόμενο εκτέλεσης και επιστρέφει είτε αυτό το αντικείμενο είτε ένα άλλο που σχετίζεται με το περιεχόμενο χρόνου εκτέλεσης. Η τιμή που επιστρέφεται από αυτήν την μέθοδο είναι δεσμευμένη στο αναγνωριστικό στην πρόταση :keyword:`!as` των δηλώσεων :keyword:`with` διαχείρισης περιεχομένου.

source: An example of a context manager that returns itself is a :term:`file object`. File objects return themselves from __enter__() to allow :func:`open` to be used as the context expression in a :keyword:`with` statement.
el: Ένα παράδειγμα ενός διαχειριστή περιεχομένου που επιστρέφει ο ίδιος είναι ένα :term:`file object`. Τα αντικείμενα αρχείου επιστρέφουν μόνα τους από __enter__() για να επιτρέψουν στο :func:`open` να χρησιμοποιηθεί ως έκφραση περιεχομένου σε μια δήλωση :keyword:`with`.

source: An example of a context manager that returns a related object is the one returned by :func:`decimal.localcontext`. These managers set the active decimal context to a copy of the original decimal context and then return the copy. This allows changes to be made to the current decimal context in the body of the :keyword:`with` statement without affecting code outside the :keyword:`!with` statement.
el: Ένα παράδειγμα διαχείρισης περιεχομένου που επιστρέφει ένα σχετικό αντικείμενο είναι αυτό που επιστρέφεται από το :func:`decimal.localcontext`. Αυτοί οι διαχειριστές ορίζουν το ενεργό δεκαδικό περιεχόμενο σε ένα αντίγραφο του αρχικού δεκαδικού περιεχομένου και στη συνέχεια επιστρέφουν το αντίγραφο. Αυτό επιτρέπει την πραγματοποίηση αλλαγών στο τρέχον δεκαδικό πλαίσιο στο σώμα της δήλωσης :keyword:`with`, χωρίς να επηρεάζεται ο κώδικας εκτός της δήλωσης :keyword:`!with`.

source: Exit the runtime context and return a Boolean flag indicating if any exception that occurred should be suppressed. If an exception occurred while executing the body of the :keyword:`with` statement, the arguments contain the exception type, value and traceback information. Otherwise, all three arguments are ``None``.
el: Τερματίζει από το περιεχόμενο χρόνου εκτέλεσης και επιστρέφει ένα Boolean δείκτη που υποδεικνύει εάν κάποια εξαίρεση που προέκυψε θα πρέπει να καταργηθεί. Εάν προκύψει μια εξαίρεση κατά την εκτέλεση του σώματος της δήλωσης :keyword:`with`, τα ορίσματα περιέχουν τον τύπο εξαίρεσης, την τιμή και τις πληροφορίες ανίχνευσης. Διαφορετικά, και τα τρία ορίσματα είναι ``None``.

source: Returning a true value from this method will cause the :keyword:`with` statement to suppress the exception and continue execution with the statement immediately following the :keyword:`!with` statement. Otherwise the exception continues propagating after this method has finished executing. Exceptions that occur during execution of this method will replace any exception that occurred in the body of the :keyword:`!with` statement.
el: Η επιστροφή μιας πραγματικής τιμής από αυτήν την μέθοδο θα έχει ως αποτέλεσμα η δήλωση :keyword:`with` να καταργήσει την εξαίρεση και να συνεχίσει την εκτέλεση με τη δήλωση αμέσως μετά τη δήλωση :keyword:`!with`. Διαφορετικά, η εξαίρεση θα συνεχίσει να διαδίδεται μετά την ολοκλήρωση αυτής της μεθόδου. Οι εξαιρέσεις που προκύπτουν κατά την εκτέλεση αυτής της μεθόδου θα αντικαταστήσουν κάθε εξαίρεση που προέκυψε στο σώμα της δήλωσης :keyword:`!with`.

source: The exception passed in should never be reraised explicitly - instead, this method should return a false value to indicate that the method completed successfully and does not want to suppress the raised exception. This allows context management code to easily detect whether or not an :meth:`~object.__exit__` method has actually failed.
el: Η εξαίρεση που διαβιβάστηκε δεν θα πρέπει ποτέ να επανατοποθετηθεί ρητά - αντίθετα, αυτή η μέθοδος θα πρέπει να επιστρέψει μια ψευδή τιμή για να υποδείξει ότι η μέθοδος ολοκληρώθηκε με επιτυχία και δεν θέλει να αποκρύψει την εξαίρεση που έχει γίνει raise. Αυτό επιτρέπει στον κώδικα διαχείρισης περιεχομένου να εντοπίζει εύκολα εάν μια μέθοδος :meth:`~object.__exit__` έχει πράγματι αποτύχει.

source: Python defines several context managers to support easy thread synchronisation, prompt closure of files or other objects, and simpler manipulation of the active decimal arithmetic context. The specific types are not treated specially beyond their implementation of the context management protocol. See the :mod:`contextlib` module for some examples.
el: Η Python ορίζει αρκετούς διαχειριστές περιεχομένου για να υποστηρίζουν τον εύκολο συγχρονισμό νημάτων, το άμεσο κλείσιμο αρχείων ή άλλων αντικειμένων και τον απλούστερο χειρισμό του ενεργού δεκαδικού αριθμητικού περιεχομένου. Οι συγκεκριμένοι τύποι δεν αντιμετωπίζονται ειδικά πέρα από την εφαρμογή τους πρωτοκόλλου διαχείρισης περιεχομένου. Δείτε το module :mod:`contextlib` για μερικά παραδείγματα.

source: Python's :term:`generator`\s and the :class:`contextlib.contextmanager` decorator provide a convenient way to implement these protocols. If a generator function is decorated with the :class:`contextlib.contextmanager` decorator, it will return a context manager implementing the necessary :meth:`~contextmanager.__enter__` and :meth:`~contextmanager.__exit__` methods, rather than the iterator produced by an undecorated generator function.
el: Οι decorators της Python :term:`generator`\s και :class:`contextlib.contextmanager` παρέχουν έναν βολικό τρόπο υλοποίησης αυτών των πρωτοκόλλων. Εάν μια συνάρτηση γεννήτριας είναι decorated με τον :class:`contextlib.contextmanager` decorator, θα επιστρέψει έναν διαχειριστή περιεχομένου που εφαρμόζει τις απαραίτητες μεθόδους :meth:`~contextmanager.__enter__` και :meth:`~contextmanager.__exit__`, αντί του iterator που παράγεται από μια undecorated συνάρτηση γεννήτριας.

source: Note that there is no specific slot for any of these methods in the type structure for Python objects in the Python/C API. Extension types wanting to define these methods must provide them as a normal Python accessible method. Compared to the overhead of setting up the runtime context, the overhead of a single class dictionary lookup is negligible.
el: Λάβετε υπόψη ότι δεν υπάρχει συγκεκριμένη υποδοχή για καμία από αυτές τις μεθόδους στη δομή τύπου για αντικείμενα Python στο Python/C API. Οι τύποι επεκτάσεων που θέλουν να ορίσουν αυτές τις μεθόδους πρέπει να τις παρέχουν ως μια κανονική μέθοδο προσβάσιμη στην Python. Σε σύγκριση με την επιβάρυνση της ρύθμισης στο πλαίσιο του χρόνου εκτέλεσης, η επιβάρυνση μιας απλής αναζήτησης κλάσης λεξικού είναι αμελητέα.

source: Type Annotation Types --- :ref:`Generic Alias <types-genericalias>`, :ref:`Union <types-union>`
el: Τύποι Annotation τύπου --- :ref:`Generic Alias <types-genericalias>`, :ref:`Union <types-union>`

source: The core built-in types for :term:`type annotations <annotation>` are :ref:`Generic Alias <types-genericalias>` and :ref:`Union <types-union>`.
el: Οι βασικοί ενσωματωμένοι τύποι για :term:`type annotations <annotation>` είναι :ref:`Generic Alias <types-genericalias>` και :ref:`Union <types-union>`.

source: Generic Alias Type
el: Τύπος Generic Alias

source: ``GenericAlias`` objects are generally created by :ref:`subscripting <subscriptions>` a class. They are most often used with :ref:`container classes <sequence-types>`, such as :class:`list` or :class:`dict`. For example, ``list[int]`` is a ``GenericAlias`` object created by subscripting the ``list`` class with the argument :class:`int`. ``GenericAlias`` objects are intended primarily for use with :term:`type annotations <annotation>`.
el: Τα αντικείμενα ``GenericAlias`` δημιουργούνται γενικά με :ref:`subscripting <subscriptions>` κλάση. Χρησιμοποιούνται πιο συχνά με :ref:`container classes <sequence-types>`, όπως :class:`list` ή :class:`dict`.Για παράδειγμα, το ``list[int]`` είναι ένα αντικείμενο ``GenericAlias`` που δημιουργήθηκε με την εγγραφή της κλάσης ``list`` με το όρισμα :class:`int`. Τα αντικείμενα ``GenericAlias`` προορίζονται κυρίως για χρήση με :term:`type annotations <annotation>`.

source: It is generally only possible to subscript a class if the class implements the special method :meth:`~object.__class_getitem__`.
el: Γενικά είναι δυνατή η εγγραφή μιας κλάσης μόνο εάν η κλάση εφαρμόζει την ειδική μέθοδο :meth:`~object.__class_getitem__`.

source: A ``GenericAlias`` object acts as a proxy for a :term:`generic type`, implementing *parameterized generics*.
el: Ένα αντικείμενο ``GenericAlias`` λειτουργεί ως διακομιστής μεσολάβησης (proxy) για έναν :term:`generic type`, υλοποιώντας *parameterized generics*.

source: For a container class, the argument(s) supplied to a :ref:`subscription <subscriptions>` of the class may indicate the type(s) of the elements an object contains. For example, ``set[bytes]`` can be used in type annotations to signify a :class:`set` in which all the elements are of type :class:`bytes`.
el: Για μια κλάση container, το(α) όρισμα(τα) που παρέχει σε μια :ref:`subscription <subscriptions>` της κλάσης μπορεί να υποδεικνύει τον(ους) τύπο(ους) των στοιχείων που περιέχει ένα αντικείμενο. Για παράδειγμα, το ``set[bytes]`` μπορεί να χρησιμοποιηθεί σε annotations τύπου για να υποδηλώσει ένα :class:`set` στο οποίο όλα τα στοιχεία είναι τύπου :class:`bytes`.

source: For a class which defines :meth:`~object.__class_getitem__` but is not a container, the argument(s) supplied to a subscription of the class will often indicate the return type(s) of one or more methods defined on an object. For example, :mod:`regular expressions <re>` can be used on both the :class:`str` data type and the :class:`bytes` data type:
el: Για μια κλάση που ορίζει :meth:`~object.__class_getitem__` αλλά δεν είναι container, τα ορίσματα που παρέχονται σε μια συνδρομή της κλάσης θα υποδεικνύουν συχνά τον τύπο ή τους τύπους επιστροφής μιας ή περισσότερων μεθόδων που ορίζονται σε ένα αντικείμενο. Για παράδειγμα, το :mod:`regular expressions <re>` μπορούν να χρησιμοποιηθούν τόσο στον τύπο δεδομένων :class:`str` όσο και στον τύπο δεδομένων :class:`bytes`:

source: If ``x = re.search('foo', 'foo')``, ``x`` will be a :ref:`re.Match <match-objects>` object where the return values of ``x.group(0)`` and ``x[0]`` will both be of type :class:`str`. We can represent this kind of object in type annotations with the ``GenericAlias`` ``re.Match[str]``.
el: Εάν ``x = re.search('foo', 'foo')``, το ``x`` θα είναι ένα αντικείμενο :ref:`re.Match <match-objects>` όπου επιστρέφονται οι τιμές του το ``x.group(0)`` και το ``x[0]`` θα είναι και τα δύο τύπου :class:`str`. Μπορούμε να αναπαραστήσουμε αυτό το είδος αντικειμένου σε σχολιασμούς τύπου με το ``GenericAlias`` ``re.Match[str]``.

source: If ``y = re.search(b'bar', b'bar')``, (note the ``b`` for :class:`bytes`), ``y`` will also be an instance of ``re.Match``, but the return values of ``y.group(0)`` and ``y[0]`` will both be of type :class:`bytes`. In type annotations, we would represent this variety of :ref:`re.Match <match-objects>` objects with ``re.Match[bytes]``.
el: Εάν ``y = re.search(b'bar', b'bar')``, (σημειώστε το ``b`` για :class:`bytes`), το ``y`` θα είναι επίσης μια παρουσία του ``re.Match``, αλλά οι επιστρεφόμενες τιμές των ``y.group(0)`` και ``y[0]`` θα είναι και οι δύο τύπου :class:`bytes`. Στους τύπους annotations, θα αντιπροσωπεύαμε αυτήν την ποικιλία αντικειμένων :ref:`re.Match <match-objects>` με το ``re.Match[bytes]``.

source: ``GenericAlias`` objects are instances of the class :class:`types.GenericAlias`, which can also be used to create ``GenericAlias`` objects directly.
el: Τα αντικείμενα ``GenericAlias`` είναι στιγμιότυπα της κλάσης :class:`types.GenericAlias`, τα οποία μπορούν επίσης να χρησιμοποιηθούν για την δημιουργία αντικειμένων ``GenericAlias`` απευθείας.

source: Creates a ``GenericAlias`` representing a type ``T`` parameterized by types *X*, *Y*, and more depending on the ``T`` used. For example, a function expecting a :class:`list` containing :class:`float` elements::
el: Δημιουργεί ένα ``GenericAlias`` που αντιπροσωπεύει έναν τύπο ``T`` παραμετροποιημένο από τύπους *X*, *Y*, και άλλα ανάλογα με το ``T`` που χρησιμοποιείται. Για παράδειγμα, μια συνάρτηση που αναμένει μια :class:`list` που περιέχει στοιχεία της :class:`float`::

source: Another example for :term:`mapping` objects, using a :class:`dict`, which is a generic type expecting two type parameters representing the key type and the value type. In this example, the function expects a ``dict`` with keys of type :class:`str` and values of type :class:`int`::
el: Ένα άλλο παράδειγμα για αντικείμενα :term:`mapping`, χρησιμοποιώντας ένα :class:`dict`,που είναι ένας generic τύπος που αναμένει δύο παραμέτρους τύπου που αντιπροσωπεύουν τον τύπο κλειδιού και τον τύπο τιμής. Σε αυτό το παράδειγμα, η συνάρτηση αναμένει ένα ``dict`` με κλειδιά τύπου :class:`str` και τιμές τύπου :class:`int`::

source: The builtin functions :func:`isinstance` and :func:`issubclass` do not accept ``GenericAlias`` types for their second argument::
el: Οι ενσωματωμένες συναρτήσεις (built-in) :func:`isinstance` και :func:`issubclass` δεν δέχονται τους τύπους ``GenericAlias`` για το δεύτερο όρισμά τους::

source: The Python runtime does not enforce :term:`type annotations <annotation>`. This extends to generic types and their type parameters. When creating a container object from a ``GenericAlias``, the elements in the container are not checked against their type. For example, the following code is discouraged, but will run without errors::
el: Ο χρόνος εκτέλεσης Python δεν επιβάλλει :term:`type annotations <annotation>`. Αυτό επεκτείνεται σε generic τύπους και στις παραμέτρους τύπου τους. Κατά τη δημιουργία ενός αντικειμένου container από ένα ``GenericAlias``, τα στοιχεία στο container δεν ελέγχονται ως προς τον τύπο τους. Για παράδειγμα, ο ακόλουθος κώδικας αποθαρρύνεται, αλλά θα εκτελεστεί χωρίς σφάλματα::

source: Furthermore, parameterized generics erase type parameters during object creation::
el: Επιπλέον, τα παραμετροποιημένα generics διαγράφουν τις παραμέτρους τύπου κατά τη δημιουργία αντικειμένου::

source: Calling :func:`repr` or :func:`str` on a generic shows the parameterized type::
el: Η κλήση :func:`repr` ή :func:`str` σε ένα generic δείχνει τον παραμετροποιημένο τύπο::

source: The :meth:`~object.__getitem__` method of generic containers will raise an exception to disallow mistakes like ``dict[str][str]``::
el: Η μέθοδος :meth:`~object.__getitem__` των generic containers θα κάνει raise μια εξαίρεση για την απαγόρευση λαθών όπως ``dict[str][str]``::

source: However, such expressions are valid when :ref:`type variables <generics>` are used. The index must have as many elements as there are type variable items in the ``GenericAlias`` object's :attr:`~genericalias.__args__`. ::
el: Ωστόσο, τέτοιες εκφράσεις είναι έγκυρες όταν χρησιμοποιούνται μεταβλητές τύπου :ref:`type variables <generics>`. Το ευρετήριο πρέπει να έχει τόσα στοιχεία όσα και τα στοιχεία μεταβλητής τύπου στο αντικείμενο ``GenericAlias`` :attr:`~genericalias.__args__`. ::

source: Standard Generic Classes
el: Τυπικές Γενικές Κλάσεις

source: The following standard library classes support parameterized generics. This list is non-exhaustive.
el: Οι ακόλουθες τυπικές κλάσεις βιβλιοθήκης υποστηρίζουν γενικά παραμετροποιημένα. Αυτή η λίστα δεν είναι εξαντλητική.

source: Special Attributes of ``GenericAlias`` objects
el: Ειδικά Χαρακτηριστικά αντικειμένων ``GenericAlias``

source: All parameterized generics implement special read-only attributes.
el: Όλα τα παραμετροποιημένα generics εφαρμόζουν ειδικά χαρακτηριστικά μόνο για ανάγνωση.

source: This attribute points at the non-parameterized generic class::
el: Αυτό το χαρακτηριστικό δείχνει στη μη παραμετροποιημένη γενική κλάση::

source: This attribute is a :class:`tuple` (possibly of length 1) of generic types passed to the original :meth:`~object.__class_getitem__` of the generic class::
el: Αυτό το χαρακτηριστικό είναι μια :class:`tuple` (πιθανώς μήκους 1) generic τύπων που μεταβιβάστηκαν στο αρχικό :meth:`~object.__class_getitem__` της generic κλάσης::

source: This attribute is a lazily computed tuple (possibly empty) of unique type variables found in ``__args__``::
el: Αυτό το χαρακτηριστικό είναι μία νωχελικά υπολογισμένη πλειάδα (tuple) (πιθανώς κενή) μεταβλητών μοναδικού τύπου που βρίσκονται στο ``__args__``::

source: A ``GenericAlias`` object with :class:`typing.ParamSpec` parameters may not have correct ``__parameters__`` after substitution because :class:`typing.ParamSpec` is intended primarily for static type checking.
el: Ένα αντικείμενο ``GenericAlias`` με παραμέτρους :class:`typing.ParamSpec` ενδέχεται να μην έχει σωστές ``__parameters__`` μετά την αντικατάσταση επειδή το :class:`typing.ParamSpec` προορίζεται κυρίως για έλεγχο στατικού τύπου.

source: A boolean that is true if the alias has been unpacked using the ``*`` operator (see :data:`~typing.TypeVarTuple`).
el: Ένα boolean που ισχύει αν το alias έχει αποσυμπιεστεί χρησιμοποιώντας τον τελεστή ``*`` (δείτε το :data:`~typing.TypeVarTuple`).

source: Introducing Python's framework for type annotations.
el: Παρουσιάζοντας το framework της Python για τύπους annotations.

source: :pep:`585` - Type Hinting Generics In Standard Collections
el: :pep:`585` - Τύπος Generics Συμβουλών στις Τυπικές Συλλογές

source: Introducing the ability to natively parameterize standard-library classes, provided they implement the special class method :meth:`~object.__class_getitem__`.
el: Εισαγωγή της δυνατότητας εγγενούς παραμετροποίησης κλάσεων τυπικής βιβλιοθήκης, υπό την προϋπόθεση ότι εφαρμόζουν τη μέθοδο ειδικής κλάσης :meth:`~object.__class_getitem__`.

source: :ref:`Generics`, :ref:`user-defined generics <user-defined-generics>` and :class:`typing.Generic`
el: Τα :ref:`Generics`, :ref:`user-defined generics <user-defined-generics>` και :class:`typing.Generic`

source: Documentation on how to implement generic classes that can be parameterized at runtime and understood by static type-checkers.
el: Τεκμηρίωση για τον τρόπο υλοποίησης generic κλάσεων που μπορούν να παραμετροποιηθούν κατά το χρόνο εκτέλεσης και να κατανοηθούν από στατικούς ελεγκτές τύπων.

source: Union Type
el: Τύπος Ένωσης

source: A union object holds the value of the ``|`` (bitwise or) operation on multiple :ref:`type objects <bltin-type-objects>`. These types are intended primarily for :term:`type annotations <annotation>`. The union type expression enables cleaner type hinting syntax compared to subscripting :class:`typing.Union`.
el: Ένα αντικείμενο ένωσης διατηρεί την τιμή της λειτουργίας ``|`` (bitwise or) σε πολλαπλά αντικείμενα :ref:`type objects <bltin-type-objects>`. Αυτοί οι τύποι προορίζονται κυρίως για :term:`type annotations <annotation>`. Η έκφραση τύπου ένωσης επιτρέπει την καθαρότερη σύνταξη υποδείξεων σε σύγκριση με την εγγραφή :class:`typing.Union`.

source: Defines a union object which holds types *X*, *Y*, and so forth. ``X | Y`` means either X or Y. It is equivalent to ``typing.Union[X, Y]``. For example, the following function expects an argument of type :class:`int` or :class:`float`::
el: Ορίζει ένα αντικείμενο ένωσης που περιέχει τύπους *X*, *Y*, και ούτω καθεξής. Το ``X | Y`` σημαίνει είτε X είτε Y. Είναι ισοδύναμο με το ``typing.Union[X, Y]``. Για παράδειγμα, η ακόλουθη συνάρτηση αναμένει ένα όρισμα τύπου :class:`int` or :class:`float`::

source: The ``|`` operand cannot be used at runtime to define unions where one or more members is a forward reference. For example, ``int | "Foo"``, where ``"Foo"`` is a reference to a class not yet defined, will fail at runtime. For unions which include forward references, present the whole expression as a string, e.g. ``"int | Foo"``.
el: Ο τελεστής ``|`` δεν μπορεί να χρησιμοποιηθεί κατά το χρόνο εκτέλεσης για να ορίσει ενώσεις όπου ένα ή περισσότερα μέλη είναι μια μπροστινή αναφορά. Για παράδειγμα το ``int | "Foo"``, όπου το ``"Foo"`` είναι μια αναφορά σε μια κλάση που δεν έχει ακόμη καθοριστεί, θα αποτύχει κατά το χρόνο εκτέλεσης. Για ενώσεις που περιλαμβάνουν μπροστινές αναφορές, παρουσιάζει ολόκληρη την έκφραση ως συμβολοσειρά, π.χ. ``"int | Foo"``.

source: Union objects can be tested for equality with other union objects. Details:
el: Τα αντικείμενα ένωσης μπορούν να ελεγχθούν για ισότητα με άλλα αντικείμενα ένωσης. Λεπτομέρειες:

source: Unions of unions are flattened::
el: Οι ενώσεις των ενώσεων ισοπεδώνονται::

source: Redundant types are removed::
el: Οι περιττοί τύποι καταργούνται::

source: When comparing unions, the order is ignored::
el: Κατά τη σύγκριση των ενώσεων, η σειρά αγνοείται::

source: It creates instances of :class:`typing.Union`::
el: Δημιουργεί στιγμιότυπα της :class:`typing.Union`::

source: Optional types can be spelled as a union with ``None``::
el: Οι προαιρετικοί τύποι μπορούν να γραφτούν ως ένωση με ``None``::

source: Calls to :func:`isinstance` and :func:`issubclass` are also supported with a union object::
el: Οι κλήσεις σε :func:`isinstance` και :func:`issubclass` υποστηρίζονται επίσης με ένα αντικείμενο ένωσης::

source: However, :ref:`parameterized generics <types-genericalias>` in union objects cannot be checked::
el: Ωστόσο, το :ref:`parameterized generics <types-genericalias>` σε αντικείμενα ένωσης δεν μπορούν να ελεγχθούν::
