Repository: thepetk/python-docs-gr
Catalog: using/unix.po
Languages: el

source: Using Python on Unix platforms
el: Χρήση της Python σε πλατφόρμες Unix

source: Getting and installing the latest version of Python
el: Λήψη και εγκατάσταση της πιο πρόσφατης έκδοσης Python

source: On Linux
el: Σε Linux

source: Python comes preinstalled on most Linux distributions, and is available as a package on all others. However there are certain features you might want to use that are not available on your distro's package. You can compile the latest version of Python from source.
el: Η Python είναι προεγκατεστημένη στις περισσότερες διανομές Linux, ενώ διατίθεται ως πακέτο σε όλες τις υπόλοιπες. Ωστόσο, υπάρχουν ορισμένα χαρακτηριστικά που μπορεί να θέλετε να χρησιμοποιήσετε, τα οποία δεν είναι διαθέσιμα στο πακέτο της διανομής σας. Μπορείτε να κάνετε compile την πιο πρόσφατη έκδοση της Python από τον πηγαίο κώδικα.

source: In the event that the latest version of Python doesn't come preinstalled and isn't in the repositories as well, you can make packages for your own distro. Have a look at the following links:
el: Στην περίπτωση που η πιο πρόσφατη έκδοση Python δεν είναι προεγκατεστημένη και επίσης δεν ανήκει στα αποθετήρια, μπορείτε να δημιουργήσετε πακέτα για τη δική σας διανομή. Δείτε τα παρακάτω links:

source: for Debian users
el: για τους χρήστες του Debian

source: for OpenSuse users
el: για τους χρήστες του OpenSuse

source: for Fedora users
el: για τους χρήστες του Fedora

source: for Slackware users
el: για τους χρήστες του Slackware

source: Installing IDLE
el: Εγκατάσταση του IDLE

source: In some cases, IDLE might not be included in your Python installation.
el: Σε μερικές περιπτώσεις, το IDLE μπορεί να μην περιλαμβάνεται στην εγκατάσταση της Python.

source: For Debian and Ubuntu users::
el: Για τους χρήστες του Debian και του Ubuntu::

source: For Fedora, RHEL, and CentOS users::
el: Για τους χρήστες των Fedora, RHEL, και CentOS::

source: For SUSE and OpenSUSE users::
el: Για τους χρήστες των SUSE και OpenSUSE::

source: For Alpine Linux users::
el: Για τους χρήστες του Alpine Linux::

source: On FreeBSD and OpenBSD
el: Σε FreeBSD και OpenBSD

source: FreeBSD users, to add the package use::
el: Χρήστες του FreeBSD, για την προσθήκη του πακέτου χρησιμοποιήστε::

source: OpenBSD users, to add the package use::
el: Χρήστες του OpenBSD, για την προσθήκη του πακέτου χρησιμοποιήστε::

source: For example i386 users get the 2.5.1 version of Python using::
el: Για παράδειγμα, χρήστες του i386 κάνουν λήψη της έκδοσης 2.5.1 χρησιμοποιώντας::

source: Building Python
el: Μεταγλώττιση της Python

source: If you want to compile CPython yourself, first thing you should do is get the `source <https://www.python.org/downloads/source/>`_. You can download either the latest release's source or just grab a fresh `clone <https://devguide.python.org/setup/#get-the-source-code>`_. (If you want to contribute patches, you will need a clone.)
el: Αν θέλετε να κάνετε compile το CPython μόνοι σας, το πρώτο πράγμα που πρέπει να κάνετε είναι να πάρετε τον πηγαίο κώδικα <https://www.python.org/downloads/source/>`_. Μπορείτε να κατεβάσετε είτε τον πηγαίο κώδικα της τελευταίας έκδοσης είτε απλά να πάρετε έναν καινούργιο `clone <https://devguide.python.org/setup/#get-the-source-code>`_. (Αν θέλετε να συνεισφέρετε διορθώσεις, θα χρειαστείτε έναν κλώνο).

source: The build process consists of the usual commands::
el: Η διαδικασία της μεταγλώττισης απαρτίζεται από τις συνήθεις εντολές::

source: :ref:`Configuration options <configure-options>` and caveats for specific Unix platforms are extensively documented in the :source:`README.rst` file in the root of the Python source tree.
el: Το :ref:`Configuration options <configure-options>` και οι όροι για συγκεκριμένες πλατφόρμες Unix τεκμηριώνονται εκτενώς στο αρχείο :source:`README.rst` στην βάση του πηγαίου δέντρου της Python.

source: ``make install`` can overwrite or masquerade the :file:`python3` binary. ``make altinstall`` is therefore recommended instead of ``make install`` since it only installs :file:`{exec_prefix}/bin/python{version}`.
el: Το ``make install`` μπορεί να αντικαταστήσει ή να μεταμφιέσει το :file:`python3` σε δυαδικό. Επομένως προτείνεται το ``make altinstall`` σε σχέση με το ``make install`` που μπορεί να εγκαταστήσει μόνο το :file`{exec_prefix}/bin/python{version}`.

source: Python-related paths and files
el: Διαδρομές και αρχεία που σχετίζονται με την Python

source: These are subject to difference depending on local installation conventions; :option:`prefix <--prefix>` and :option:`exec_prefix <--exec-prefix>` are installation-dependent and should be interpreted as for GNU software; they may be the same.
el: Αυτά ενδέχεται να διαφέρουν ανάλογα με τις τοπικές συμβάσεις εγκατάστασης∙ τα :option:`prefix <--prefix>` και :option:`exec_prefix <--exec-prefix>` εξαρτώνται από την εγκατάσταση και θα πρέπει να ερμηνεύονται όπως για το λογισμικό GNU∙ μπορεί να είναι τα ίδια.

source: For example, on most Linux systems, the default for both is :file:`/usr`.
el: Για παράδειγμα, στα περισσότερα Linux συστήματα, η προεπιλογή είναι και για τα δύο :file:`/usr`.

source: Meaning
el: Που σημαίνει

source: Recommended location of the interpreter.
el: Προτεινόμενη θέση του διερμηνέα.

source: Recommended locations of the directories containing the standard modules.
el: Προτεινόμενες θέσεις για τους καταλόγους που περιέχουν τα βασικά modules.

source: Recommended locations of the directories containing the include files needed for developing Python extensions and embedding the interpreter.
el: Προτεινόμενες θέσεις των καταλόγων που περιέχουν τα αρχεία κεφαλίδων (include files) που απαιτούνται για την ανάπτυξη επεκτάσεων της Python και την ενσωμάτωση του διερμηνέα.

source: Miscellaneous
el: Διάφορα

source: To easily use Python scripts on Unix, you need to make them executable, e.g. with
el: Για να εκτελείτε εύκολα τα Python scripts σε συστήματα Unix, πρέπει να τα κάνετε εκτελέσιμα, για παράδειγμα με

source: and put an appropriate Shebang line at the top of the script. A good choice is usually ::
el: και να προσθέσετε μια κατάλληλη γραμμή Shebang στην αρχή του script. Μια καλή επιλογή είναι συνήθως ::

source: which searches for the Python interpreter in the whole :envvar:`PATH`. However, some Unices may not have the :program:`env` command, so you may need to hardcode ``/usr/bin/python3`` as the interpreter path.
el: που κάνει αναζήτηση για τον διερμηνέα της Python σε ολόκληρο το :envvar:`PATH`. Ωστόσο, ορισμένα Unices μπορεί να μην έχουν την εντολή :program:`env`, οπότε μπορεί να χρειαστεί να κωδικοποιήσετε το ``/usr/bin/python3`` ως διαδρομή του διερμηνέα.

source: To use shell commands in your Python scripts, look at the :mod:`subprocess` module.
el: Για να χρησιμοποιήσετε εντολές shell στα Python script σας, δείτε την ενότητα :mod:`subprocess`.

source: To use your vendor's OpenSSL configuration and system trust store, locate the directory with ``openssl.cnf`` file or symlink in ``/etc``. On most distribution the file is either in ``/etc/ssl`` or ``/etc/pki/tls``. The directory should also contain a ``cert.pem`` file and/or a ``certs`` directory.
el: Για να χρησιμοποιήσετε τις ρυθμίσεις του OpenSSL και το αποθετήριο εμπιστοσύνης συστήματος, εντοπίστε τον κατάλογο με το αρχείο ``openssl.cnf`` ή τον συμβολικό σύνδεσμο στο ``/etc``. Στις περισσότερες διανομές το αρχείο βρίσκεται είτε στο ``/etc/ssl`` είτε στο ``/etc/pki/tls``. Ο κατάλογος θα πρέπει επίσης να περιέχει ένα αρχείο ``cert.pem`` και/ή έναν κατάλογο ``certs``.

source: Download, build, and install OpenSSL. Make sure you use ``install_sw`` and not ``install``. The ``install_sw`` target does not override ``openssl.cnf``.
el: Λήψη, δημιουργία και εγκατάσταση του OenSSL. Βεβαιωθείτε ότι χρησιμοποιείτε το ``install_sw`` και όχι το ``install``. Ο στόχος ``install_sw`` δεν παρακάμπτει το αρχείο ``openssl.cnf``.

source: Build Python with custom OpenSSL (see the configure ``--with-openssl`` and ``--with-openssl-rpath`` options)
el: Μεταγλώττιση της Python με προσαρμοσμένο OpenSSL (δείτε τις επιλογές configure ``----with-openssl`` και ``----with-openssl-rpath``)

source: Patch releases of OpenSSL have a backwards compatible ABI. You don't need to recompile Python to update OpenSSL. It's sufficient to replace the custom OpenSSL installation with a newer version.
el: Οι διορθωτικές εκδόσεις του OpenSSL έχουν μια δυαδική διεπαφή εφαρμογής (ABI) συμβατή προς τα πίσω. Δεν χρειάζεται να κάνετε compile εκ νέου την Python για να ενημερώσετε το OpenSSL. Αρκεί να αντικαταστήσετε την προσαρμοσμένη εγκατάσταση του OpenSSL με μια νεότερη έκδοση.
